{
    "id": "69714275",
    "case_name": "State of Maryland v. United States Department of Agriculture",
    "last_updated": "Thursday Apr 17 at 06 PM CDT",
    "entries": [
        {
            "resource_uri": "https://www.courtlistener.com/api/rest/v4/docket-entries/422225124/",
            "id": 422225124,
            "docket": "https://www.courtlistener.com/api/rest/v4/dockets/69714275/",
            "recap_documents": [
                {
                    "resource_uri": "https://www.courtlistener.com/api/rest/v4/recap-documents/436249005/",
                    "id": 436249005,
                    "tags": [],
                    "absolute_url": "/docket/69714275/139/state-of-maryland-v-united-states-department-of-agriculture/",
                    "date_created": "2025-04-13T06:24:08.386589-07:00",
                    "date_modified": "2025-04-14T07:10:30.288507-07:00",
                    "sha1": "eaf9912c4551caf3e0a70f791e655722459025c6",
                    "page_count": 12,
                    "file_size": 187513,
                    "filepath_local": "recap/gov.uscourts.mdd.578045/gov.uscourts.mdd.578045.139.0.pdf",
                    "filepath_ia": "https://archive.org/download/gov.uscourts.mdd.578045/gov.uscourts.mdd.578045.139.0.pdf",
                    "ia_upload_failure_count": null,
                    "thumbnail": "recap-thumbnails/gov.uscourts.mdd.578045/436249005.thumb.1068.png",
                    "thumbnail_status": 1,
                    "plain_text": "USCA4 Appeal: 25-1248    Doc: 42         Filed: 04/09/2025 Pg: 1 of 12\n             Case 1:25-cv-00748-JKB      Document 139 Filed 04/09/25       Page 1 of 12\n\n\n\n                                                                         FILED: April 9, 2025\n\n\n                             UNITED STATES COURT OF APPEALS\n                                 FOR THE FOURTH CIRCUIT\n\n\n                                             No. 25-1248\n                                        (1:25-cv-00748-JKB)\n\n\n        STATE OF MARYLAND; STATE OF MINNESOTA; DISTRICT OF\n        COLUMBIA; STATE OF ARIZONA; STATE OF CALIFORNIA; STATE OF\n        COLORADO; STATE OF CONNECTICUT; STATE OF DELAWARE; STATE\n        OF HAWAII; STATE OF ILLINOIS; STATE OF MASSACHUSETTS; STATE\n        OF MICHIGAN; STATE OF NEVADA; STATE OF NEW JERSEY; STATE OF\n        NEW MEXICO; STATE OF NEW YORK; STATE OF OREGON; STATE OF\n        RHODE ISLAND; STATE OF VERMONT; STATE OF WISCONSIN,\n\n                           Plaintiffs – Appellees,\n\n                    v.\n\n        UNITED STATES DEPARTMENT OF AGRICULTURE; BROOKE ROLLINS,\n        in her Official Capacity as Secretary of Agriculture; UNITED STATES\n        DEPARTMENT OF COMMERCE; HOWARD LUTNICK, in his Official\n        Capacity as Secretary of Commerce; UNITED STATES DEPARTMENT OF\n        DEFENSE; PETER HEGSETH, In his Official Capacity as Secretary of Defense;\n        UNITED STATES DEPARTMENT OF EDUCATION; LINDA MCMAHON, in\n        her Official Capacity as Secretary of Education; UNITED STATES\n        DEPARTMENT OF ENERGY; CHRISTOPHER WRIGHT, in his Official\n        Capacity as Secretary of Energy; UNITED STATES DEPARTMENT OF\n        HEALTH & HUMAN SERVICES; ROBERT F. KENNEDY, JR., in his Official\n        Capacity as Secretary of Health and Human Services; UNITED STATES\n        DEPARTMENT OF HOMELAND SECURITY; KRISTI NOEM, in her Official\n        Capacity as Secretary of Homeland Security; UNITED STATES DEPARTMENT\n        OF HOUSING & URBAN DEVELOPMENT; SCOTT TURNER, in his Official\n        Capacity as Secretary of Housing and Urban Development; UNITED STATES\n        DEPARTMENT OF THE INTERIOR; DOUGLAS BURGUM, in his Official\n        Capacity as Secretary of the Interior; UNITED STATES DEPARTMENT OF\n        LABOR; VINCENT MICONE, in his Official Capacity as Acting Secretary of\n        Labor; UNITED STATES DEPARTMENT OF TRANSPORTATION; SEAN P.\n        DUFFY, in his Official Capacity as Secretary of Transportation; UNITED STATES\n\fUSCA4 Appeal: 25-1248    Doc: 42         Filed: 04/09/2025 Pg: 2 of 12\n             Case 1:25-cv-00748-JKB      Document 139 Filed 04/09/25       Page 2 of 12\n\n\n\n        DEPARTMENT OF THE TREASURY; SCOTT BESSENT, in his Official\n        Capacity as Secretary of the Treasury; UNITED STATES DEPARTMENT OF\n        VETERANS AFFAIRS; DOUGLAS A. COLLINS, in his Official Capacity as\n        Secretary of Veterans Affairs; CONSUMER FINANCIAL PROTECTION\n        BUREAU; RUSSELL VOUGHT, in his Official Capacity as Acting Director of the\n        Consumer Financial Protection Bureau; UNITED STATES ENVIRONMENTAL\n        PROTECTION AGENCY; LEE ZELDIN, in his Official Capacity as Administrator\n        of the Environmental Protection Agency; FEDERAL DEPOSIT INSURANCE\n        CORPORATION; TRAVIS HILL, in his Official Capacity as Acting Chairman of\n        the Federal Deposit Insurance Corporation; GENERAL SERVICES\n        ADMINISTRATION; STEPHEN EHIKIAN, in his Official Capacity as Acting\n        Administrator of the General Services Administration; NATIONAL ARCHIVES\n        AND RECORDS ADMINISTRATION; OFFICE OF PERSONNEL\n        MANAGEMENT; CHARLES EZELL, in his Official Capacity as Acting Director\n        of the Office of Personnel Management; SMALL BUSINESS\n        ADMINISTRATION; KELLY LOEFLER, in her Official Capacity as\n        Administrator of the Small Business Administration; UNITED STATES AGENCY\n        FOR INTERNATIONAL DEVELOPMENT; MARCO RUBIO, in his Official\n        Capacity as Acting Administrator of the United States Agency for International\n        Development and Archivist for the National Archives and Records Administration,\n\n                           Defendants – Appellants.\n\n\n\n                                            No: 25-1338\n                                        (1:25-cv-00748-JKB)\n\n\n        STATE OF MARYLAND; STATE OF MINNESOTA; DISTRICT OF\n        COLUMBIA; STATE OF ARIZONA; STATE OF CALIFORNIA; STATE OF\n        COLORADO; STATE OF CONNECTICUT; STATE OF DELAWARE; STATE\n        OF HAWAII; STATE OF ILLINOIS; STATE OF MASSACHUSETTS; STATE\n        OF MICHIGAN; STATE OF NEVADA; STATE OF NEW JERSEY; STATE OF\n        NEW MEXICO; STATE OF NEW YORK; STATE OF OREGON; STATE OF\n        RHODE ISLAND; STATE OF VERMONT; STATE OF WISCONSIN,\n\n                           Plaintiffs – Appellees,\n\n                     v.\n\n\n\n                                                     2\n\fUSCA4 Appeal: 25-1248    Doc: 42         Filed: 04/09/2025 Pg: 3 of 12\n             Case 1:25-cv-00748-JKB      Document 139 Filed 04/09/25       Page 3 of 12\n\n\n\n\n        UNITED STATES DEPARTMENT OF AGRICULTURE; BROOKE ROLLINS,\n        in her Official Capacity as Secretary of Agriculture; UNITED STATES\n        DEPARTMENT OF COMMERCE; HOWARD LUTNICK, in his Official\n        Capacity as Secretary of Commerce; UNITED STATES DEPARTMENT OF\n        DEFENSE; PETE HEGSETH, In his Official Capacity as Secretary of Defense;\n        UNITED STATES DEPARTMENT OF EDUCATION; LINDA MCMAHON, in\n        her Official Capacity as Secretary of Education; UNITED STATES\n        DEPARTMENT OF ENERGY; CHRISTOPHER A. WRIGHT, in his Official\n        Capacity as Secretary of Energy; UNITED STATES DEPARTMENT OF\n        HEALTH & HUMAN SERVICES; ROBERT F. KENNEDY, JR., in his Official\n        Capacity as Secretary of Health and Human Services; UNITED STATES\n        DEPARTMENT OF HOMELAND SECURITY; KRISTI NOEM, in her Official\n        Capacity as Secretary of Homeland Security; UNITED STATES DEPARTMENT\n        OF HOUSING & URBAN DEVELOPMENT; SCOTT TURNER, in his Official\n        Capacity as Secretary of Housing and Urban Development; UNITED STATES\n        DEPARTMENT OF THE INTERIOR; DOUGLAS BURGUM, in his Official\n        Capacity as Secretary of the Interior; UNITED STATES DEPARTMENT OF\n        LABOR; VINCENT N. MICONE, III, in his Official Capacity as Acting Secretary\n        of Labor; UNITED STATES DEPARTMENT OF TRANSPORTATION; SEAN\n        DUFFY, in his Official Capacity as Secretary of Transportation; UNITED STATES\n        DEPARTMENT OF THE TREASURY; SCOTT BESSENT, in his Official\n        Capacity as Secretary of the Treasury; UNITED STATES DEPARTMENT OF\n        VETERANS AFFAIRS; DOUGLAS COLLINS, in his Official Capacity as\n        Secretary of Veterans Affairs; CONSUMER FINANCIAL PROTECTION\n        BUREAU; RUSSELL VOUGHT, in his Official Capacity as Acting Director of the\n        Consumer Financial Protection Bureau; UNITED STATES ENVIRONMENTAL\n        PROTECTION AGENCY; LEE M. ZELDIN, in his Official Capacity as\n        Administrator of the Environmental Protection Agency; FEDERAL DEPOSIT\n        INSURANCE CORPORATION; TRAVIS HILL, in his Official Capacity as Acting\n        Chairman of the Federal Deposit Insurance Corporation; GENERAL SERVICES\n        ADMINISTRATION; STEPHEN EHIKIAN, in his Official Capacity as Acting\n        Administrator of the General Services Administration; NATIONAL ARCHIVES\n        AND RECORDS ADMINISTRATION; OFFICE OF PERSONNEL\n        MANAGEMENT; CHARLES EZELL, in his Official Capacity as Acting Director\n        of the Office of Personnel Management; SMALL BUSINESS\n        ADMINISTRATION; KELLY LOEFLER, in her Official Capacity as\n        Administrator of the Small Business Administration; UNITED STATES AGENCY\n        FOR INTERNATIONAL DEVELOPMENT; MARCO RUBIO, in his Official\n        Capacity as Acting Administrator of the United States Agency for International\n        Development and Archivist for the National Archives and Records Administration,\n\n                           Defendants – Appellants.\n                                                 3\n\fUSCA4 Appeal: 25-1248    Doc: 42          Filed: 04/09/2025 Pg: 4 of 12\n             Case 1:25-cv-00748-JKB       Document 139 Filed 04/09/25         Page 4 of 12\n\n\n\n\n                                                ORDER\n\n\n              Pending before the Court is the Government’s Motion for a Stay Pending Appeal.\n\n        Plaintiffs—nineteen States and the District of Columbia—sued forty-one Defendants,\n\n        which are federal executive departments and their secretaries as well as other federal\n\n        agencies and their heads (collectively, the Government).       Plaintiffs allege that the\n\n        Government violated federal law when it terminated thousands of probationary federal\n\n        employees without following the procedures required for a reduction in force, including\n\n        advance notice to the affected States. See 5 U.S.C. § 3502; 5 C.F.R. § 351.803(b). The\n\n        district court agreed with Plaintiffs and entered a preliminary injunction requiring the\n\n        Government to reinstate the probationary employees who reside or work in Plaintiff States\n\n        and refrain from further alleged reductions in force except in compliance with the notice\n\n        requirements of § 3502. Maryland v. USDA, --- F. Supp. 3d ---, 2025 WL 973159, at *40-\n\n        42 (D. Md. April 1, 2025).\n\n              The Government now asks us to stay the district court’s preliminary injunction.\n\n        Among other things, the Government argues that the States lack Article III standing to\n\n        challenge the terminations and that the district court lacked subject-matter jurisdiction\n\n        because the Civil Service Reform Act of 1978, Pub. L. No. 95-454, provides the exclusive\n\n        means for review of personnel actions taken against federal employees.\n\n              Having reviewed the record, the district court’s opinion, and the parties’ briefing,\n\n        we agree with the Government that it has satisfied the factors for a stay under Nken v.\n                                                   4\n\fUSCA4 Appeal: 25-1248    Doc: 42           Filed: 04/09/2025 Pg: 5 of 12\n             Case 1:25-cv-00748-JKB        Document 139 Filed 04/09/25           Page 5 of 12\n\n\n\n        Holder, 556 U.S. 418, 426 (2009). The Government is likely to succeed in showing the\n\n        district court lacked jurisdiction over Plaintiffs’ claims, and the Government is unlikely to\n\n        recover the funds disbursed to reinstated probationary employees. Cf. Dep’t of Educ. v.\n\n        California, No. 24A910, 2025 WL 1008354, at *1 (U.S. Apr. 4, 2025) (per curiam). The\n\n        Supreme Court has stayed a similar preliminary injunction issued by the United States\n\n        District Court for the Northern District of California. See OPM v. AFGE, No. 24A904,\n\n        2025 WL 1035208, at *1 (U.S. Apr. 8, 2025) (mem.). We therefore grant the Government’s\n\n        motion for a stay of the preliminary injunction pending this appeal. The Clerk will set an\n\n        expedited briefing schedule.\n\n               Entered at the direction of Judge Rushing, with the concurrence of Judge Wilkinson.\n\n        Judge Benjamin filed a separate dissenting opinion.\n\n                                                          For the Court\n\n                                                          /s/ Nwamaka Anowi, Clerk\n\n\n\n\n                                                     5\n\fUSCA4 Appeal: 25-1248    Doc: 42            Filed: 04/09/2025 Pg: 6 of 12\n             Case 1:25-cv-00748-JKB         Document 139 Filed 04/09/25           Page 6 of 12\n\n\n\n        DEANDREA GIST BENJAMIN, Circuit Judge, dissenting:\n\n               The majority votes to stay the preliminary injunction pending the resolution of the\n\n        appeal. The district court entered a well-reasoned memorandum opinion and order granting\n\n        a preliminary injunction, and then denied a motion for stay pending appeal. For the below\n\n        reasons and those explained in thorough detail by the district court, I would deny the\n\n        Government’s motion.\n\n\n\n                                                      I.\n\n                                                      A.\n\n               As a threshold matter, per the district court’s order, the States1 clearly have standing\n\n        to challenge the process by which the Government has engaged in mass firings.2 To\n\n        establish standing, “the plaintiff must have a ‘ “personal stake” ’ in the case.” TransUnion\n\n        LLC v. Ramirez, 594 U.S. 413, 423 (2021) (quoting Raines v. Byrd, 521 U.S. 811, 819\n\n        (1997)). To prove a personal stake, “plaintiffs must be able to sufficiently answer the\n\n        question: ‘ “What’s it to you?” ’ ” Id. (quoting Antonin Scalia, The Doctrine of Standing\n\n\n               1\n                Plaintiff States are a consortium of nineteen states (Maryland, Minnesota, Arizona,\n        California, Colorado, Connecticut, Delaware, Hawaii, Illinois, Massachusetts, Michigan,\n        Nevada, New Jersey, New Mexico, New York, Oregon, Rhode Island, Vermont,\n        Wisconsin) and the District of Columbia.\n               2\n                 This is an important distinction. The Government repeatedly mischaracterizes the\n        basis of the States’ claims, suggesting that the States are attempting to sue on behalf of\n        their respective citizens for alleged unlawful firings. This mischaracterization not only\n        misses the point but—more seriously—distracts from the States’ actual alleged harm. The\n        States were entitled to proper notice, which the Government did not give. That is the basis\n        for the instant suit.\n\n                                                      6\n\fUSCA4 Appeal: 25-1248    Doc: 42            Filed: 04/09/2025 Pg: 7 of 12\n             Case 1:25-cv-00748-JKB         Document 139 Filed 04/09/25           Page 7 of 12\n\n\n\n        as an Essential Element of the Separation of Powers, 17 Suffolk U. L. Rev. 881, 882\n\n        (1983)). A satisfactory answer to this question requires a plaintiff to show “(i) that he\n\n        suffered an injury in fact that is concrete, particularized, and actual or imminent; (ii) that\n\n        the injury was likely caused by the defendant; and (iii) that the injury would likely be\n\n        redressed by judicial relief.” Id. (citing Lujan v. Defenders of Wildlife, 504 U.S. 555, 560–\n\n        61 (1992)).\n\n               The Supreme Court has recognized that certain intangible injuries, including an\n\n        “informational injury,” can support standing. See, e.g., Fed. Election Comm’n v. Akins,\n\n        524 U.S. 11, 24–25 (1998); Pub. Citizen v. U.S. Dep’t of Justice, 491 U.S. 440, 449 (1989).\n\n        “A statutory violation alone,” however, “does not create a concrete informational injury\n\n        sufficient to support standing.” Dreher v. Experian Info. Sols., Inc., 856 F.3d 337, 345 (4th\n\n        Cir. 2017) (citing Spokeo, Inc. v. Robins, 578 U.S. 330, 341–42 (2016)). Instead, a\n\n        “constitutionally cognizable informational injury requires that a person lack access to\n\n        information to which he is legally entitled and that the denial of that information creates a\n\n        ‘real’ harm with an adverse effect.” Id. (quoting Spokeo, 578 U.S. at 339–40).\n\n               By this standard, the States’ informational injury cannot be a “dead end,” as the\n\n        Government claims. See Mot. for stay pending appeal at 1. First, pursuant to 5 U.S.C.\n\n        § 3502(d), the Government was legally required to inform the States at least 60 days before\n\n        any reduction in force (“RIF”). See also 5 C.F.R. § 351.803(b). The Government failed\n\n        to do so, thereby depriving the States of information to which they were legally entitled\n\n        and satisfying the first requirement of a constitutionally cognizable informational injury.\n\n        See Dreher, 856 F.3d at 345. Next, as discussed in depth by the district court, the denial\n                                                  7\n\fUSCA4 Appeal: 25-1248    Doc: 42           Filed: 04/09/2025 Pg: 8 of 12\n             Case 1:25-cv-00748-JKB        Document 139 Filed 04/09/25         Page 8 of 12\n\n\n\n        of this notice has, and will continue to, cause real harm with significant adverse effects.\n\n        See Mem. Op. on prelim. inj. (D. ECF No. 125) at 10–16.3 Such adverse effects include,\n\n        but are not limited to, an increase in unemployment benefits applications, an increase in\n\n        the resources required to investigate this influx in unemployment benefits applications,\n\n        additional financial and labor costs associated with the sudden strain placed on rapid\n\n        response programs without advance notice, unanticipated loss of tax revenue, and the loss\n\n        of support from federal employees who were working with various state agencies.4 See id.\n\n        These harms, among others, plainly satisfy the concreteness requirement and thus provide\n\n        the necessary grounds for Article III standing. See Dreher, 856 F.3d at 345.\n\n               Further, the district court correctly distinguished this case from United States v.\n\n        Texas, 599 U.S. 670 (2023). Asking the Government “to change its arrest or prosecution\n\n        policies so that the Executive Branch makes more arrests or initiates more prosecutions” is\n\n        a far cry from requiring the Government to adhere to a statutory notice requirement. See\n\n        id. at 677. The former “run[s] up against the Executive’s Article II authority to enforce\n\n\n\n               3\n                Page numbers for citations to ECF documents utilize the document’s native\n        numbering.\n               4\n                 The Government’s argument regarding the harms suffered by the States as a result\n        of the lack of statutory notice is concerning. See Mot. for stay pending appeal at 13\n        (arguing that allowing standing “based on downstream harms to state budgets and\n        operations from the termination of probationary employees” is “a recipe for any state to\n        micromanage the activities of the federal government” and “irreconcilable with Supreme\n        Court precedent”). Requiring the federal government to adhere to statutory notice\n        requirements as set forth by federal law can hardly be considered “micromanaging.” As\n        explained below, the Government had the opportunity to conduct the RIF according to\n        statutory procedure and chose not to do so.\n\n                                                    8\n\fUSCA4 Appeal: 25-1248    Doc: 42            Filed: 04/09/2025 Pg: 9 of 12\n             Case 1:25-cv-00748-JKB         Document 139 Filed 04/09/25           Page 9 of 12\n\n\n\n        federal law” and seeks to mandate something of the Government that was not already\n\n        required. Id. at 678. The latter merely asks the Government to comply with a required\n\n        procedure.\n\n               In the same vein, the relationship between the action (or inaction) by the\n\n        Government and the alleged harm is also distinct. In Texas, the states sought damages for\n\n        the costs associated with incarceration and social services based on the Government’s\n\n        failure to exercise its discretion—i.e., its discretionary inaction. Id. at 674, 684–85. Here,\n\n        the alleged harms, namely, the unexpected increased financial burden placed on rapid\n\n        response programs, are a result of the Government’s failure to adhere to statutory notice\n\n        requirements—i.e., its actions contrary to law. One is tangentially related to actions that\n\n        the Government was not required to take, while the other is directly related to an action\n\n        the Government was required to and failed to take. For these reasons, and those aptly\n\n        explained by the district court, Texas is inapplicable here.5\n\n\n\n\n               5\n                 On April 8, 2025, the Supreme Court stayed the preliminary injunction entered by\n        the United States District Court for the Northern District of California in its similar\n        probationary employee RIF case. See OPM v. AFGE, No. 24A904 (U.S. Apr. 8, 2025).\n        The Ninth Circuit had denied a motion to stay pending appeal. See Am. Fed’n of Gov’t\n        Emps., AFL-CIO v. United States Off. of Pers. Mgmt., No. 25-1677, 2025 WL 914823 (9th\n        Cir. Mar. 26, 2025). Like United States v. Texas, 599 U.S. 670 (2023), the decision in\n        AFGE is not applicable to the present case. The Supreme Court specifically noted “[t]he\n        District Court’s injunction was based solely on the allegations of the nine non-profit-\n        organization plaintiffs.” See AFGE, No. 24A904. The basis of standing is different here,\n        where States are suing under a statutory scheme relevant to states.\n\n                                                      9\n\fUSCA4 Appeal: 25-1248   Doc: 42            Filed: 04/09/2025 Pg: 10 of 12\n            Case 1:25-cv-00748-JKB         Document 139 Filed 04/09/25 Page 10 of 12\n\n\n\n               Accordingly, the States have successfully answered the question: “What’s it to\n\n        them?”    See TransUnion LLC, 594 U.S. at 423.           Standing based on the alleged\n\n        informational injury is thus appropriate here.\n\n                                                    B.\n\n               Nor does the Civil Service Reform Act of 1978 (“CSRA”), 5 U.S.C. §§ 7101–35,\n\n        defeat the district court’s jurisdiction. The CSRA “provides for the original and exclusive\n\n        administrative review of certain labor- and employment-related claims brought by federal\n\n        employees and/or their unions.” Mem. Op. on prelim. inj. at 32. The Government argues\n\n        the CSRA precludes the States’ claims because “at bottom, [they] rest on allegations that\n\n        the government unlawfully terminated probationary employees . . . and the states sought—\n\n        and the district court granted—reinstatement of affected employees.” Mot. for stay\n\n        pending appeal at 21–22.\n\n               The States do not dispute that they cannot receive relief under the CSRA—instead,\n\n        they have consistently argued that their harm arises from an independent “statutory right[]\n\n        to notice.” Mem. in support of motion for prelim. inj. (D. ECF No. 78-1) at 15. I, like the\n\n        district court, am not prepared to accept “the faulty premise that the States [are] simply\n\n        trying to vindicate the interests of the terminated workers (as opposed to their own and\n\n        separate harms as ‘state qua states’).” Mem. Op. on prelim. inj. at 33.\n\n               I also cannot ignore the Supreme Court’s analytical framework for assessing\n\n        whether a district court is divested of jurisdiction in favor of the Government’s preferred\n\n        framework. As ably set out by the district court, “pursuant to . . . Thunder Basin Coal Co.\n\n        v. Reich, 510 U.S. 200 (1994), there [is] no reason to believe Congress ha[s] divested the\n                                                    10\n\fUSCA4 Appeal: 25-1248   Doc: 42             Filed: 04/09/2025 Pg: 11 of 12\n            Case 1:25-cv-00748-JKB          Document 139 Filed 04/09/25 Page 11 of 12\n\n\n\n        district courts of jurisdiction over the States’ claims in this case.” Mem. Op. on prelim.\n\n        inj. at 31; see also id. at 31–33. The Government’s attempt to review the jurisdictional\n\n        question pursuant to Block v. Community Nutrition Institute, 467 U.S. 340 (1984) is\n\n        unavailing and “rel[ies] crucially on the idea that there is an identity of interests between\n\n        the States and the fired employees.” Id. at 37; see also id. at 35–37. “But,” as the district\n\n        court made clear, “that is not so.” Id. at 37.\n\n               For the above reasons, I do not believe the Government can defeat the States’\n\n        standing.\n\n\n\n                                                         II.\n\n               The Government also cannot satisfy the standard for a stay pending appeal. Those\n\n        factors are “(1) whether the stay applicant has made a strong showing that he is likely to\n\n        succeed on the merits; (2) whether the applicant will be irreparably injured absent a stay;\n\n        (3) whether issuance of the stay will substantially injure the other parties interested in the\n\n        proceeding; and (4) where the public interest lies.” Nken v. Holder, 556 U.S. 418, 434\n\n        (2009) (quoting Hilton v. Braunskill, 481 U.S. 770, 776 (1987)).\n\n               The Government must satisfy all four factors. But I do not believe it can satisfy\n\n        any. I write to highlight the Government’s lack of a convincing argument on irreparable\n\n        harm. See Nken, 556 U.S. at 434–35 (2009). The Government asserts that it cannot recover\n\n        salaries it is currently paying to reinstated probationary employees, and that the preliminary\n\n        injunction is a disruption to the CSRA process. See Mot. for stay pending appeal at 25–\n\n        27.\n                                                         11\n\fUSCA4 Appeal: 25-1248   Doc: 42            Filed: 04/09/2025 Pg: 12 of 12\n            Case 1:25-cv-00748-JKB         Document 139 Filed 04/09/25 Page 12 of 12\n\n\n\n               The Government’s monetary injury, if any, is “ ‘self-imposed.’ ” See Dep’t of Educ.\n\n        v. California, __ S. Ct. __, __, No. 24A910, 2025 WL 1008354, at *1 (quoting Cuomo v.\n\n        U.S. Nuclear Regul. Comm’n, 772 F.2d 972, 977 (D.C. Cir. 1985) (per curiam)). The\n\n        preliminary injunction order expressly states “[n]othing in this Order prohibits the\n\n        Government from conducting lawful terminations of probationary federal employees—\n\n        whether (1) pursuant to a proper RIF . . . or else (2) for cause . . . under the standards for\n\n        making such determinations set forth in the TRO Memorandum.” Prelim. Inj. order (D.\n\n        ECF No. 126) at 2 n.1. Additionally, if the Government had followed the statutory RIF\n\n        notice procedure, it would have had to pay probationary employees’ salaries for a statutory\n\n        period anyway. See 5 C.F.R. § 351.801. And, as explained earlier, the States are not\n\n        alleging a violation of the CSRA, nor are they attempting to step into the probationary\n\n        employees’ place for a CSRA challenge. See Mem. Op. on prelim. inj. at 33–37.\n\n\n\n                                                     III.\n\n               I see no reason to stay the district court’s preliminary injunction pending its appeal.\n\n        For the foregoing reasons, I respectfully dissent.\n\n\n\n\n                                                     12\n\f",
                    "ocr_status": 2,
                    "date_upload": "2025-04-13T06:25:11.486417-07:00",
                    "document_number": "139",
                    "attachment_number": null,
                    "pacer_doc_id": "093014793228",
                    "is_available": true,
                    "is_free_on_pacer": null,
                    "is_sealed": null,
                    "document_type": 1,
                    "description": "",
                    "acms_document_guid": ""
                }
            ],
            "date_created": "2025-04-13T06:24:08.369540-07:00",
            "date_modified": "2025-04-14T07:10:30.275667-07:00",
            "date_filed": "2025-04-09",
            "time_filed": null,
            "entry_number": 139,
            "recap_sequence_number": "2025-04-09.002",
            "pacer_sequence_number": 596,
            "description": "ORDER of USCA Granting the Governments motion for a stay of the preliminary injunction pending this appeal as to 46 Notice of Appeal, filed by United States Agency for International Development, United States Department of Housing and Urban Development, Charles Ezell, Howard Lutnick, United States Department of Treasury, Peter Hegseth, United States Department of Veterans Affairs, Federal Deposit Insurance Corporation, United States Department of Transportation, United States Department of Health & Human Services, Linda McMahon, Small Business Administration, Robert F. Kennedy, Jr., Consumer Financial Protection Bureau, Sean P Duffy, United States Department of Energy, Brooke Rollins, Scott Turner, Douglas A. Collins, Kelly Loefler, United States Department of Interior, Environmental Protection Agency, Scott Bessent, Douglas Burgum, Vincent Micone, Christopher Wright, Office of Personnel Management, General Services Administration, United States Department of Commerce, Lee Zeldin, Marco Rubio, United States Department of Homeland Security, National Archives and Records Administration, United States Department of Defense, Travis Hill, United States Department of Labor, United States Department of Agriculture, Kristi Noem, Stephen Ehikian, United States Department of Education, Russell Vought, 127 Notice of Interlocutory Appeal, filed by United States Agency for International Development, United States Department of Housing and Urban Development, Charles Ezell, Howard Lutnick, United States Department of Treasury, Peter Hegseth, United States Department of Veterans Affairs, Federal Deposit Insurance Corporation, United States Department of Transportation, United States Department of Health & Human Services, Linda McMahon, Small Business Administration, Robert F. Kennedy, Jr., Consumer Financial Protection Bureau, Sean P Duffy, United States Department of Energy, Brooke Rollins, Scott Turner, Douglas A. Collins, Kelly Loefler, Environmental Protection Agency, United States Department of Interior, Scott Bessent, Vincent Micone, Douglas Burgum, Christopher Wright, Office of Personnel Management, General Services Administration, United States Department of Commerce, Lee Zeldin, Marco Rubio, United States Department of Homeland Security, National Archives and Records Administration, United States Department of Defense, Travis Hill, United States Department of Labor, United States Department of Agriculture, Kristi Noem, Stephen Ehikian, United States Department of Education, Russell Vought. (slss, Deputy Clerk) (Entered: 04/11/2025)",
            "tags": []
        },
        {
            "resource_uri": "https://www.courtlistener.com/api/rest/v4/docket-entries/422211990/",
            "id": 422211990,
            "docket": "https://www.courtlistener.com/api/rest/v4/dockets/69714275/",
            "recap_documents": [
                {
                    "resource_uri": "https://www.courtlistener.com/api/rest/v4/recap-documents/436235082/",
                    "id": 436235082,
                    "tags": [],
                    "absolute_url": "/docket/69714275/140/state-of-maryland-v-united-states-department-of-agriculture/",
                    "date_created": "2025-04-12T17:39:58.987161-07:00",
                    "date_modified": "2025-04-17T16:18:53.990806-07:00",
                    "sha1": "deeb0921bad61db0bcc5854f8ca6f203001f320b",
                    "page_count": 4,
                    "file_size": 92864,
                    "filepath_local": "recap/gov.uscourts.mdd.578045/gov.uscourts.mdd.578045.140.0.pdf",
                    "filepath_ia": "https://archive.org/download/gov.uscourts.mdd.578045/gov.uscourts.mdd.578045.140.0.pdf",
                    "ia_upload_failure_count": null,
                    "thumbnail": "recap-thumbnails/gov.uscourts.mdd.578045/436235082.thumb.1068.png",
                    "thumbnail_status": 1,
                    "plain_text": "USCA4 Appeal: 25-1248    Doc: 48       Filed: 04/10/2025 Pg: 1 of 4\n              Case 1:25-cv-00748-JKB    Document 140 Filed 04/10/25   Page 1 of 4\n\n\n\n\n                                                                FILED: April 10, 2025\n\n\n                          UNITED STATES COURT OF APPEALS\n                              FOR THE FOURTH CIRCUIT\n\n\n                                    ___________________\n\n                                        No. 25-1248 (L)\n                                     (1:25-cv-00748-JKB)\n                                    ___________________\n\n        STATE OF MARYLAND; STATE OF MINNESOTA; DISTRICT OF\n        COLUMBIA; STATE OF ARIZONA; STATE OF CALIFORNIA; STATE OF\n        COLORADO; STATE OF CONNECTICUT; STATE OF DELAWARE; STATE\n        OF HAWAII; STATE OF ILLINOIS; STATE OF MASSACHUSETTS; STATE\n        OF MICHIGAN; STATE OF NEVADA; STATE OF NEW JERSEY; STATE OF\n        NEW MEXICO; STATE OF NEW YORK; STATE OF OREGON; STATE OF\n        RHODE ISLAND; STATE OF VERMONT; STATE OF WISCONSIN\n\n                    Plaintiffs - Appellees\n\n        v.\n\n        UNITED STATES DEPARTMENT OF AGRICULTURE; BROOKE ROLLINS,\n        in her Official Capacity as Secretary of Agriculture; UNITED STATES\n        DEPARTMENT OF COMMERCE; HOWARD LUTNICK, in his Official\n        Capacity as Secretary of Commerce; UNITED STATES DEPARTMENT OF\n        DEFENSE; PETER HEGSETH, In his Official Capacity as Secretary of Defense;\n        UNITED STATES DEPARTMENT OF EDUCATION; LINDA MCMAHON, in\n        her Official Capacity as Secretary of Education; UNITED STATES\n        DEPARTMENT OF ENERGY; CHRISTOPHER WRIGHT, in his Official\n        Capacity as Secretary of Energy; UNITED STATES DEPARTMENT OF\n        HEALTH & HUMAN SERVICES; ROBERT F. KENNEDY, JR., in his Official\n        Capacity as Secretary of Health and Human Services; UNITED STATES\n        DEPARTMENT OF HOMELAND SECURITY; KRISTI NOEM, in her Official\n        Capacity as Secretary of Homeland Security; UNITED STATES DEPARTMENT\n        OF HOUSING & URBAN DEVELOPMENT; SCOTT TURNER, in his Official\n\fUSCA4 Appeal: 25-1248    Doc: 48       Filed: 04/10/2025 Pg: 2 of 4\n              Case 1:25-cv-00748-JKB    Document 140 Filed 04/10/25     Page 2 of 4\n\n        Capacity as Secretary of Housing and Urban Development; UNITED STATES\n        DEPARTMENT OF THE INTERIOR; DOUGLAS BURGUM, in his Official\n        Capacity as Secretary of the Interior; UNITED STATES DEPARTMENT OF\n        LABOR; VINCENT MICONE, in his Official Capacity as Acting Secretary of\n        Labor; UNITED STATES DEPARTMENT OF TRANSPORTATION; SEAN P.\n        DUFFY, in his Official Capacity as Secretary of Transportation; UNITED\n        STATES DEPARTMENT OF THE TREASURY; SCOTT BESSENT, in his\n        Official Capacity as Secretary of the Treasury; UNITED STATES\n        DEPARTMENT OF VETERANS AFFAIRS; DOUGLAS A. COLLINS, in his\n        Official Capacity as Secretary of Veterans Affairs; CONSUMER FINANCIAL\n        PROTECTION BUREAU; RUSSELL VOUGHT, in his Official Capacity as\n        Acting Director of the Consumer Financial Protection Bureau; UNITED STATES\n        ENVIRONMENTAL PROTECTION AGENCY; LEE ZELDIN, in his Official\n        Capacity as Administrator of the Environmental Protection Agency; FEDERAL\n        DEPOSIT INSURANCE CORPORATION; TRAVIS HILL, in his Official\n        Capacity as Acting Chairman of the Federal Deposit Insurance Corporation;\n        GENERAL SERVICES ADMINISTRATION; STEPHEN EHIKIAN, in his\n        Official Capacity as Acting Administrator of the General Services Administration;\n        NATIONAL ARCHIVES AND RECORDS ADMINISTRATION; OFFICE OF\n        PERSONNEL MANAGEMENT; CHARLES EZELL, in his Official Capacity as\n        Acting Director of the Office of Personnel Management; SMALL BUSINESS\n        ADMINISTRATION; KELLY LOEFLER, in her Official Capacity as\n        Administrator of the Small Business Administration; UNITED STATES\n        AGENCY FOR INTERNATIONAL DEVELOPMENT; MARCO RUBIO, in his\n        Official Capacity as Acting Administrator of the United States Agency for\n        International Development and Archivist for the National Archives and Records\n        Administration\n\n                    Defendants - Appellants\n\n                                    ___________________\n\n                                         No. 25-1338\n                                     (1:25-cv-00748-JKB)\n                                    ___________________\n\n        STATE OF MARYLAND; STATE OF MINNESOTA; DISTRICT OF\n        COLUMBIA; STATE OF ARIZONA; STATE OF CALIFORNIA; STATE OF\n        COLORADO; STATE OF CONNECTICUT; STATE OF DELAWARE; STATE\n        OF HAWAII; STATE OF ILLINOIS; STATE OF MASSACHUSETTS; STATE\n        OF MICHIGAN; STATE OF NEVADA; STATE OF NEW JERSEY; STATE OF\n\fUSCA4 Appeal: 25-1248    Doc: 48       Filed: 04/10/2025 Pg: 3 of 4\n              Case 1:25-cv-00748-JKB    Document 140 Filed 04/10/25   Page 3 of 4\n\n        NEW MEXICO; STATE OF NEW YORK; STATE OF OREGON; STATE OF\n        RHODE ISLAND; STATE OF VERMONT; STATE OF WISCONSIN\n\n                    Plaintiffs - Appellees\n\n        v.\n\n        UNITED STATES DEPARTMENT OF AGRICULTURE; BROOKE ROLLINS,\n        in her Official Capacity as Secretary of Agriculture; UNITED STATES\n        DEPARTMENT OF COMMERCE; HOWARD LUTNICK, in his Official\n        Capacity as Secretary of Commerce; UNITED STATES DEPARTMENT OF\n        DEFENSE; PETE HEGSETH, In his Official Capacity as Secretary of Defense;\n        UNITED STATES DEPARTMENT OF EDUCATION; LINDA MCMAHON, in\n        her Official Capacity as Secretary of Education; UNITED STATES\n        DEPARTMENT OF ENERGY; CHRISTOPHER A. WRIGHT, in his Official\n        Capacity as Secretary of Energy; UNITED STATES DEPARTMENT OF\n        HEALTH & HUMAN SERVICES; ROBERT F. KENNEDY, JR., in his Official\n        Capacity as Secretary of Health and Human Services; UNITED STATES\n        DEPARTMENT OF HOMELAND SECURITY; KRISTI NOEM, in her Official\n        Capacity as Secretary of Homeland Security; UNITED STATES DEPARTMENT\n        OF HOUSING & URBAN DEVELOPMENT; SCOTT TURNER, in his Official\n        Capacity as Secretary of Housing and Urban Development; UNITED STATES\n        DEPARTMENT OF THE INTERIOR; DOUGLAS BURGUM, in his Official\n        Capacity as Secretary of the Interior; UNITED STATES DEPARTMENT OF\n        LABOR; VINCENT N. MICONE, III, in his Official Capacity as Acting\n        Secretary of Labor; UNITED STATES DEPARTMENT OF\n        TRANSPORTATION; SEAN DUFFY, in his Official Capacity as Secretary of\n        Transportation; UNITED STATES DEPARTMENT OF THE TREASURY;\n        SCOTT BESSENT, in his Official Capacity as Secretary of the Treasury;\n        UNITED STATES DEPARTMENT OF VETERANS AFFAIRS; DOUGLAS\n        COLLINS, in his Official Capacity as Secretary of Veterans Affairs;\n        CONSUMER FINANCIAL PROTECTION BUREAU; RUSSELL VOUGHT, in\n        his Official Capacity as Acting Director of the Consumer Financial Protection\n        Bureau; UNITED STATES ENVIRONMENTAL PROTECTION AGENCY;\n        LEE M. ZELDIN, in his Official Capacity as Administrator of the Environmental\n        Protection Agency; FEDERAL DEPOSIT INSURANCE CORPORATION;\n        TRAVIS HILL, in his Official Capacity as Acting Chairman of the Federal\n        Deposit Insurance Corporation; GENERAL SERVICES ADMINISTRATION;\n        STEPHEN EHIKIAN, in his Official Capacity as Acting Administrator of the\n        General Services Administration; NATIONAL ARCHIVES AND RECORDS\n        ADMINISTRATION; OFFICE OF PERSONNEL MANAGEMENT; CHARLES\n\fUSCA4 Appeal: 25-1248    Doc: 48        Filed: 04/10/2025 Pg: 4 of 4\n              Case 1:25-cv-00748-JKB     Document 140 Filed 04/10/25      Page 4 of 4\n\n        EZELL, in his Official Capacity as Acting Director of the Office of Personnel\n        Management; SMALL BUSINESS ADMINISTRATION; KELLY LOEFLER, in\n        her Official Capacity as Administrator of the Small Business Administration;\n        UNITED STATES AGENCY FOR INTERNATIONAL DEVELOPMENT;\n        MARCO RUBIO, in his Official Capacity as Acting Administrator of the United\n        States Agency for International Development and Archivist for the National\n        Archives and Records Administration\n\n                     Defendants - Appellants\n\n                                      ___________________\n\n                                           ORDER\n                                      ___________________\n\n              Upon consideration of the submissions relative to appellee’s motion for an\n\n        administrative stay, the court denies the motion.\n\n              Entered at the direction of Judge Rushing with the concurrence of Judge\n\n        Wilkinson. Judge Benjamin dissents from the Court ‘s order.\n\n                                               For the Court\n\n                                               /s/ Nwamaka Anowi, Clerk\n\f",
                    "ocr_status": 2,
                    "date_upload": "2025-04-12T20:31:35.215423-07:00",
                    "document_number": "140",
                    "attachment_number": null,
                    "pacer_doc_id": "093014793983",
                    "is_available": true,
                    "is_free_on_pacer": null,
                    "is_sealed": false,
                    "document_type": 1,
                    "description": "",
                    "acms_document_guid": ""
                }
            ],
            "date_created": "2025-04-12T17:39:58.933428-07:00",
            "date_modified": "2025-04-17T16:18:53.978158-07:00",
            "date_filed": "2025-04-10",
            "time_filed": null,
            "entry_number": 140,
            "recap_sequence_number": "2025-04-10.001",
            "pacer_sequence_number": 600,
            "description": "ORDER of USCA Denying the motion for and Administrative Stay as to 46 Notice of Appeal, filed by United States Agency for International Development, United States Department of Housing and Urban Development, Charles Ezell, Howard Lutnick, United States Department of Treasury, Peter Hegseth, United States Department of Veterans Affairs, Federal Deposit Insurance Corporation, United States Department of Transportation, United States Department of Health & Human Services, Linda McMahon, Small Business Administration, Robert F. Kennedy, Jr., Consumer Financial Protection Bureau, Sean P Duffy, United States Department of Energy, Brooke Rollins, Scott Turner, Douglas A. Collins, Kelly Loefler, United States Department of Interior, Environmental Protection Agency, Scott Bessent, Douglas Burgum, Vincent Micone, Christopher Wright, Office of Personnel Management, General Services Administration, United States Department of Commerce, Lee Zeldin, Marco Rubio, United States Department of Homeland Security, National Archives and Records Administration, United States Department of Defense, Travis Hill, United States Department of Labor, United States Department of Agriculture, Kristi Noem, Stephen Ehikian, United States Department of Education, Russell Vought, 127 Notice of Interlocutory Appeal, filed by United States Agency for International Development, United States Department of Housing and Urban Development, Charles Ezell, Howard Lutnick, United States Department of Treasury, Peter Hegseth, United States Department of Veterans Affairs, Federal Deposit Insurance Corporation, United States Department of Transportation, United States Department of Health & Human Services, Linda McMahon, Small Business Administration, Robert F. Kennedy, Jr., Consumer Financial Protection Bureau, Sean P Duffy, United States Department of Energy, Brooke Rollins, Scott Turner, Douglas A. Collins, Kelly Loefler, Environmental Protection Agency, United States Department of Interior, Scott Bessent, Vincent Micone, Douglas Burgum, Christopher Wright, Office of Personnel Management, General Services Administration, United States Department of Commerce, Lee Zeldin, Marco Rubio, United States Department of Homeland Security, National Archives and Records Administration, United States Department of Defense, Travis Hill, United States Department of Labor, United States Department of Agriculture, Kristi Noem, Stephen Ehikian, United States Department of Education, Russell Vought. (slss, Deputy Clerk) (Entered: 04/11/2025)",
            "tags": []
        },
        {
            "resource_uri": "https://www.courtlistener.com/api/rest/v4/docket-entries/421852743/",
            "id": 421852743,
            "docket": "https://www.courtlistener.com/api/rest/v4/dockets/69714275/",
            "recap_documents": [
                {
                    "resource_uri": "https://www.courtlistener.com/api/rest/v4/recap-documents/435865132/",
                    "id": 435865132,
                    "tags": [],
                    "absolute_url": "/docket/69714275/138/state-of-maryland-v-united-states-department-of-agriculture/",
                    "date_created": "2025-04-09T11:03:22.555892-07:00",
                    "date_modified": "2025-04-14T07:10:30.261232-07:00",
                    "sha1": "a5fef000609f09f565b1d5f33702a580f7a9019e",
                    "page_count": 1,
                    "file_size": 95910,
                    "filepath_local": "recap/gov.uscourts.mdd.578045/gov.uscourts.mdd.578045.138.0.pdf",
                    "filepath_ia": "https://archive.org/download/gov.uscourts.mdd.578045/gov.uscourts.mdd.578045.138.0.pdf",
                    "ia_upload_failure_count": null,
                    "thumbnail": "recap-thumbnails/gov.uscourts.mdd.578045/435865132.thumb.1068.png",
                    "thumbnail_status": 1,
                    "plain_text": "USCA4 Appeal: 23-1431    Doc: 63        Filed: 04/09/2025 Pg: 1 of 1\n              Case 1:25-cv-00748-JKB     Document 138 Filed 04/09/25      Page 1 of 1\n\n\n\n                                                                     FILED: April 9, 2025\n\n\n                           UNITED STATES COURT OF APPEALS\n                               FOR THE FOURTH CIRCUIT\n\n                                      ___________________\n\n                                           No. 23-1431\n                                       (1:22-cv-00549-JRR)\n                                      ___________________\n\n        DEMETRIC SIMON\n\n                     Plaintiff - Appellant\n\n        v.\n\n        KEITH GLADSTONE; ROBERT HANKARD; WAYNE JENKINS;\n        BALTIMORE CITY POLICE DEPARTMENT; CARMINE VIGNOLA;\n        BENJAMIN L. FRIEMAN; RYAN GUINN; DEAN PALMERE SEAN MILLER\n\n                     Defendants - Appellees\n\n                                      ___________________\n\n                                         MANDATE\n                                      ___________________\n\n              The judgment of this court, entered March 06, 2025, takes effect today.\n\n              This constitutes the formal mandate of this court issued pursuant to Rule\n\n        41(a) of the Federal Rules of Appellate Procedure.\n\n\n                                                                 /s/Nwamaka Anowi, Clerk\n\f",
                    "ocr_status": 2,
                    "date_upload": "2025-04-09T11:05:42.604420-07:00",
                    "document_number": "138",
                    "attachment_number": null,
                    "pacer_doc_id": "093014786164",
                    "is_available": true,
                    "is_free_on_pacer": null,
                    "is_sealed": null,
                    "document_type": 1,
                    "description": "",
                    "acms_document_guid": ""
                }
            ],
            "date_created": "2025-04-09T11:03:22.533136-07:00",
            "date_modified": "2025-04-14T07:10:30.250196-07:00",
            "date_filed": "2025-04-09",
            "time_filed": null,
            "entry_number": 138,
            "recap_sequence_number": "2025-04-09.001",
            "pacer_sequence_number": 592,
            "description": "(ELECTRONICALLY FILED IN ERROR)ORDER of USCA Granting the Governments motion for a stay of the preliminary injunction pending this appeal as to 46 Notice of Appeal, filed by United States Agency for International Development, United States Department of Housing and Urban Development, Charles Ezell, Howard Lutnick, United States Department of Treasury, Peter Hegseth, United States Department of Veterans Affairs, Federal Deposit Insurance Corporation, United States Department of Transportation, United States Department of Health & Human Services, Linda McMahon, Small Business Administration, Robert F. Kennedy, Jr., Consumer Financial Protection Bureau, Sean P Duffy, United States Department of Energy, Brooke Rollins, Scott Turner, Douglas A. Collins, Kelly Loefler, United States Department of Interior, Environmental Protection Agency, Scott Bessent, Douglas Burgum, Vincent Micone, Christopher Wright, Office of Personnel Management, General Services Administration, United States Department of Commerce, Lee Zeldin, Marco Rubio, United States Department of Homeland Security, National Archives and Records Administration, United States Department of Defense, Travis Hill, United States Department of Labor, United States Department of Agriculture, Kristi Noem, Stephen Ehikian, United States Department of Education, Russell Vought, 127 Notice of Interlocutory Appeal, filed by United States Agency for International Development, United States Department of Housing and Urban Development, Charles Ezell, Howard Lutnick, United States Department of Treasury, Peter Hegseth, United States Department of Veterans Affairs, Federal Deposit Insurance Corporation, United States Department of Transportation, United States Department of Health & Human Services, Linda McMahon, Small Business Administration, Robert F. Kennedy, Jr., Consumer Financial Protection Bureau, Sean P Duffy, United States Department of Energy, Brooke Rollins, Scott Turner, Douglas A. Collins, Kelly Loefler, Environmental Protection Agency, United States Department of Interior, Scott Bessent, Vincent Micone, Douglas Burgum, Christopher Wright, Office of Personnel Management, General Services Administration, United States Department of Commerce, Lee Zeldin, Marco Rubio, United States Department of Homeland Security, National Archives and Records Administration, United States Department of Defense, Travis Hill, United States Department of Labor, United States Department of Agriculture, Kristi Noem, Stephen Ehikian, United States Department of Education, Russell Vought. (slss, Deputy Clerk) Modified on 4/11/2025 (slss). (Entered: 04/09/2025)",
            "tags": []
        },
        {
            "resource_uri": "https://www.courtlistener.com/api/rest/v4/docket-entries/421791366/",
            "id": 421791366,
            "docket": "https://www.courtlistener.com/api/rest/v4/dockets/69714275/",
            "recap_documents": [
                {
                    "resource_uri": "https://www.courtlistener.com/api/rest/v4/recap-documents/435801444/",
                    "id": 435801444,
                    "tags": [],
                    "absolute_url": "/docket/69714275/137/state-of-maryland-v-united-states-department-of-agriculture/",
                    "date_created": "2025-04-08T18:14:19.682892-07:00",
                    "date_modified": "2025-04-14T07:10:30.233302-07:00",
                    "sha1": "549e9638df93c3ab626ea50cb55fdf3673d7dbcc",
                    "page_count": 3,
                    "file_size": 110175,
                    "filepath_local": "recap/gov.uscourts.mdd.578045/gov.uscourts.mdd.578045.137.0.pdf",
                    "filepath_ia": "https://archive.org/download/gov.uscourts.mdd.578045/gov.uscourts.mdd.578045.137.0.pdf",
                    "ia_upload_failure_count": null,
                    "thumbnail": "recap-thumbnails/gov.uscourts.mdd.578045/435801444.thumb.1068.png",
                    "thumbnail_status": 1,
                    "plain_text": "       Case 1:25-cv-00748-JKB          Document 137        Filed 04/08/25      Page 1 of 3\n\n\n\n                       IN THE UNITED STATES DISTRICT COURT\n                          FOR THE DISTRICT OF MARYLAND\n\n\n STATE OF MARYLAND, et al.,\n\n  Plaintiffs,                                         Case No. 1:25-cv-00748-JKB\n\n         v.\n\n UNITED STATES DEPARTMENT OF\n AGRICULTURE, et al.,\n\n  Defendants.\n\n\n                             NOTICE OF ERATTA RE\n                ENJOINED DEFENDANTS’ COMPLIANCE STATUS REPORT\n\n       Defendants respectfully submit this Notice of Eratta to correct a declaration attached to\n\nEnjoined Defendants’ Compliance Status Report (Dkt Nos. 136), filed on April 8, 2025, shortly\n\nbefore the Court’s 2 pm EDT deadline. See Dkt Nos. 126, ¶ 4. Specifically, the Declaration of\n\nJessica Parton, on behalf of the Office of Personnel Management (OPM) (see Dkt. No. 136-1, pp.\n\n27-29), incorrectly states that OPM had 47 Affected Probationary Employees (and had reinstated\n\nall 47 of those individuals). See id. at ¶¶ 3, 6, 8. The declaration should have stated that OPM had\n\n46 Affected Probationary Employees (and had reinstated all 46 of these individuals). Accordingly,\n\nDefendants respectfully request that the Court replace the Declaration of Jessica Parton (Dkt. No.\n\n136-1, pp. 27-29), with the attached Corrected Declaration of Jessica M. Parton, which makes the\n\nconforming corrections. See attached at ¶¶ 3, 6, 8.\n\nApril 8, 2025                                 Respectfully submitted,\n\n                                              YAAKOV ROTH\n                                              Acting Assistant Attorney General\n                                              Civil Division\n\n                                              ERIC J. HAMILTON\n                                              Deputy Assistant Attorney General\n\n                                                 1\n\fCase 1:25-cv-00748-JKB   Document 137    Filed 04/08/25    Page 2 of 3\n\n\n\n\n                             DIANE KELLEHER\n                             Branch Director\n\n                             CHRISTOPHER HALL\n                             Assistant Director\n\n                             /s/ Steven M. Chasin\n                             Steven M. Chasin\n                             Trial Attorney\n                             U.S. Department of Justice\n                             Civil Division, Federal Programs Branch\n                             1100 L Street, N.W.\n                             Washington, D.C. 20005\n                             Tel.: (202) 305-0747\n                             Email: Steven.M.Chasin2@usdoj.gov\n\n                             KELLY O. HAYES\n                             United States Attorney\n\n                             Beatrice C. Thomas\n                             Assistant United States Attorney\n                             United States Attorney’s Office\n                             36 S. Charles Street, 4th Floor\n                             Baltimore, MD 21202\n                             Email: beatrice.thomas@usdoj.gov\n\n                             Attorneys for Defendants\n\n\n\n\n                                2\n\f       Case 1:25-cv-00748-JKB           Document 137         Filed 04/08/25      Page 3 of 3\n\n\n\n                                 CERTIFICATE OF SERVICE\n\nI certify that on this 8th day of April 2025, I electronically filed the foregoing with the Clerk of\nthe Court using the CM/ECF System, which will send notice of such filing to all counsel.\n\n/s/ Steven M. Chasin\n\nSteven M. Chasin\n\n\n\n\n                                                  3\n\f",
                    "ocr_status": 2,
                    "date_upload": "2025-04-08T18:14:50.225946-07:00",
                    "document_number": "137",
                    "attachment_number": null,
                    "pacer_doc_id": "093014784311",
                    "is_available": true,
                    "is_free_on_pacer": null,
                    "is_sealed": null,
                    "document_type": 1,
                    "description": "",
                    "acms_document_guid": ""
                },
                {
                    "resource_uri": "https://www.courtlistener.com/api/rest/v4/recap-documents/435801446/",
                    "id": 435801446,
                    "tags": [],
                    "absolute_url": "/docket/69714275/137/1/state-of-maryland-v-united-states-department-of-agriculture/",
                    "date_created": "2025-04-08T18:14:40.409691-07:00",
                    "date_modified": "2025-04-09T02:50:56.986320-07:00",
                    "sha1": "19698154aa78df4236ff4a47b1f35b802a78a725",
                    "page_count": 3,
                    "file_size": 133285,
                    "filepath_local": "recap/gov.uscourts.mdd.578045/gov.uscourts.mdd.578045.137.1.pdf",
                    "filepath_ia": "https://archive.org/download/gov.uscourts.mdd.578045/gov.uscourts.mdd.578045.137.1.pdf",
                    "ia_upload_failure_count": null,
                    "thumbnail": "recap-thumbnails/gov.uscourts.mdd.578045/435801446.thumb.1068.png",
                    "thumbnail_status": 1,
                    "plain_text": "       Case 1:25-cv-00748-JKB            Document 137-1        Filed 04/08/25       Page 1 of 3\n\n\n\n                          IN THE UNITED STATES DISTRICT COURT\n                             FOR THE DISTRICT OF MARYLAND\n\n\n Maryland, et al.,\n\n                                                        Case No. 1:25-cv-00748-JKB\n            Plaintiffs,\n\n            v.\n\n United States Department of Agriculture,\n\n et al.,\n\n            Defendants.\n\n\n                    CORRECTED DECLARATION OF JESSICA M. PARTON\n\n           Pursuant to 28 U.S.C. § 1746, I, Jessica M. Parton declare as follows:\n\n\n           1.      I am the Supervisory Human Resources Specialist headquartered in Washington,\n\nDC. I make this declaration based on my own personal knowledge, on information contained in\n\nthe records of the U.S. Office of Personnel Management (OPM), or on information provided to me\n\nby OPM employees.\n\n           2.      I have served in this position since June 10, 2018. In my role at OPM, I am\n\nresponsible for personnel management. I have the responsibility for overseeing the personnel\n\nenterprise and tracking and recording of personnel actions, including terminations. I assist in\n\nensuring that all personnel actions comply with federal law, including those related to probationary\n\nemployees.\n\n           3.      As of Tuesday, April 8, 2025, OPM had forty-six (46) Affected Probationary\n\nEmployees, as defined in paragraph 8(b) of the Preliminary Injunction Order. As of that date,\n\nOPM had reinstated forty-six (46) Affected Probationary Employees.\n\f      Case 1:25-cv-00748-JKB          Document 137-1       Filed 04/08/25      Page 2 of 3\n\n\n\n       4.      As of Tuesday, April 8, 2025, OPM communicated Affected Probationary\n\nEmployees’ reinstatement status to each by personal email. One (1) of the emails was returned as\n\nundeliverable, and we are contacting the employee to obtain a valid email address.\n\n       5.      OPM has cancelled all termination personnel actions for all Affected Probationary\n\nEmployees, and all have been placed on paid administrative leave. All Affected Probationary\n\nEmployees have been restored without physical and system (IT) access. We are coordinating\n\nclosely with the payroll office to reconcile Affected Probationary Employees’ annual leave and\n\nintend to offset previously made annual leave payouts with the administrative leave pay to prevent\n\nor limit indebtedness. Leave will be recredited to Affected Probationary Employees’ accounts. All\n\nAffected Probationary Employees have been reinstated to the benefits they were enrolled in prior\n\nto termination, ensuring no break in service. No action is required on the part of Affected\n\nProbationary Employees with respect to benefits. It may take the carriers a few weeks to\n\nappropriately update their systems.\n\n       6.      Forty-six (46) termination personnel actions have been cancelled.\n\n       7.      To date, no Affected Probationary Employee has informed us that they decline\n\nreinstatement. If an Affected Probationary Employee does inform us of a desire to decline\n\nreinstatement on the basis that they now have outside employment that could conflict with Federal\n\nemployment under applicable ethics rules, we will consult with our Office of the General Counsel\n\nto present the Affected Probationary Employee with available options.\n\n       8.      Two of the forty-six (46) Affected Probationary Employees were reinstated to\n\noffices that were subject to a Reduction in Force (RIF). Because the Affected Probationary\n\nEmployees were in the RIF competitive areas and would have been released in the RIFs, we\n\nreinstated those employees and will be issuing them the required RIF notices. They will remain in\n\n\n\n                                                    2\n\f      Case 1:25-cv-00748-JKB         Document 137-1        Filed 04/08/25      Page 3 of 3\n\n\n\na paid administrative leave status pending release at the end of the notice period. Neither of the\n\nRIFs at issue involves competitive areas of fifty (50) or more employees, thus the 5 C.F.R.\n\n351.803(b) notice requirement with respect to states does not apply.\n\n       9.      The Deferred Resignation Program (DRP) has reopened for all employees at OPM\n\nthrough April 14, 2025. With the exception of the two employees described in paragraph eight (8),\n\nwe have offered all Affected Probationary Employees the opportunity to opt into the DRP program\n\nif they so choose.\n\nPursuant to 28 U.S.C. § 1746, I declare under penalty of perjury that the foregoing is true and\ncorrect.\n                                                            Dated: April 8, 2025\n\n\n                                                            /s/ Jessica M. Parton\n                                                            JESSICA MARIE PARTON\n                                                            SUPERVISORY HR SPECIALIST\n\n\n\n\n                                                    3\n\f",
                    "ocr_status": 2,
                    "date_upload": "2025-04-08T18:14:50.715119-07:00",
                    "document_number": "137",
                    "attachment_number": 1,
                    "pacer_doc_id": "093014784312",
                    "is_available": true,
                    "is_free_on_pacer": null,
                    "is_sealed": null,
                    "document_type": 2,
                    "description": "Errata Corrected Declaration of Jessica M. Parton",
                    "acms_document_guid": ""
                }
            ],
            "date_created": "2025-04-08T18:14:19.498552-07:00",
            "date_modified": "2025-04-14T07:10:30.223172-07:00",
            "date_filed": "2025-04-08",
            "time_filed": null,
            "entry_number": 137,
            "recap_sequence_number": "2025-04-08.002",
            "pacer_sequence_number": 589,
            "description": "NOTICE by Scott Bessent, Douglas Burgum, Douglas A. Collins, Consumer Financial Protection Bureau, Sean P Duffy, Stephen Ehikian, Environmental Protection Agency, Charles Ezell, Federal Deposit Insurance Corporation, General Services Administration, Peter Hegseth, Travis Hill, Robert F. Kennedy, Jr, Kelly Loefler, Howard Lutnick, Linda McMahon, Vincent Micone, National Archives and Records Administration, Kristi Noem, Office of Personnel Management, Brooke Rollins, Marco Rubio, Marco Rubio, Small Business Administration, Scott Turner, United States Agency for International Development, United States Department of Agriculture, United States Department of Commerce, United States Department of Defense, United States Department of Education, United States Department of Energy, United States Department of Health & Human Services, United States Department of Homeland Security, United States Department of Housing and Urban Development, United States Department of Interior, United States Department of Labor, United States Department of Transportation, United States Department of Treasury, United States Department of Veterans Affairs, Russell Vought, Christopher Wright, Lee Zeldin re 136 Status Report,,,,, of Eratta re Enjoined Defendants' Compliance Status Report (Attachments: # 1 Errata Corrected Declaration of Jessica M. Parton)(Chasin, Steven) (Entered: 04/08/2025)",
            "tags": []
        },
        {
            "resource_uri": "https://www.courtlistener.com/api/rest/v4/docket-entries/421739475/",
            "id": 421739475,
            "docket": "https://www.courtlistener.com/api/rest/v4/dockets/69714275/",
            "recap_documents": [
                {
                    "resource_uri": "https://www.courtlistener.com/api/rest/v4/recap-documents/435748521/",
                    "id": 435748521,
                    "tags": [],
                    "absolute_url": "/docket/69714275/136/state-of-maryland-v-united-states-department-of-agriculture/",
                    "date_created": "2025-04-08T11:45:30.980061-07:00",
                    "date_modified": "2025-04-14T07:10:30.205192-07:00",
                    "sha1": "dca03efc0e9d0bf4a1aaff062d431795f824b126",
                    "page_count": 5,
                    "file_size": 121169,
                    "filepath_local": "recap/gov.uscourts.mdd.578045/gov.uscourts.mdd.578045.136.0.pdf",
                    "filepath_ia": "https://archive.org/download/gov.uscourts.mdd.578045/gov.uscourts.mdd.578045.136.0.pdf",
                    "ia_upload_failure_count": null,
                    "thumbnail": "recap-thumbnails/gov.uscourts.mdd.578045/435748521.thumb.1068.png",
                    "thumbnail_status": 1,
                    "plain_text": "       Case 1:25-cv-00748-JKB         Document 136       Filed 04/08/25      Page 1 of 5\n\n\n\n                       IN THE UNITED STATES DISTRICT COURT\n                          FOR THE DISTRICT OF MARYLAND\n\n\n STATE OF MARYLAND, et al.,\n\n  Plaintiffs,                                      Case No. 1:25-cv-00748-JKB\n\n         v.\n\n UNITED STATES DEPARTMENT OF\n AGRICULTURE, et al.,\n\n  Defendants.\n\n\n                ENJOINED DEFENDANTS’ COMPLIANCE STATUS REPORT\n\n       Under the Court’s April 1, 2025 Preliminary Injunction Order (ECF No. 126) (the\n\n“Preliminary Injunction Order”), Defendants submit this Compliance Status Report.\n\n       Defendants previously filed two Status Reports under to the Court’s Temporary Restraining\n\nOrder (“TRO”) of March 13, 2025 (ECF No. 44). First, the “Restrained Defendants”—the 18\n\nfederal agencies to which the TRO applied (see id. at ¶ 10.b)—filed an original Compliance Status\n\nReport on March 17, including 18 declarations from the Restrained Defendants. (ECF No. 52).\n\nThe next day, on March 18, the Court issued an Order stating that the filed Compliance Status\n\nReport “reflects that the Restrained Defendants have made meaningful progress toward\n\ncompliance with the TRO.” ECF No. 72 at ¶ 1. Second, in accordance with the March 18 Order,\n\nthe Restrained Defendants filed an Updated Compliance Status Report on March 25 (ECF No.\n\n103), apprising the Court of additional steps toward compliance with the TRO. In response to that\n\nOrder’s directive to provide “updated declarations, from appropriate personnel at each of the\n\nRestrained Defendant agencies, addressing the reinstatement of Affected Probationary\n\nEmployees,” (ECF No. 72 at ¶ 2), the March 25 Updated Compliance Status Report included 18\n\nupdated declarations from each Restrained Defendant.\n\n                                               1\n\f        Case 1:25-cv-00748-JKB                 Document 136            Filed 04/08/25          Page 2 of 5\n\n\n\n         The April 1, 2025 Preliminary Injunction Order applies to 20 federal agencies (the 18\n\nRestrained Defendants plus the United States Department of Defense and the Office of Personnel\n\nManagement) (the “Enjoined Defendants”),1 and includes a new definition of “Affected\n\nProbationary Employee” (as previously used in the TRO), including geographic scope\n\nrestrictions.2 ECF No. 126, at ¶ 8. The Preliminary Injunction Order stayed the “purported\n\nterminations” of “Affected Probationary Employees” and ordered their reinstatement (to the extent\n\nnot already done under the TRO). See id at ¶ 2. The Preliminary Injunction Order also prohibited\n\nthe Enjoined Defendants from conducting any future Reductions in Force (“RIFs”) except in\n\ncompliance except in compliance with statutory and regulatory requirements,3 while also noting\n\nthat it does not prohibit the Government “from conducting lawful terminations of probationary\n\nfederal employees” (as detailed). See id. at ¶ 3, n.1. Finally, with respect to compliance reporting,\n\nthe Preliminary Injunction Order directed:\n\n       On or before Tuesday, April 8, 2025, at 2:00 p.m. EDT, the Enjoined Defendants\n       SHALL FILE on the Court’s electronic docket a Status Report documenting the\n       actions that they have taken to comply with this Order. Such Status Repot shall set\n       forth the number of Affected Probationary Employees at each Enjoined Defendant\n       agency, broken down by subagency, department, and/or other subdivision, to the\n       greatest degree of granularity practicable.\n1\n Specifically, the Enjoined Defendants include United States Department of Agriculture; United States Department\nof Commerce; the United States Department of Defense; United States Department of Education; United States\nDepartment of Energy; United States Department of Health and Human Services; United States Department of\nHomeland Security; United States Department of Housing and Urban Development; United States Department of\nInterior; United States Department of Labor; United States Department of Transportation; United States Department\nof Treasury; United States Department of Veterans Affairs; Consumer Financial Protection Bureau; Environmental\nProtection Agency; Federal Deposit Insurance Corporation; General Services Administration; Office of Personnel\nManagement; Small Business Administration; and the U.S. Agency for International Development, along with their\ncorresponding agency heads sued in their official capacities. See ECF No. 126, ¶ 8.a.\n2\n  The definition incorporates whether the employee’s “duty station (prior to any purported termination) and/or\nresidence is in one of” the 20 states or jurisdictions listed in the Order. See ECF No. 126, ¶ 8.b.\n3\n  Specifically, the Preliminary Injunction Order provides the Enjoined Defendants shall not “conduct any future\n[RIFs]—whether formally labeled as such or not—with respect to Affeced Probationary Employees, except in\ncompliance with the notice requirements set forth in 5 U.S.C. § 3502, relevant regulations set forth in Title 5,\nChapter I of the Code of Federal Regulations, and all other applicable law, in order to ensure that Plaintiff States\nreceive adequate notice, as required by law, in order to conduct their mandated rapid-response activities and to fulfill\nother applicable legal obligations.” See ECF No. 126, ¶ 3.\n\n                                                           2\n\f        Case 1:25-cv-00748-JKB        Document 136        Filed 04/08/25     Page 3 of 5\n\n\n\n\nId. at ¶ 4.\n\n        In support of this report, the Enjoined Defendants submit the attached Declarations, see\n\nExhibit 1. These include declarations from (i) the Office of Personnel Management and the\n\nDepartment of Defense, which as noted above, are newly enjoined parties, and (ii) any Enjoined\n\nDefendants for which there have been relevant changes in material circumstances since their\n\nsubmission of second declarations on March 25, 2025 (as explained above), including recent\n\ndeclarations originally submitted in AFGE, et al. v. Ezell, et al., No. 25-cv-01780-WHA (N.D.\n\nCal.). Of the remaining Enjoined Defendants, undersigned counsel is aware of no material status\n\nchanges since the submission of their second declarations on March 25, 2025.\n\n        Defendants will submit any further reports as may be directed by the Court.\n\nApril 8, 2025                                Respectfully submitted,\n\n                                             YAAKOV ROTH\n                                             Acting Assistant Attorney General\n                                             Civil Division\n\n                                             ERIC J. HAMILTON\n                                             Deputy Assistant Attorney General\n\n                                             DIANE KELLEHER\n                                             Branch Director\n\n                                             CHRISTOPHER HALL\n                                             Assistant Director\n\n                                             /s/ Steven M. Chasin\n                                             Steven M. Chasin\n                                             Trial Attorney\n                                             U.S. Department of Justice\n                                             Civil Division, Federal Programs Branch\n                                             1100 L Street, N.W.\n                                             Washington, D.C. 20005\n                                             Tel.: (202) 305-0747\n                                             Email: Steven.M.Chasin2@usdoj.gov\n\n\n\n                                                3\n\fCase 1:25-cv-00748-JKB   Document 136    Filed 04/08/25   Page 4 of 5\n\n\n\n                             KELLY O. HAYES\n                             United States Attorney\n\n                             Beatrice C. Thomas\n                             Assistant United States Attorney\n                             United States Attorney’s Office\n                             36 S. Charles Street, 4th Floor\n                             Baltimore, MD 21202\n                             Email: beatrice.thomas@usdoj.gov\n\n                             Attorneys for Defendants\n\n\n\n\n                                4\n\f       Case 1:25-cv-00748-JKB           Document 136         Filed 04/08/25      Page 5 of 5\n\n\n\n                                 CERTIFICATE OF SERVICE\n\nI certify that on this 8th day of April 2025, I electronically filed the foregoing with the Clerk of\nthe Court using the CM/ECF System, which will send notice of such filing to all counsel.\n\n/s/ Steven M. Chasin\n\nSteven M. Chasin\n\n\n\n\n                                                  5\n\f",
                    "ocr_status": 2,
                    "date_upload": "2025-04-08T11:47:56.464614-07:00",
                    "document_number": "136",
                    "attachment_number": null,
                    "pacer_doc_id": "093014782708",
                    "is_available": true,
                    "is_free_on_pacer": null,
                    "is_sealed": null,
                    "document_type": 1,
                    "description": "",
                    "acms_document_guid": ""
                },
                {
                    "resource_uri": "https://www.courtlistener.com/api/rest/v4/recap-documents/435748549/",
                    "id": 435748549,
                    "tags": [],
                    "absolute_url": "/docket/69714275/136/1/state-of-maryland-v-united-states-department-of-agriculture/",
                    "date_created": "2025-04-08T11:46:33.839955-07:00",
                    "date_modified": "2025-04-09T02:42:54.846700-07:00",
                    "sha1": "e59a4e369104f14ad2add6254a3ba3d86e26ede8",
                    "page_count": 29,
                    "file_size": 716129,
                    "filepath_local": "recap/gov.uscourts.mdd.578045/gov.uscourts.mdd.578045.136.1.pdf",
                    "filepath_ia": "https://archive.org/download/gov.uscourts.mdd.578045/gov.uscourts.mdd.578045.136.1.pdf",
                    "ia_upload_failure_count": null,
                    "thumbnail": "recap-thumbnails/gov.uscourts.mdd.578045/435748549.thumb.1068.png",
                    "thumbnail_status": 1,
                    "plain_text": "Case 1:25-cv-00748-JKB Document136-1 Filed 04/08/25 Page 1of 29\n\nEXHIBIT 1\n\fCase 1:25-cv-00748-JKB Document136-1 Filed 04/08/25 Page 2 of 29\n\nIN THE UNITED STATES DISTRICT COURT\nFOR THE DISTRICT OF MARYLAND\n\nMaryland, et al.,\n, Case No. 1:25-cv-00748-JKB\nPlaintiffs,\nv.\n\nUnited States Department of Agriculture,\n\net al.,\n\nDefendants.\n\nDECLARATION OF MARY PLETCHER RICE\n\nPursuant to 28 U.S.C. § 1746, I, Mary Pletcher Rice declare as follows:\n\nl. 1 am the Acting Principal Deputy Assistant Secretary for Administration within\nDepartmental Administration at the United States Department of Agriculture (“USDA” or\n“Department’’) headquartered in Washington, D.C. I make this Declaration based on my own\npersonal knowledge, on information contained in the records of USDA, or on information provided\nto me by USDA employees. | have served in this position since January 31, 2025, and I have been\nemployed at USDA since 2018. I submitted previous declarations in this matter and rely on and\nincorporate my prior declaration testimony in making this declaration.\n\n2. In my role at USDA, | currently oversee the Department’s Office of Human\nResources Management and | have purview over USDA subagencies’ Chief Operating Officers\nand Human Resources Offices.\n\n3, USDA reinstated and notified the Affected Probationary Employees to the pay\n\nstatus they were in prior to their terminations. The Affected Probationary Employees who are in\n\fCase 1:25-cv-00748-JKB Document136-1 Filed 04/08/25 Page 3 of 29\n\npay status were initially placed on administrative leave as part of the phased plan to return the\nemployees to work.\n\n4, Given the large number of Affected Probationary Employees being reinstated,\nUSDA is simultaneously developing and implementing enhanced procedures and tracking the\nDepartment’s progress in returning the Affected Probationary Employees to full duty status. For\nexample, USDA administered an electronic survey through which Affected Probationary\nEmployees can indicate whether they elect to return to full duty status or whether they decline to\nreturn to full duty status. As the tracking system is being developed, some of the data is being\ninput manually by Human Resources personnel and reflecting a more comprehensive and detailed\nperspective of this multi-faceted undertaking. USDA is providing this compliance update based\nin part on this dynamic data set. USDA is also using timekeeping data to ascertain which Affected\nProbationary Employees have returned to full duty status (returned to work) and which Affected\nProbationary Employees remain on administrative leave.\n\n5. Approximately 4,633 Affected Probationary Employees have been returned to full\nduty status or have a confirmed date on which they will return to full duty status.\n\n6. Human Resources personnel continue to try to reach all affected employees by\nemail and telephone to confirm their elections regarding the return to full duty status and, for those\nemployees who elect to return to full duty status, to continue to implement USDA’s phased plan\nto return the Affected Probationary Employees to full duty status. The phased plan considers an\nemployee’s need to access, and availability of, information technology and other equipment;\nLincpasses (badges); systems credentials; workstation readiness; and safety and security of\n\nfacilities. USDA is continuously receiving updates and information from the people in the group\n\fCase 1:25-cv-00748-JKB Document136-1 Filed 04/08/25 Page 4 of 29\n\nof Affected Probationary Employees, via the survey and other modes of communication, regarding\n\nthe offer to return to full duty status.\n\nPursuant to 28 U.S.C. § 1746, I declare under penalty of perjury that the foregoing is true\n\nand correct.\n\nDated: April 8, 2025\n\nDigitally signed by\nMARY RIC MARY RICE\n\nDate: 2025.04.08\n\n13:46:37 -04'00'\nMARY PLETCHER RICE\n\fCase 1:25-cv-00748-JKB Document136-1 Filed 04/08/25 Page 5of 29\n\nIN THE UNITED STATES DISTRICT COURT\nFOR THE DISTRICT OF MARYLAND\n\nMaryland, et al.,\n\nCase No. 1:25-cy- -\nPlaintiffs, ase No. 1:25-cv-00748-JKB\n\nv.\nUnited States Department of Agriculture,\n\net al.,\n\nDefendants.\n\nDECLARATION OF TIMOTHY D. DILL\n\nPursuant to 28 U.S.C. § 1746, I, Timothy D. Dill, declare as follows:\n\n1. I am currently the official performing the duties of the Assistant Secretary of\nDefense for Manpower and Reserve Affairs of the Department of Defense (“Department”),\nheadquartered in Washington, D.C. I make this declaration based on my own personal knowledge,\non information contained in the records of the Department, or on information provided to me by\nDepartment employees.\n\n2. I have served in this position since January 22, 2025, In my role at the Department,\nI am responsible for personnel policy for the Department of Defense’s civilian workforce. That\nresponsibility includes tracking and recording personnel actions, including terminations, I am\nresponsible for ensuring that all personnel actions, including those related to probationary\nemployees, comply with federal law.\n\n3. As of Tuesday, April 8, 2025, the Department had 216 employees potentially\n\ncategorized as Affected Probationary Employees, as defined in paragraph 8(b) of the Preliminary\n\fCase 1:25-cv-00748-JKB Document136-1 Filed 04/08/25 Page 6 of 29\n\nInjunction Order, depending on whether they reside or work in states covered by the Preliminary\nInjunction in this case. Between March 14, 2025, and March 31, 2025, the Department offered\nreinstatement to each of these employees, pursuant to the district court’s preliminary injunction in\nAFGE v. Ezell (N.D. Cal.).\n\n4. As of Tuesday, April 8, 2025, the Department had communicated reinstatement\nstatus to each Affected Probationary Employee by telephone, personal email, and/or other means\nof communication.\n\n5. Eight Affected Probationary Employees declined reinstatement or resigned,\n\n6. Of the 208 Affected Probationary Employees who have been reinstated or have\naffirmatively agreed to reinstatement, five are not currently in a duty status. Of these five, one\nrequested a delayed return to duty due to family care needs, one was reinstated and subsequently\nterminated for misconduct, and three were reinstated but did not report for duty and are pending\n\ntermination for misconduct.\n\nPursuant to 28 U.S.C. § 1746, I declare under penalty of perjury that the foregoing is true\nand correct to the best of my knowledge.\n\nDated: April 8, 2025\n“T= DW\n\nTIMOTHY D, DILL\n\fCo Oo CO NHN DBD WT FSF WD NYO —\n\n—\n\nCase 1:25-cv-00748-JKB\n\nPATRICK D. ROBBINS (CABN 152288)\nActing United States Attorney\n\nPAMELA T. JOHANN (CABN 145558)\nChief, Civil Division\n\nKELSEY J. HELLAND (CABN 298888)\nAssistant United States Attorney\n\nU.S. ATTORNEY’S OFFICE\n\n450 Golden Gate Avenue, Box 36055\n\nSan Francisco, California 94102-3495\n\nERIC HAMILTON\n\nDeputy Assistant Attorney General\nDIANE KELEHER\n\nBranch Director\n\nCHRISTOPHER HALL\n\nAssistant Branch Director\n\nJAMES D. TODD, JR.\n\nSenior Trial Counsel\n\nU.S. DEPARTMENT OF JUSTICE\nCivil Division, Federal Programs Branch\nP.O. Box 883\n\nWashington, DC 20044\n\nCounsel for Defendants\n\nDocument 136-1\n\nFiled 04/08/25 Page 7 of 29\n\nUNITED STATES DISTRICT COURT\nFOR THE NORTHERN DISTRICT OF CALIFORNIA\nSAN FRANCISCO DIVISION\n\nAMERICAN FEDERATION OF\nGOVERNMENT EMPLOYEES, et al.\n\nPlaintiffs,\nv.\n\nUNITED STATES OFFICE OF PERSONNEL\nMANAGEMENT, e¢ al.,\n\nDefendants.\n\nMarch 31, 2025 Declaration of Reesha Trznadel\n3:25-cv-1780-WHA\n\nCase No. 3:25-cv-1780-WHA\n\nMARCH 31, 2025 DECLARATION OF\nREESHA TRZNADEL\n\n\fCase 1:25-cv-00748-JKB Document136-1 Filed 04/08/25 Page 8 of 29\n\nI, Reesha Trznadel, declare, pursuant to 28 U.S.C. § 1746, as follows:\n\n1. I am the Acting Chief Human Capital Officer of the Department of Energy\n(“DOE”), headquartered in Washington, D.C. ] make this Declaration based on my own personal\nknowledge, on information contained in the records of DOE, or on information provided to me by\nDOE employees.\n\n2. I have served in this position since February 28, 2025. In my Acting role at DOE,\n| oversee those responsible for personnel management. I oversee those responsible for tracking\nand recording personnel actions, including terminations. | assist in ensuring that all personnel\nactions comply with federal law, including those related to probationary employees.\n\n3. On February 13 and 14, 2025, DOE terminated approximately 555 probationary\nemployees (“Affected Probationary Employees”).\n\n4, On March 17, 2025, DOE cancelled the termination notices for all of its 555\nAffected Probationary Employees and placed them in a retroactive Administrative Leave status\nfrom the date of removal to allow DOE time to arrange for an orderly return to the office\n(onboarding).\n\n5. DOE’s Energy IT Services has been working diligently to assign and provide\nequipment to the Affected Probationary Employees and to onboard the Affected Probationary\nEmployees who have received equipment. However, not all Affected Probationary Employees\nhave received equipment yet.\n\n6. DOE’s badging offices have also been working diligently to process the Affected\nProbationary Employees’ new badges. However, not all Affected Probationary Employees’ badges\nhave been processed yet.\n\n7. On March 28 and 31, 2025, DOE management was instructed to switch any\nremaining Affected Probationary Employees from “Administrative Leave” to “Regular Duty.”\n\n8. On March 28 and 31, 2025, all Departmental Elements were instructed to have\nsupervisors make every effort to contact Affected Probationary Employees that have not yet\nreceived equipment or a badge and give them meaningful work to the extent possible and\n\nconsistent with systems security protocols. For example, supervisors with Affected Probationary\n\nMarch 31, 2025 Declaration of Reesha Trznadel\n3:25-cv-1780-WHA\n\fFiled 04/08/25 Page 9 of 29\n\nCase 1:25-cv-00748-JKB Document 136-1\n\nEmployees without equipment or badges were instructed to consider whether these employees\n\ncould, consistent with security protocols, attend meetings by phone, read up on public source\n\nmaterials, talk with colleagues, etc. until they are fully onboarded.\nDOE continues to work diligently to fully onboard all its Affected Probationary\n\n9.\n\nEmployees as quickly as possible.\nPursuant to 28 U.S.C. § 1746, I declare under penalty of perjury that the foregoing is true\n\nand correct.\nDated: March 31, 2025\n\n/s/ Reesha Trznadel\n\nREESHA TRZNADEL\nACTING CHIEF HUMAN CAPITAL OFFICER\n\nUS DEPARTMENT OF ENERGY\n\nMarch 31, 2025 Declaration of Reesha Trznadel\n3:25-cv-1780-WHA\n2\n\fCase 1:25-cv-00748-JKB Document136-1 Filed 04/08/25 Page 10 of 29\n\nIN THE UNITED STATES DISTRICT COURT\nFOR THE DISTRICT OF MARYLAND\n\nMaryland, et al.,\n\nCase No. 1:25-cv-00748-JKB\nPlaintiffs,\n\nVv.\n\nUnited States Department of Agriculture,\n\net al.,\n\nDefendants.\n\nDECLARATION OF THOMAS NAGY\n\nPursuant to 28 U.S.C. § 1746, I, Thomas Nagy, declare as follows:\n\nlL. I am the Deputy Assistant Secretary for Human Resources / Chief Human Capitol\nOfficer, United States Department of Health and Human Services (“HHS” or “Department”)\nheadquartered in Washington, D.C. | make this declaration based on my own personal knowledge\nand information provided to me by the Department’s Human Resources Office.\n\n2. I have served in this position since March 17, 2025. In my role at HHS, I am\nresponsible for personnel management. | have the responsibility for overseeing the personnel\nenterprise. I assist in ensuring that all personnel actions comply with federal law, including those\nrelated to probationary employees.\n\n3. As of Tuesday, April 8, 2025, HHS has 2,407 Affected Probationary Employees,\nas defined by the Order. However, several individuals have since resigned. Of the remaining\n\n2,354 affected probationary employees, all continue in a paid administrative leave status.\n\fCase 1:25-cv-00748-JKB Document136-1 Filed 04/08/25 Page 11 of 29\n\n4, On or about April 1, 2025, HHS notified 318 of the remaining Affected\nProbationary Employees that they would be subjected to a reduction-in-force (RIF). Currently,\n\nthose 318 employees remain in paid administrative leave status.\n\nPursuant to 28 U.S.C. § 1746, I declare under penalty of perjury that the foregoing is true\n\nand correct.\nDated: April 8, 2025\n\nDigitally signed by\n\nTHOMAS J, THOMAS J. NAGY JR\nNAGY JR-S Date: 2025.04.08\n\n13:07:10 -04'00'\nThomas Nagy, Jr.\n\fCase 1:25-cv-00748-JKB Document136-1 Filed 04/08/25 Page 12 of 29\n\nIN THE UNITED STATES DISTRICT COURT\nFOR THE DISTRICT OF MARYLAND\n\nMaryland, et al.,\n\nPlaintiffs,\nVv.\n\nUnited States Department of Agriculture,\n\net al.,\n\nDefendants.\n\nCase No. 1:25-cv-00748-JKB\n\nDECLARATION OF LORI A. MICHALSKI\n\nPursuant to 28 U.S.C. § 1746, I, Lori A. Michalski declare as follows:\n\n1. I am the Chief Human Capital Officer, U.S. Department of Housing and Urban\nDevelopment, headquartered in Washington, D.C. | make this Declaration based on my own\n\npersonal knowledge, on information contained in the records of the U.S. Department of Housing\n\nand Urban Development (HUD). or on information provided to me by HUD employees.\n\n2. ] have served in this position since February 2021. In my role at HUD, | am\nresponsible for personnel management. I have the responsibility for overseeing the personnel\nenterprise and tracking and recording of personnel actions, including terminations. | assist in\nensuring that all personnel actions comply with federal law, including those related to probationary\n\nemployees. | submitted previous declarations in this matter on March 17 and March 25, 2025, and\n\nrely on and incorporate my prior declaration testimony in making this declaration.\n\fCase 1:25-cv-00748-JKB Document136-1 Filed 04/08/25 Page 13 of 29\n\n3. As of Monday, March 17, 2025, HUD had 312 Affected Probationary Employees,\nas defined in paragraph 10(c) of the Temporary Restraining Order. As of that date, HUD reinstated\n297 Affected Probationary Employees.\n\n4, As of the week of Monday, April 7, 2025, HUD communicated Affected\nProbationary Employees’ reinstatement status to each by telephone, personal email, and/or other\nmeans of communication. HUD was able to reach all probationary employees.\n\n5. Fifteen (15) Affected Probationary Employees declined reinstatement with HUD\nand submitted an effective date for resignation.\n\n6. Eleven (11) employees were reinstated effective March 10, 2025, two (2) were\nreinstated effective March 12, 2025, and 284 were reinstated effective March 17, 2025. The 13\nemployees reinstated on March 10\" and March 12th are onboard, have PIV cards issued, HUD\nemail and badging/system access, and payroll processed. Twelve (12) have had their leave\nrestored. One employee received a lump sum payment; therefore, this employee will need to repay\nthe net amount of the disbursement so annual leave hours can be restored. The other 284\nemployees are on paid administrative leave.\n\n7. Additionally, the termination of all of the reinstated employees was cancelled;\ntherefore, an SF-50 will not be issued to reflect reinstatement.\n\n8. As of this date, HUD has one Affected Probationary Employee who has accepted\noutside employment. The employee is working with the Office of General Counsel, Ethics Law\nDivision regarding their specific questions related to outside employment while on administrative\n\nleave.\n\nPursuant to 28 U.S.C. § 1746, I declare under penalty of perjury that the foregoing is true\n\nand correct.\n\nDated: April 8, 2025\n\fCase 1:25-cv-00748-JKB Document136-1 Filed 04/08/25 Page 14 of 29\n\nLORI Sais, sy tt\n\nDepatrer of Ho.s-9 ara Litas\nMICHALSK litt 255 cscs co.cc\n/s/\n\nLori A. Michalski\n\fCase 1:25-cv-00748-JKB Document136-1 Filed 04/08/25 Page 15 of 29\n\nIN THE UNITED STATES DISTRICT COURT\nFOR THE DISTRICT OF MARYLAND\n\nMaryland, et al.,\n\ni. Case No. 1:25-cv-00748-JKB\nPlaintiffs,\n\nv.\nUnited States Department of Agriculture,\n\net al.,\n\nDefendants.\n\nDECLARATION OF STEPHANIE M. HOLMES\n\nPursuant to 28 U.S.C. § 1746, I, Stephanie M. Holmes, declare as follows:\n\n1. I am the Acting Chief Human Capital Officer for the U.S. Department of the\n\nInterior (“Department”), headquartered in Washington, D.C. I have served in this position since\n\nFebruary 24, 2025. I make this declaration based on my own personal knowledge, on information\n\ncontained in the records of the Department, or on information provided to me by Department\n\nemployees.\n\n2. In my role at the Department, | am responsible for personnel management. | have\n\nthe responsibility for overseeing the personnel enterprise and tracking and recording of personnel\n\nactions, including terminations. | assist in ensuring that all personnel actions comply with federal\n\nlaw, including those laws related to probationary and trial period appointees. I submitted a\n\nprevious declaration in this matter on March 25, 2025, and rely on and incorporate my prior\n\ndeclaration testimony in making this declaration.\n\fCase 1:25-cv-00748-JKB Document136-1 Filed 04/08/25 Page 16 of 29\n\n3. Through this declaration, I provide updated information relevant to the\nDepartment’s efforts to return reinstated individuals to full duty status.\n\n4, As of the date and time of this declaration, the Department has returned 1,242\nreinstated individuals to full-duty status. The Department did not reinstate 186 affected individuals\nbecause they declined the Department’s offer of reinstatement. As of the date and time of this\ndeclaration, the Department continues to work diligently and expeditiously to process returning to\nfull-duty status all remaining 444 reinstated appointees, to whom the Department continues to\ngrant paid administrative leave while the Department continues to process all applicable human\n\nresources procedures .\n\nPursuant to 28 U.S.C. § 1746, I declare under penalty of perjury that the foregoing is true\n\nand correct.\n\nDated: April 8, 2025\nDigitally signed by STEPHANIE\n\nSTEPHANIE HOLMES xoumes\n\n/ Date: 2025.04.08 10:49:54 -0400 /\n\nSTEPHANIE M. HOLMES\n\fCase 1:25-cv-00748-JKB Document136-1 Filed 04/08/25 Page 17 of 29\n\nIN THE UNITED STATES DISTRICT COURT\nFOR THE DISTRICT OF MARYLAND\n\nMaryland, et al.,\n\ni, Case No. 1:25-cv-00748-JKB\nPlaintiffs,\n\nVv.\n\nUnited States Department of Agriculture,\n\net al.,\n\nDefendants.\n\nDECLARATION OF CARRIE SHARP\nI, Carrie Sharp, declare, pursuant to 28 U.S.C. § 1746, as follows:\n\nI. I am the Director, Human Capital Strategy, Evaluation and Analysis for Human\nResources (HR) and Acting Deputy Chief Human Capital Officer for the United States\nDepartment of the Treasury, headquartered in Washington, D.C. I have served in the Director\nposition since June 2022, and Acting Deputy Chief Human Capital Officer since January 2025.\n\n2. As Director for HR, I oversee all human capital programs for the Department of\nthe Treasury and its bureaus (collectively. “Treasury”). I support the Deputy Assistant Secretary\nfor Human Resources with tracking and recording personnel actions, including terminations.\n\n3. Based on my roles and responsibilities, | am familiar with the steps Treasury has\ntaken to reinstate terminated probationary employees affected by the Court’s March 13, 2025,\nOrder (“Affected Probationary Employees”). I am also familiar with the steps required to restore\n\nthese employees to active-duty status.\n\fCase 1:25-cv-00748-JKB Document136-1 Filed 04/08/25 Page 18 of 29\n\n4. As of April 4, 2025, Affected Probationary Employees have received backpay and\nbenefits for the period of separation, and have been certified to continue receiving paychecks and\nbenefits.\n\n5. At the Internal Revenue Service (“IRS”), there were 7,315 Affected Probationary\nEmployees. As of April 4, 2025, 213 Affected Probationary Employees voluntarily resigned.\nAdditionally, three (3) Affected Probationary Employees have returned to full work status. For\nthe remaining Affected Probationary Employees, IRS has sent communication providing notice of\ntheir scheduled return to full duty status with an intended effective date of April 14, 2025 for\nreturning the remaining Affected Probationary Employees to full work status. Further, IRS has\ncompleted its strategy for a phased approach to return Affected Probationary Employees to full\nwork status, including identifying employees who are telework ready and those who will be in\noffice, completing the initial space assessment, completing equipment inventory, completing\nMUM processing to initiate personnel actions, completing access to basic LAN, Outlook, and the\nInternet for Affected Probationary Employees and ERAP for those Affected Probationary\nEmployees who are able to telework, completing the mass activation with Treasury, and\nconfirming activation of PIV cards for all remaining Affected Probationary Employees.\n\n6. At the Bureau of the Fiscal Service (“BFS”), there were 168 Affected\nProbationary Employees. As of April 4, 2025, twenty-five (25) Affected Probationary Employees\nhave voluntarily resigned. The remaining 143 Affected Probationary Employees have been\nreprovisioned in Bureau Systems for logical access to Microsoft 365. Additionally, BFS has\ncompleted certification of timecards for the remaining Affected Probationary Employees.\n\nFurther, BFS has re-printed and activated PIV cards, re-issued laptops, and returned to regular\n\nworking status twenty-five (25) Affected Probationary Employees. Sixty-nine (69) Affected\n\fCase 1:25-cv-00748-JKB Document136-1 Filed 04/08/25 Page 19 of 29\n\nProbationary Employees are scheduled for PIV and laptop appointments. BFS is confirming PIV\nand laptop appointments for forty-eight (48) Affected Probationary Employees. One (1) Affected\nProbationary Employee has been non-responsive to BFS communications regarding returning to\nregular working status.\n\n7. The Office of the Comptroller of the Currency (“OCC”) is continuing to process\nthe responses to the March 17 notices issued to the Affected Probationary Employees informing\nthem of their reinstatement and placement on administrative leave status as of March 17, 2025.\nSpecifically, OCC is communicating with the Affected Probationary Employees and providing\nonboarding instructions with a targeted return to full-duty status on April 14, 2025. In\npreparation, OCC is finalizing and sending return to full-duty status notices to the Affected\nProbationary Employees. Further, OCC is ensuring that all Affected Probationary Employees\nhave workspaces, equipment, and access to relevant systems with a targeted completion date of\nApril 11, 2025. OCC is also ensuring personal identity verification (PIV) card access and access\nto relevant offices and systems are provided to the Affected Probationary Employees with a\ntargeted completion date of April 11, 2025. As of April 4, 2025, four (4) Affected Probationary\nEmployees have voluntarily resigned, and seven (7) Affected Probationary Employees have\nexpressed an intention to resign. Further, eleven (11) Affected Probationary Employees, who are\nstudent interns and were not on active-duty status at the time of the terminations, have been\nreturned to a leave without pay status. OCC has a targeted date for return to full-duty status for\nall remaining Affected Probationary Employees of April 14, 2025.\n\n8. At the Bureau of Engraving and Printing (‘BEP”), there were forty-five (45)\nAffected Probationary Employees. As of April 4, 2025, thirty-six (36) Affected Employees have\n\nreturned to full in-person active-duty status. Two (2) Affected Employees voluntarily resigned.\n\fCase 1:25-cv-00748-JKB Document136-1 Filed 04/08/25 Page 20 of 29\n\nTwo (2) Affected Employees have failed to respond to BEP’s communications to return to regular\nworking status. Five (5) Affected Employees will begin full duty working status on Monday,\nApril 7, 2025.\n\n9. At the U.S. Mint, there were eight (8) Affected Probationary Employees. As of\nApril 4, 2025, the Mint has successfully notified and received acknowledgement from the eight\n(8) Affected Probationary Employees to report for duty in the office effective and beginning\nMonday April 7, 2025, for their regularly scheduled shifts. Further, the Mint has arranged for the\nAffected Probationary Employees to be granted access to Mint facilities as appropriate and\nbadges will be re-issued to the Affected Probationary Employees on their first regular day in the\noffice. Additionally, the Mint has contacted IT and all Affected Probationary Employees will\nhave full access to U.S. Mint systems by Monday April 7, 2025.\n\nPursuant to 28 U.S.C. § 1746, I declare under penalty of perjury that the foregoing is true\n\nand correct.\n\nDated: April 8, 2025\n\n. Digitally signed by\nCa mre R. Carrie R. Sharp\n\nDate: 2025.04.08\nSharp 09:53.54 -04°00\n\nCARRIE SHARP\n\n\fCase 1:25-cv-00748-JKB Document 136-1 Filed 04/08/25 Page 21 of 29\n\nIN THE UNITED STATES DISTRICT COURT\nFOR THE DISTRICT OF MARYLAND\n\nMaryland, et al.,\n\n, Case No. 1:25-cv-00748-JKB\nPlaintiffs,\n\nVv.\n\nUnited States Department of Agriculture,\n\net al.,\n\nDefendants.\n\nDECLARATION OF ADAM MARTINEZ\n\nPursuant to 28 U.S.C. § 1746, 1, Adam Martinez declare as follows:\n\nl. 1] am the Acting Chief Human Capital Officer of the Consumer Financial Protection\nBureau (“Bureau™ or “CFPB”) headquartered in Washington, D.C. | make this declaration based\non my own personal knowledge, on information contained in the records of the CFPB, or on\ninformation provided to me by CFPB employees.\n\n2. I have served in this position since approximately, Monday, October 21, 2024. In\nmy role at the CFPB, I am responsible for personnel management. | have the responsibility for\noverseeing the personnel enterprise and tracking and recording of personnel actions, including\nterminations. | assist in ensuring that all personnel actions comply with federal law, including those\nrelated to probationary employees. I submitted previous declarations in this matter on March 17\nand 24, 2025 and rely on and incorporate my prior declaration testimony in making this\n\ndeclaration.\n\fCase 1:25-cv-00748-JKB Document136-1 Filed 04/08/25 Page 22 of 29\n\n3. As of Monday, March 17, 2025, CFPB had 117 Affected Probationary Employees,\nas defined in paragraph 10(c) of the Temporary Restraining Order. As of that date, CFPB had\nreinstated 117 Affected Probationary Employees.\n\n4, On Sunday, March 16, 2025, CFPB transmitted reinstatement notices to 117\nemployees via personal email. All employees have been reinstated with the exception of eight\nemployees who have notified CFPB that they will resign. These employees received back pay\nthrough at least the date of resignation.\n\n5. As of Friday, April 4, 2025, all employees were confirmed to have access to CFPB\nsystems.\n\n6. CFPB is working with its external human resources processing shared service\nprovider and was able to cancel the termination action from the human resources system of records\nand employee personnel files. 114 out of 117 reinstatements have applied in the system. Three\nreinstated employees returned suspense errors and are in the process of being reapplied in the\nsystem. For administrative reasons made known to me since the submission of my March 24\ndeclaration, reinstated employees at this time are still able to see both the SF-50 for the separation\naction and the corresponding SF-50 for the cancellation in their electronic official personnel file\n(eOPF), the latter of which supersedes the former. Employees with full access to CFPB systems\nare able to review their personnel profile in our human resources information system and their\nindividual eOPF.\n\n7. Two employees will receive remaining back pay from pay period 03 by Monday, April 14,\n2025. The CFPB is working with the HR and payroll vendors to issue manual checks to three\nemployees that haven’t yet applied in the system. All other employees have received all back pay\n\nfor pay periods 03 through 05.\n\fCase 1:25-cv-00748-JKB Document136-1 Filed 04/08/25 Page 23 of 29\n\nPursuant to 28 U.S.C. § 1746, I declare under penalty of perjury that the foregoing is true\n\nand correct.\n\nDated: April 8, 2025\nDigitally signed by\nA DA M ADAM MARTINEZ\nDate: 2025.04.08\nMA RTI N E 12:48:53 -04'00'\n\nAdam Martinez\n\n\fDocusign Envelop@ 1B; BOF 4615 -280E BO FASB FNB 3852ECument 136-1 Filed 04/08/25 Page 24 of 29\n\nIN THE UNITED STATES DISTRICT COURT\nFOR THE DISTRICT OF MARYLAND\n\nMaryland, et al., |\n\nPlaintiffs, Case No. 1:25-cv-00748-JKB\n\nv.\nUnited States Department of Agriculture,\net al.,\n\nDefendants.\n\nDECLARATION OF JEREMY TAYLOR\n\nPursuant to 28 U.S.C. § 1746, I, Jeremy Taylor declare as follows:\n\n1. I am the Deputy Chief Human Capital Officer, Office of Human Resources\nManagement, at the General Services Administration headquartered in Washington, D.C. I make\nthis declaration based on my own personal knowledge, on information contained in the records of\nthe General Services Administration, or on information provided to me by the Office of Human\nResources Management, General Services Administration employees.\n\n2. ] have served in this position since July 2024. In my role at the General Services\nAdministration, | am responsible for personnel management. I have the responsibility for\noverseeing the personnel enterprise and tracking and recording of personnel actions, including\nterminations. | assist in ensuring that all personnel actions comply with federal law, including those\n\nrelated to probationary employees. I submitted previous declarations in this matter on March 17\n\fDocusign Envelope ti BOF G64a5-A80E Gb 2 AO SAB 3BS2ERCUment 136-1 Filed 04/08/25 Page 25 of 29\n\nand March 25, 2025, and rely on and incorporate my prior declaration testimony in making this\ndeclaration.\n\n3, As of Monday, March 17, 2025, had 366 Affected Probationary Employees, as\ndefined in paragraph 10(c) of the Temporary Restraining Order. As of that date, the General\nServices Administration had reinstated 364 Affected Probationary Employees.\n\n4, By March 17, 2025, the General Services Administration communicated Affected\nProbationary Employees’ reinstatement status to each by personal email. The General Services\nAdministration was able to reach 366 of Affected Probationary Employees.\n\n5. As of April 7, 2025, five of the Affected Probationary Employees declined to be\nreinstated and/or resigned shortly after being reinstated.\n\n6. As of April 8, 2025, the General Services Administration has completed the\nfollowing to reinstate the Affected Probationary Employees: 106 elected to participate in the\nDeferred Resignation Program (DRP) 2.0; a total of 81 Affected Employees have been onboarded\nto include the reinstatement of IT access and PIV cards, this includes 54 employees under the GS-\n1102, Acquisition series and 27 employees who have completed their probationary period. A total\nof five (5) employees declined to be reinstated and/or resigned shortly after being reinstated. The\nremaining Affected Probationary Employees are on paid administrative leave.\n\n7. By March 17, 2025, the General Services Administration processed all of its SF50s\nto reinstate the Affected Probationary Employees.\n\n8. Of the Affected Probationary Employees who were reinstated, the General Services\nAdministration is not aware of any having other employment.\n\n9. The General Services Administration has not changed reinstatement status for\n\nAffected Probationary Employees based on state of residence/duty station.\n\fDocusign Envelope}; BaF 46445 -ASQE GE PAG SAB 3852EMCUument 136-1 Filed 04/08/25 Page 26 of 29\n\nPursuant to 28 U.S.C. § 1746, I declare under penalty of perjury that the foregoing is true\n\nand correct.\n\nDated: April 8, 2025\n\n[gem Paufor\n\n=648749BC6994\n\nJeremy Taylor\n\fCase 1:25-cv-00748-JKB Document 136-1 Filed 04/08/25 Page 27 of 29\n\nIN THE UNITED STATES DISTRICT COURT\nFOR THE DISTRICT OF MARYLAND\n\nMaryland, et al.,\n\ni. Case No. 1:25-cv-00748-JKB\nPlaintiffs,\n\nV.\nUnited States Department of Agriculture,\n\net al.,\n\nDefendants.\n\nDECLARATION OF JESSICA M. PARTON\n\nPursuant to 28 U.S.C. § 1746, I, Jessica M. Parton declare as follows:\n\n1. I am the Supervisory Human Resources Specialist headquartered in Washington,\nDC. | make this declaration based on my own personal knowledge, on information contained in\nthe records of the U.S. Office of Personnel Management (OPM), or on information provided to me\nby OPM employees.\n\n2. I have served in this position since June 10, 2018. In my role at OPM, | am\nresponsible for personnel management. | have the responsibility for overseeing the personnel\nenterprise and tracking and recording of personnel actions, including terminations. I assist in\nensuring that all personnel actions comply with federal law, including those related to probationary\nemployees.\n\n3. As of Tuesday, April 8, 2025, OPM had forty-seven (47) Affected Probationary\nEmployees, as defined in paragraph 8(b) of the Preliminary Injunction Order. As of that date,\n\nOPM had reinstated forty-seven (47) Affected Probationary Employees.\n\fCase 1:25-cv-00748-JKB Document136-1 Filed 04/08/25 Page 28 of 29\n\n4, As of Tuesday, April 8, 2025, OPM communicated Affected Probationary\nEmployees’ reinstatement status to each by personal email. One (1) of the emails was returned as\nundeliverable, and we are contacting the employee to obtain a valid email address.\n\n5. OPM has cancelled all termination personnel actions for all Affected Probationary\nEmployees, and all have been placed on paid administrative leave. All Affected Probationary\nEmployees have been restored without physical and system (IT) access. We are coordinating\nclosely with the payroll office to reconcile Affected Probationary Employees’ annual leave and\nintend to offset previously made annual leave payouts with the administrative leave pay to prevent\nor limit indebtedness. Leave will be recredited to Affected Probationary Employees’ accounts. All\nAffected Probationary Employees have been reinstated to the benefits they were enrolled in prior\nto termination, ensuring no break in service. No action is required on the part of Affected\nProbationary Employees with respect to benefits. It may take the carriers a few weeks to\nappropriately update their systems.\n\n6. Forty-seven (47) termination personnel actions have been cancelled.\n\n7. To date, no Affected Probationary Employee has informed us that they decline\nreinstatement. If an Affected Probationary Employee does inform us of a desire to decline\nreinstatement on the basis that they now have outside employment that could conflict with Federal\nemployment under applicable ethics rules, we will consult with our Office of the General Counsel\nto present the Affected Probationary Employee with available options.\n\n8. Two of the forty-seven (47) Affected Probationary Employees were reinstated to\noffices that were subject to a Reduction in Force (RIF). Because the Affected Probationary\nEmployees were in the RIF competitive areas and would have been released in the RIFs, we\n\nreinstated those employees and will be issuing them the required RIF notices. They will remain in\n\nNo\n\fCase 1:25-cv-00748-JKB Document136-1 Filed 04/08/25 Page 29 of 29\n\na paid administrative leave status pending release at the end of the notice period. Neither of the\nRIFs at issue involves competitive areas of fifty (50) or more employees, thus the 5 C.F.R.\n351.803(b) notice requirement with respect to states does not apply.\n\n9. The Deferred Resignation Program (DRP) has reopened for all employees at OPM\nthrough April 14, 2025. With the exception of the two employees described in paragraph eight (8),\n\nwe have offered all Affected Probationary Employees the opportunity to opt into the DRP program\n\nif they so choose.\n\nPursuant to 28 U.S.C. § 1746, 1 declare under penalty of perjury that the foregoing is true and\n\ncorrect.\n\nDated: April 8, 2025\n\n/s/ Jessica M. Parton\n\nJESSICA MARIE PARTON\nSUPERVISORY HR SPECIALIST\n",
                    "ocr_status": 1,
                    "date_upload": "2025-04-08T11:47:40.291712-07:00",
                    "document_number": "136",
                    "attachment_number": 1,
                    "pacer_doc_id": "093014782709",
                    "is_available": true,
                    "is_free_on_pacer": null,
                    "is_sealed": null,
                    "document_type": 2,
                    "description": "Exhibit 1",
                    "acms_document_guid": ""
                }
            ],
            "date_created": "2025-04-08T11:45:30.966419-07:00",
            "date_modified": "2025-04-14T07:10:30.193846-07:00",
            "date_filed": "2025-04-08",
            "time_filed": null,
            "entry_number": 136,
            "recap_sequence_number": "2025-04-08.001",
            "pacer_sequence_number": 587,
            "description": "STATUS REPORT Enjoined Defendants' Compliance Status Report by Scott Bessent, Douglas Burgum, Douglas A. Collins, Consumer Financial Protection Bureau, Sean P Duffy, Stephen Ehikian, Environmental Protection Agency, Charles Ezell, Federal Deposit Insurance Corporation, General Services Administration, Peter Hegseth, Travis Hill, Robert F. Kennedy, Jr, Kelly Loefler, Howard Lutnick, Linda McMahon, Vincent Micone, National Archives and Records Administration, Kristi Noem, Office of Personnel Management, Brooke Rollins, Marco Rubio, Marco Rubio, Small Business Administration, Scott Turner, United States Agency for International Development, United States Department of Agriculture, United States Department of Commerce, United States Department of Defense, United States Department of Education, United States Department of Energy, United States Department of Health & Human Services, United States Department of Homeland Security, United States Department of Housing and Urban Development, United States Department of Interior, United States Department of Labor, United States Department of Transportation, United States Department of Treasury, United States Department of Veterans Affairs, Russell Vought, Christopher Wright (Attachments: # 1 Exhibit 1)(Chasin, Steven) (Entered: 04/08/2025)",
            "tags": []
        },
        {
            "resource_uri": "https://www.courtlistener.com/api/rest/v4/docket-entries/421717990/",
            "id": 421717990,
            "docket": "https://www.courtlistener.com/api/rest/v4/dockets/69714275/",
            "recap_documents": [
                {
                    "resource_uri": "https://www.courtlistener.com/api/rest/v4/recap-documents/435726501/",
                    "id": 435726501,
                    "tags": [],
                    "absolute_url": "",
                    "date_created": "2025-04-08T09:53:37.295548-07:00",
                    "date_modified": "2025-04-14T07:10:29.685961-07:00",
                    "sha1": "",
                    "page_count": null,
                    "file_size": null,
                    "filepath_local": null,
                    "filepath_ia": "",
                    "ia_upload_failure_count": null,
                    "thumbnail": null,
                    "thumbnail_status": 0,
                    "plain_text": "",
                    "ocr_status": null,
                    "date_upload": null,
                    "document_number": "",
                    "attachment_number": null,
                    "pacer_doc_id": "",
                    "is_available": false,
                    "is_free_on_pacer": null,
                    "is_sealed": null,
                    "document_type": 1,
                    "description": "",
                    "acms_document_guid": ""
                }
            ],
            "date_created": "2025-04-08T09:53:37.285582-07:00",
            "date_modified": "2025-04-14T07:10:29.675116-07:00",
            "date_filed": "2025-03-27",
            "time_filed": null,
            "entry_number": null,
            "recap_sequence_number": "2025-03-27.004",
            "pacer_sequence_number": null,
            "description": "Check Received on 3/27/2025 from NEW MEXICO DEPARTMENT OF JUSTICE. Check Number: 29734356870. Amount: $100.00. (kb3s, Deputy Clerk)",
            "tags": []
        },
        {
            "resource_uri": "https://www.courtlistener.com/api/rest/v4/docket-entries/421717989/",
            "id": 421717989,
            "docket": "https://www.courtlistener.com/api/rest/v4/dockets/69714275/",
            "recap_documents": [
                {
                    "resource_uri": "https://www.courtlistener.com/api/rest/v4/recap-documents/435726500/",
                    "id": 435726500,
                    "tags": [],
                    "absolute_url": "",
                    "date_created": "2025-04-08T09:53:37.101638-07:00",
                    "date_modified": "2025-04-14T07:10:29.505445-07:00",
                    "sha1": "",
                    "page_count": null,
                    "file_size": null,
                    "filepath_local": null,
                    "filepath_ia": "",
                    "ia_upload_failure_count": null,
                    "thumbnail": null,
                    "thumbnail_status": 0,
                    "plain_text": "",
                    "ocr_status": null,
                    "date_upload": null,
                    "document_number": "",
                    "attachment_number": null,
                    "pacer_doc_id": "",
                    "is_available": false,
                    "is_free_on_pacer": null,
                    "is_sealed": null,
                    "document_type": 1,
                    "description": "",
                    "acms_document_guid": ""
                }
            ],
            "date_created": "2025-04-08T09:53:37.093935-07:00",
            "date_modified": "2025-04-14T07:10:29.496051-07:00",
            "date_filed": "2025-03-25",
            "time_filed": null,
            "entry_number": null,
            "recap_sequence_number": "2025-03-25.011",
            "pacer_sequence_number": null,
            "description": "Check Received on 3/25/2025 from DEPARTMENT OF JUSTICE FOR DELAWARE. Check Number: 1185. Amount: $100.00. (kb3s, Deputy Clerk)",
            "tags": []
        },
        {
            "resource_uri": "https://www.courtlistener.com/api/rest/v4/docket-entries/421717988/",
            "id": 421717988,
            "docket": "https://www.courtlistener.com/api/rest/v4/dockets/69714275/",
            "recap_documents": [
                {
                    "resource_uri": "https://www.courtlistener.com/api/rest/v4/recap-documents/435726499/",
                    "id": 435726499,
                    "tags": [],
                    "absolute_url": "",
                    "date_created": "2025-04-08T09:53:36.783930-07:00",
                    "date_modified": "2025-04-14T07:10:29.182578-07:00",
                    "sha1": "",
                    "page_count": null,
                    "file_size": null,
                    "filepath_local": null,
                    "filepath_ia": "",
                    "ia_upload_failure_count": null,
                    "thumbnail": null,
                    "thumbnail_status": 0,
                    "plain_text": "",
                    "ocr_status": null,
                    "date_upload": null,
                    "document_number": "",
                    "attachment_number": null,
                    "pacer_doc_id": "",
                    "is_available": false,
                    "is_free_on_pacer": null,
                    "is_sealed": null,
                    "document_type": 1,
                    "description": "",
                    "acms_document_guid": ""
                }
            ],
            "date_created": "2025-04-08T09:53:36.775329-07:00",
            "date_modified": "2025-04-14T07:10:29.172209-07:00",
            "date_filed": "2025-03-24",
            "time_filed": null,
            "entry_number": null,
            "recap_sequence_number": "2025-03-24.009",
            "pacer_sequence_number": null,
            "description": "Check Received on 3/24/2025 from NEVADA ATTORNEY GENERAL. Check Number: 1678. Amount: $100.00. (kb3s, Deputy Clerk)",
            "tags": []
        },
        {
            "resource_uri": "https://www.courtlistener.com/api/rest/v4/docket-entries/421717987/",
            "id": 421717987,
            "docket": "https://www.courtlistener.com/api/rest/v4/dockets/69714275/",
            "recap_documents": [
                {
                    "resource_uri": "https://www.courtlistener.com/api/rest/v4/recap-documents/435726498/",
                    "id": 435726498,
                    "tags": [],
                    "absolute_url": "",
                    "date_created": "2025-04-08T09:53:36.763445-07:00",
                    "date_modified": "2025-04-14T07:10:29.159202-07:00",
                    "sha1": "",
                    "page_count": null,
                    "file_size": null,
                    "filepath_local": null,
                    "filepath_ia": "",
                    "ia_upload_failure_count": null,
                    "thumbnail": null,
                    "thumbnail_status": 0,
                    "plain_text": "",
                    "ocr_status": null,
                    "date_upload": null,
                    "document_number": "",
                    "attachment_number": null,
                    "pacer_doc_id": "",
                    "is_available": false,
                    "is_free_on_pacer": null,
                    "is_sealed": null,
                    "document_type": 1,
                    "description": "",
                    "acms_document_guid": ""
                }
            ],
            "date_created": "2025-04-08T09:53:36.755584-07:00",
            "date_modified": "2025-04-14T07:10:29.149183-07:00",
            "date_filed": "2025-03-24",
            "time_filed": null,
            "entry_number": null,
            "recap_sequence_number": "2025-03-24.008",
            "pacer_sequence_number": null,
            "description": "Check Received on 3/24/2025 from STATE OF CALIFORNIA. Check Number: 529401. Amount: $100.00. (kb3s, Deputy Clerk)",
            "tags": []
        },
        {
            "resource_uri": "https://www.courtlistener.com/api/rest/v4/docket-entries/421717986/",
            "id": 421717986,
            "docket": "https://www.courtlistener.com/api/rest/v4/dockets/69714275/",
            "recap_documents": [
                {
                    "resource_uri": "https://www.courtlistener.com/api/rest/v4/recap-documents/435726497/",
                    "id": 435726497,
                    "tags": [],
                    "absolute_url": "",
                    "date_created": "2025-04-08T09:53:36.743135-07:00",
                    "date_modified": "2025-04-14T07:10:29.142733-07:00",
                    "sha1": "",
                    "page_count": null,
                    "file_size": null,
                    "filepath_local": null,
                    "filepath_ia": "",
                    "ia_upload_failure_count": null,
                    "thumbnail": null,
                    "thumbnail_status": 0,
                    "plain_text": "",
                    "ocr_status": null,
                    "date_upload": null,
                    "document_number": "",
                    "attachment_number": null,
                    "pacer_doc_id": "",
                    "is_available": false,
                    "is_free_on_pacer": null,
                    "is_sealed": null,
                    "document_type": 1,
                    "description": "",
                    "acms_document_guid": ""
                }
            ],
            "date_created": "2025-04-08T09:53:36.733967-07:00",
            "date_modified": "2025-04-14T07:10:29.132263-07:00",
            "date_filed": "2025-03-24",
            "time_filed": null,
            "entry_number": null,
            "recap_sequence_number": "2025-03-24.007",
            "pacer_sequence_number": null,
            "description": "Check Received on 3/24/2025 from STATE OF NEW JERSEY. Check Number: A0014915991. Amount: $100.00. (kb3s, Deputy Clerk)",
            "tags": []
        },
        {
            "resource_uri": "https://www.courtlistener.com/api/rest/v4/docket-entries/421717985/",
            "id": 421717985,
            "docket": "https://www.courtlistener.com/api/rest/v4/dockets/69714275/",
            "recap_documents": [
                {
                    "resource_uri": "https://www.courtlistener.com/api/rest/v4/recap-documents/435726496/",
                    "id": 435726496,
                    "tags": [],
                    "absolute_url": "",
                    "date_created": "2025-04-08T09:53:36.720748-07:00",
                    "date_modified": "2025-04-14T07:10:29.126011-07:00",
                    "sha1": "",
                    "page_count": null,
                    "file_size": null,
                    "filepath_local": null,
                    "filepath_ia": "",
                    "ia_upload_failure_count": null,
                    "thumbnail": null,
                    "thumbnail_status": 0,
                    "plain_text": "",
                    "ocr_status": null,
                    "date_upload": null,
                    "document_number": "",
                    "attachment_number": null,
                    "pacer_doc_id": "",
                    "is_available": false,
                    "is_free_on_pacer": null,
                    "is_sealed": null,
                    "document_type": 1,
                    "description": "",
                    "acms_document_guid": ""
                }
            ],
            "date_created": "2025-04-08T09:53:36.711279-07:00",
            "date_modified": "2025-04-14T07:10:29.115133-07:00",
            "date_filed": "2025-03-24",
            "time_filed": null,
            "entry_number": null,
            "recap_sequence_number": "2025-03-24.006",
            "pacer_sequence_number": null,
            "description": "Check Received on 3/24/2025 from OFFICE OF THE ATTORNEY GENERAL STATE OF ILLINOIS. Check Number: 3442. Amount: $100.00. (kb3s, Deputy Clerk)",
            "tags": []
        },
        {
            "resource_uri": "https://www.courtlistener.com/api/rest/v4/docket-entries/421717984/",
            "id": 421717984,
            "docket": "https://www.courtlistener.com/api/rest/v4/dockets/69714275/",
            "recap_documents": [
                {
                    "resource_uri": "https://www.courtlistener.com/api/rest/v4/recap-documents/435726495/",
                    "id": 435726495,
                    "tags": [],
                    "absolute_url": "",
                    "date_created": "2025-04-08T09:53:36.698431-07:00",
                    "date_modified": "2025-04-14T07:10:29.105317-07:00",
                    "sha1": "",
                    "page_count": null,
                    "file_size": null,
                    "filepath_local": null,
                    "filepath_ia": "",
                    "ia_upload_failure_count": null,
                    "thumbnail": null,
                    "thumbnail_status": 0,
                    "plain_text": "",
                    "ocr_status": null,
                    "date_upload": null,
                    "document_number": "",
                    "attachment_number": null,
                    "pacer_doc_id": "",
                    "is_available": false,
                    "is_free_on_pacer": null,
                    "is_sealed": null,
                    "document_type": 1,
                    "description": "",
                    "acms_document_guid": ""
                }
            ],
            "date_created": "2025-04-08T09:53:36.689468-07:00",
            "date_modified": "2025-04-14T07:10:29.095202-07:00",
            "date_filed": "2025-03-24",
            "time_filed": null,
            "entry_number": null,
            "recap_sequence_number": "2025-03-24.005",
            "pacer_sequence_number": null,
            "description": "Check Received on 3/24/2025 from THE COMMONWEALTH OF MASSACHUSETTS ATTORNEY GENERALS OFFICE. Check Number: 1233. Amount: $100.00. (kb3s, Deputy Clerk)",
            "tags": []
        },
        {
            "resource_uri": "https://www.courtlistener.com/api/rest/v4/docket-entries/421717981/",
            "id": 421717981,
            "docket": "https://www.courtlistener.com/api/rest/v4/dockets/69714275/",
            "recap_documents": [
                {
                    "resource_uri": "https://www.courtlistener.com/api/rest/v4/recap-documents/435726492/",
                    "id": 435726492,
                    "tags": [],
                    "absolute_url": "",
                    "date_created": "2025-04-08T09:53:36.118739-07:00",
                    "date_modified": "2025-04-14T07:10:28.549325-07:00",
                    "sha1": "",
                    "page_count": null,
                    "file_size": null,
                    "filepath_local": null,
                    "filepath_ia": "",
                    "ia_upload_failure_count": null,
                    "thumbnail": null,
                    "thumbnail_status": 0,
                    "plain_text": "",
                    "ocr_status": null,
                    "date_upload": null,
                    "document_number": "",
                    "attachment_number": null,
                    "pacer_doc_id": "",
                    "is_available": false,
                    "is_free_on_pacer": null,
                    "is_sealed": null,
                    "document_type": 1,
                    "description": "",
                    "acms_document_guid": ""
                }
            ],
            "date_created": "2025-04-08T09:53:36.109573-07:00",
            "date_modified": "2025-04-14T07:10:28.539502-07:00",
            "date_filed": "2025-03-20",
            "time_filed": null,
            "entry_number": null,
            "recap_sequence_number": "2025-03-20.003",
            "pacer_sequence_number": null,
            "description": "Check Received on 3/20/2025 from STATE OF MICHIGAN DEPARTMENT OF ATTORNEY GENERAL. Check Number: 510209094. Amount: $100. (bg3s, Deputy Clerk)",
            "tags": []
        },
        {
            "resource_uri": "https://www.courtlistener.com/api/rest/v4/docket-entries/421717980/",
            "id": 421717980,
            "docket": "https://www.courtlistener.com/api/rest/v4/dockets/69714275/",
            "recap_documents": [
                {
                    "resource_uri": "https://www.courtlistener.com/api/rest/v4/recap-documents/435726491/",
                    "id": 435726491,
                    "tags": [],
                    "absolute_url": "",
                    "date_created": "2025-04-08T09:53:36.096392-07:00",
                    "date_modified": "2025-04-14T07:10:28.528680-07:00",
                    "sha1": "",
                    "page_count": null,
                    "file_size": null,
                    "filepath_local": null,
                    "filepath_ia": "",
                    "ia_upload_failure_count": null,
                    "thumbnail": null,
                    "thumbnail_status": 0,
                    "plain_text": "",
                    "ocr_status": null,
                    "date_upload": null,
                    "document_number": "",
                    "attachment_number": null,
                    "pacer_doc_id": "",
                    "is_available": false,
                    "is_free_on_pacer": null,
                    "is_sealed": null,
                    "document_type": 1,
                    "description": "",
                    "acms_document_guid": ""
                }
            ],
            "date_created": "2025-04-08T09:53:36.088002-07:00",
            "date_modified": "2025-04-14T07:10:28.518659-07:00",
            "date_filed": "2025-03-20",
            "time_filed": null,
            "entry_number": null,
            "recap_sequence_number": "2025-03-20.002",
            "pacer_sequence_number": null,
            "description": "Check Received on 3/20/2025 from OFFICE OF THE ATTORNEY GENERAL CONNECTICUT. Check Number: 14098. Amount: $100. (bg3s, Deputy Clerk)",
            "tags": []
        },
        {
            "resource_uri": "https://www.courtlistener.com/api/rest/v4/docket-entries/421717979/",
            "id": 421717979,
            "docket": "https://www.courtlistener.com/api/rest/v4/dockets/69714275/",
            "recap_documents": [
                {
                    "resource_uri": "https://www.courtlistener.com/api/rest/v4/recap-documents/435726490/",
                    "id": 435726490,
                    "tags": [],
                    "absolute_url": "",
                    "date_created": "2025-04-08T09:53:36.050476-07:00",
                    "date_modified": "2025-04-14T07:10:28.486367-07:00",
                    "sha1": "",
                    "page_count": null,
                    "file_size": null,
                    "filepath_local": null,
                    "filepath_ia": "",
                    "ia_upload_failure_count": null,
                    "thumbnail": null,
                    "thumbnail_status": 0,
                    "plain_text": "",
                    "ocr_status": null,
                    "date_upload": null,
                    "document_number": "",
                    "attachment_number": null,
                    "pacer_doc_id": "",
                    "is_available": false,
                    "is_free_on_pacer": null,
                    "is_sealed": null,
                    "document_type": 1,
                    "description": "",
                    "acms_document_guid": ""
                }
            ],
            "date_created": "2025-04-08T09:53:36.041016-07:00",
            "date_modified": "2025-04-14T07:10:28.476798-07:00",
            "date_filed": "2025-03-19",
            "time_filed": null,
            "entry_number": null,
            "recap_sequence_number": "2025-03-19.005",
            "pacer_sequence_number": null,
            "description": "Check Received on 3/19/2025 from STATE OF HAWAII OFFICE OF ATTORNEY GENERAL. Check Number: 1362. Amount: $100.00. (hmls, Deputy Clerk)",
            "tags": []
        },
        {
            "resource_uri": "https://www.courtlistener.com/api/rest/v4/docket-entries/421717978/",
            "id": 421717978,
            "docket": "https://www.courtlistener.com/api/rest/v4/dockets/69714275/",
            "recap_documents": [
                {
                    "resource_uri": "https://www.courtlistener.com/api/rest/v4/recap-documents/435726489/",
                    "id": 435726489,
                    "tags": [],
                    "absolute_url": "",
                    "date_created": "2025-04-08T09:53:36.029347-07:00",
                    "date_modified": "2025-04-14T07:10:28.470497-07:00",
                    "sha1": "",
                    "page_count": null,
                    "file_size": null,
                    "filepath_local": null,
                    "filepath_ia": "",
                    "ia_upload_failure_count": null,
                    "thumbnail": null,
                    "thumbnail_status": 0,
                    "plain_text": "",
                    "ocr_status": null,
                    "date_upload": null,
                    "document_number": "",
                    "attachment_number": null,
                    "pacer_doc_id": "",
                    "is_available": false,
                    "is_free_on_pacer": null,
                    "is_sealed": null,
                    "document_type": 1,
                    "description": "",
                    "acms_document_guid": ""
                }
            ],
            "date_created": "2025-04-08T09:53:36.019546-07:00",
            "date_modified": "2025-04-14T07:10:28.460566-07:00",
            "date_filed": "2025-03-19",
            "time_filed": null,
            "entry_number": null,
            "recap_sequence_number": "2025-03-19.004",
            "pacer_sequence_number": null,
            "description": "Check Received on 3/19/2025 from STATE OF OREGON DEPARTMENT OF JUSTICE. Check Number: 122767. Amount: $100.00. (hmls, Deputy Clerk)",
            "tags": []
        },
        {
            "resource_uri": "https://www.courtlistener.com/api/rest/v4/docket-entries/421717977/",
            "id": 421717977,
            "docket": "https://www.courtlistener.com/api/rest/v4/dockets/69714275/",
            "recap_documents": [
                {
                    "resource_uri": "https://www.courtlistener.com/api/rest/v4/recap-documents/435726488/",
                    "id": 435726488,
                    "tags": [],
                    "absolute_url": "",
                    "date_created": "2025-04-08T09:53:36.003764-07:00",
                    "date_modified": "2025-04-14T07:10:28.447490-07:00",
                    "sha1": "",
                    "page_count": null,
                    "file_size": null,
                    "filepath_local": null,
                    "filepath_ia": "",
                    "ia_upload_failure_count": null,
                    "thumbnail": null,
                    "thumbnail_status": 0,
                    "plain_text": "",
                    "ocr_status": null,
                    "date_upload": null,
                    "document_number": "",
                    "attachment_number": null,
                    "pacer_doc_id": "",
                    "is_available": false,
                    "is_free_on_pacer": null,
                    "is_sealed": null,
                    "document_type": 1,
                    "description": "",
                    "acms_document_guid": ""
                }
            ],
            "date_created": "2025-04-08T09:53:35.994399-07:00",
            "date_modified": "2025-04-14T07:10:28.436459-07:00",
            "date_filed": "2025-03-19",
            "time_filed": null,
            "entry_number": null,
            "recap_sequence_number": "2025-03-19.003",
            "pacer_sequence_number": null,
            "description": "Check Received on 3/19/2025 from MINNESOTA OFFICE OF THE ATTORNEY GENERAL. Check Number: 5138. Amount: $100.00. (hmls, Deputy Clerk)",
            "tags": []
        },
        {
            "resource_uri": "https://www.courtlistener.com/api/rest/v4/docket-entries/421688866/",
            "id": 421688866,
            "docket": "https://www.courtlistener.com/api/rest/v4/dockets/69714275/",
            "recap_documents": [
                {
                    "resource_uri": "https://www.courtlistener.com/api/rest/v4/recap-documents/435696805/",
                    "id": 435696805,
                    "tags": [],
                    "absolute_url": "/docket/69714275/135/state-of-maryland-v-united-states-department-of-agriculture/",
                    "date_created": "2025-04-08T06:47:01.620279-07:00",
                    "date_modified": "2025-04-14T07:10:30.177329-07:00",
                    "sha1": "a67e04a8d7ebe2a948d0de45bd4d7999b411c239",
                    "page_count": 2,
                    "file_size": 1962161,
                    "filepath_local": "recap/gov.uscourts.mdd.578045/gov.uscourts.mdd.578045.135.0_1.pdf",
                    "filepath_ia": "https://archive.org/download/gov.uscourts.mdd.578045/gov.uscourts.mdd.578045.135.0.pdf",
                    "ia_upload_failure_count": null,
                    "thumbnail": "recap-thumbnails/gov.uscourts.mdd.578045/435696805.thumb.1068.png",
                    "thumbnail_status": 1,
                    "plain_text": "Case 1:25-cv-00748-JKB Document135 Filed 04/07/25 Pagelof2\n\nElizabeth R. Smith\n\n5106 Bradley Blvd\n\nChevy Chase, MD 20815\n\n(646) 245-8738 ~\nEliz.reed.smith@gmail.com . ws\n\nThe Honorable James K. Bredar\nU.S. District Court for the District of Maryland\n101 W. Lombard Street Chambers 5A\n\nBaltimore, MD 21201\nMarch 27, 2025\n~ Subject: Notice of Non-Reinstatement Following Mass Terminations at the Department of\nDefense\nDear Judge Bredar,\n\nI am writing to inform you that I was terminated from my probationary position as an Oversight\nEditor at the Department of the Army’s Office of the Inspector General (DAIG) on Friday,\nFebruary 21, 2025, have yet to be reinstated or placed on administrative leave.\n\nI have received no communication from the DoD, including a notice per your request for names\nof terminated employees who have not been reinstated after the ruling my firing was illegal.\n\nAs one of the highest paid employees in my unit I was terminated using my probationary status\nto illegally achieve the goals of a Reduction-in-Force. My termination letter stated, “this action is\nin accordance with Title 5, Code of Federal Regulations (CFR), Part 315, Subpart H, to promote\n“the efficiency of service.” >\n\nThe above regulation applies to competitive positions, but my position was in the excepted\nservice. Also, the referenced regulation has no requirement to, “promote the efficiency of\n\n_ service.” These errors strongly indicate my termination was in no way about performance but\nwas rushed through using a template document provided by the Office of Personnel Management\n(OPM) to follow an illegal diktat from OPM.\n\ni\n\nIn addition to others at DAIG, my termination was part of “light firings” of other probationary\nemployees across the agency that took place at the DoD since Feb 21. I know employees in this\ncategory have been reinstated at DoD and at other agencies at issue in recent weeks.\n\nBased on conversations in the office of my direct employer prior to Feb 21, it was widely\nunderstood that DAIG had been ordered to do a budget reduction of 25% and was scrambling to\ncut its work of probationary employees, of which it has very few.\n\n\fCase 1:25-cv-00748-JKB Document135 Filed 04/07/25 Page 2of2\n\n“ ‘am submitting: this. letter considering your recent order regarding lists of terminated employees\n“Wiio have not béerifeinstated. I would greatly appreciate any assistance in my reinstatement.\n\non\n\nMonon\n\nSinteely,\nMe Ne ”\n\ntu :33 Elizabeth R. Smith *¥!\n\n",
                    "ocr_status": 1,
                    "date_upload": "2025-04-08T06:48:34.266274-07:00",
                    "document_number": "135",
                    "attachment_number": null,
                    "pacer_doc_id": "093014777673",
                    "is_available": true,
                    "is_free_on_pacer": null,
                    "is_sealed": null,
                    "document_type": 1,
                    "description": "Order",
                    "acms_document_guid": ""
                },
                {
                    "resource_uri": "https://www.courtlistener.com/api/rest/v4/recap-documents/435696820/",
                    "id": 435696820,
                    "tags": [],
                    "absolute_url": "/docket/69714275/135/1/state-of-maryland-v-united-states-department-of-agriculture/",
                    "date_created": "2025-04-08T06:48:23.665855-07:00",
                    "date_modified": "2025-04-09T02:32:32.512523-07:00",
                    "sha1": "1c4e4ff430551e2095cd00818cd966285a2a9739",
                    "page_count": 1,
                    "file_size": 1121744,
                    "filepath_local": "recap/gov.uscourts.mdd.578045/gov.uscourts.mdd.578045.135.1_1.pdf",
                    "filepath_ia": "https://archive.org/download/gov.uscourts.mdd.578045/gov.uscourts.mdd.578045.135.1.pdf",
                    "ia_upload_failure_count": null,
                    "thumbnail": null,
                    "thumbnail_status": 0,
                    "plain_text": "Case 1:25-cv-00748-JKB Document135-1 Filed 04/07/25 Page1of1\n\nUNITED STATES DISTRICT COURT\n\nDISTRICT OF MARYLAND\nOFFICE OF THE CLERK\n\nCatherine M. Stavlas, Clerk of Court\nReply to Northern Division Address David E. Ciambruschini, Chief Deputy\n\nApril 1, 2025\n\nElizabeth R. Smith\n5106 Bradley Blvd.\nChevy Chase, MD 20815\nRe: Case No. 1:25-cv-00748-JKB\nDear Counsel/Party:\n\nThe Clerk received your Notice of Non-Reinstatement on March 31, 2025; however, it is\ndeficient in the area(s) checked below and is being returned to you.\n\nNoncompliance with L.R. 101 or 102 Noncompliance with L.R. 102 and FRCivP 5\n() Member of bar has not signed the document. (1 Certificate of service not affixed to document.\nC] Business entities other than sole () Certificate of service not dated and/or not\nproprietorships must be represented by signed.\ncounsel.\nNoncompliance with L.R. 104 or 105 Miscellaneous\n\n() Discovery materials should not be filed unless [) Document does not contain original signature.\nin support of a motion or by court order.\n\n(Discovery motion filed contrary to L.R. 104.7. [] Document relates to more than one file.\nOriginal and appropriate copies are required\n\n[] Motion to compel filed contrary to L.R. 104.8. for each file unless the cases have been\nconsolidated for all purposes.\n\n[] Offer of judgment should not be filed with the\n\nCourt until it has been accepted. Fed. R. Civ.\n\nP. 68.\nOther: Elizabeth Smith is not a party to the\ncase.\nZL) dle 4 [ 25\nJames K. Bredar Date\n\nUnited States District Judge\n\ncc: Other counsel/party\nReturn pleading letter (Rev. 02/2011)\n\nNorthern Division * 4228 U.S. Courthouse * 101 W. Lombard Street * Baltimore, Maryland 21201+ 410-962-2600\nSouthern Division * 200 U.S. Courthouse * 6500 Cherrywood Lane « Greenbelt, Maryland 20770 * 301-344-0660\n\nVisit the U.S. District Court's Website at www.mdd.uscourts.gov\n\n",
                    "ocr_status": 1,
                    "date_upload": "2025-04-08T06:49:33.652732-07:00",
                    "document_number": "135",
                    "attachment_number": 1,
                    "pacer_doc_id": "093014777674",
                    "is_available": true,
                    "is_free_on_pacer": null,
                    "is_sealed": null,
                    "document_type": 2,
                    "description": "Return Document",
                    "acms_document_guid": ""
                }
            ],
            "date_created": "2025-04-08T06:47:01.588176-07:00",
            "date_modified": "2025-04-14T07:10:30.165391-07:00",
            "date_filed": "2025-04-07",
            "time_filed": null,
            "entry_number": 135,
            "recap_sequence_number": "2025-04-07.001",
            "pacer_sequence_number": 585,
            "description": "RETURN DOCUMENT ORDER. Signed by Judge James K Bredar on 4/1/2025. (Attachments: # 1 Return Document)(kb3s, Deputy Clerk) (Entered: 04/07/2025)",
            "tags": []
        },
        {
            "resource_uri": "https://www.courtlistener.com/api/rest/v4/docket-entries/421409314/",
            "id": 421409314,
            "docket": "https://www.courtlistener.com/api/rest/v4/dockets/69714275/",
            "recap_documents": [
                {
                    "resource_uri": "https://www.courtlistener.com/api/rest/v4/recap-documents/435408440/",
                    "id": 435408440,
                    "tags": [],
                    "absolute_url": "/docket/69714275/134/state-of-maryland-v-united-states-department-of-agriculture/",
                    "date_created": "2025-04-04T08:46:06.787475-07:00",
                    "date_modified": "2025-04-14T07:10:30.151545-07:00",
                    "sha1": "383e828fce451538ebe0a1fa070ad92242b87cd3",
                    "page_count": 5,
                    "file_size": 3256693,
                    "filepath_local": "recap/gov.uscourts.mdd.578045/gov.uscourts.mdd.578045.134.0.pdf",
                    "filepath_ia": "https://archive.org/download/gov.uscourts.mdd.578045/gov.uscourts.mdd.578045.134.0.pdf",
                    "ia_upload_failure_count": null,
                    "thumbnail": "recap-thumbnails/gov.uscourts.mdd.578045/435408440.thumb.1068.png",
                    "thumbnail_status": 1,
                    "plain_text": "Case 1:25-cv-00748-JKB Document134 Filed 04/04/25 Pagelof5\n\nIN THE UNITED STATES DISTRICT COURT\nFOR THE DISTRICT OF MARYLAND\n\nSTATE OF MARYLAND, et al., *\nPlaintiffs, *\nVv. = CIVIL NO. JKB-25-0748\n\nUNITED STATES DEPARTMENT OF *\nAGRICULTURE, et al.,\n\nDefendants.\n\n* * * * * * * * * * * *\n\nMEMORANDUM AND ORDER\n\nOn April 1, 2025, the Court issued a Preliminary Injunction Order pursuant to Federal Rule\nof Civil Procedure 65 and 5 U.S.C. § 705 that, inter alia, stayed the Government’s recent\nterminations of federal probationary employees and enjoined the Government from conducting\nfuture reductions in force (“RIFs”) except in accordance with the law. (ECF No. 126.) The\nfollowing day, the Government filed a Notice of Appeal. (ECF No. 127.) The appeal was docketed\nwith the United States Court of Appeals for the Fourth Circuit under case number 25-1338. (ECF\nNo. 129). The appeal has been consolidated with case number 25-1248 (which pertains to the\nGovernment’s appeal of the Court’s earlier Temporary Restraining Order (“TRO”), ECF No. 44),\nwith case number 25-1248 being the lead case. (ECF No. 130.)\n\nNow pending before the Court is the Government’s Motion to Stay Preliminary Injunction\nPending Appeal (the “Motion to Stay”), which the Government filed yesterday evening, April 3.\n(ECF No. 131.) Today, April 4, the Plaintiff States filed their opposition. (ECF No. 133.) The\nGovernment requests that the Court issue its ruling by 2:00 p.m. (ECF No. 131 at 1.) The Motion\n\nto Stay will be denied.\n\fCase 1:25-cv-00748-JKB Document134 Filed 04/04/25 Page2of5\n\nBefore turning to the merits of the Motion to Stay, the Court begins with the question of\njurisdiction. See Whitaker v. Monroe Staffing Servs., LLC, 42 F.4th 200, 206 (4th Cir. 2022). “The\nfiling of a notice of appeal is an event of jurisdictional significance—it confers jurisdiction on the\ncourt of appeals and divests the district court of its control over those aspects of the case involved\nin the appeal.” Griggs v. Provident Consumer Disc. Co., 459 U.S. 56, 58 (1982). However, this\ngeneral rule has some “limited exceptions . . . confined to a narrow class of actions that promote\njudicial efficiency and facilitate the division of labor between trial and appellate courts.” Doe v.\nPub. Citizen, 749 F.3d 246, 258 (2014). One such exception comes in the form of Federal Rule of\nCivil Procedure 62(d), which permits a court to “suspend, modify, restore, or grant an injunction\non terms for bond or other terms that secure the opposing party’s rights” while an interlocutory\nappeal is pending.' This rule authorizes a district court to stay its injunction pending appeal, “even\nafter notice of the appeal has been filed.” 11 Charles Alan Wright & Arthur R. Miller, Federal\nPractice & Procedure § 2904 (3d ed. 2024) (collecting cases).\n\nSatisfied that it has jurisdiction to consider the Motion to Stay, the Court turns to the\nrelevant standards. In its TRO Memorandum, the Court reviewed the standards for staying a ruling\npending appeal:\n\nIn deciding whether to issue a stay pending appeal, the Court considers: (1) whether\n\nthe stay applicant has made a strong showing that he is likely to succeed on the\n\nmerits; (2) whether the applicant will be irreparably injured absent a stay; (3)\n\nwhether issuance of the stay will substantially injure the other parties interested in\n\nthe proceeding; and (4) where the public interest lies.\n\n(ECF No. 43 at 55 (quoting Nken v. Holder, 556 U.S. 418, 434 (2009).) As the Court explained,\n\nthese overlap with the factors that a court considers in deciding whether to grant a preliminary\n\ninjunction under Winter v. Natural Resources Defense Council, 555 U.S. 7 (2008). As a result,\n\n' The bond requirement is waived when the party seeking the stay is the United States. Fed. R. Civ. P.\n65(e).\n\fCase 1:25-cv-00748-JKB Document134 Filed 04/04/25 Page 3of5\n\n“Tilt is generally logically inconsistent for a court to issue a... preliminary injunction and then\nstay that order, as the findings on which those decisions are premised are almost perfect opposites.”\n(ECF No. 43 at 55.)\n\nThe Government contends that, in this context, the Court need not change its mind as to\nthe correctness of its prior ruling; it need merely determine whether “the Defendant’s appeal\npresents an admittedly difficult legal question.” (ECF No. 131-1 at 3 (quoting United States v.\nMosby, Crim. No. LKG-22-00007, 2024 WL 3877613, at *3 (D. Md. Aug. 20, 2024).) The Court\nagrees that this approach makes good sense; otherwise, a district court would never stay an order\npending appeal, as “every court that renders a judgment does so in the belief that its judgment is\nthe correct one.” Woollard v. Sheridan, 863 F. Supp. 2d 462, 477 (D. Md. 2012), rev'd on other\ngrounds sub nom. Woollard v. Gallagher, 712 F.3d 865 (4th Cir. 2013).\n\nHowever, even under the less demanding “admittedly difficult legal question” standard,\nthe Government falls short. The Court is well aware, of course, that the questions presented in this\ncase are complex and involve issues of first impression. But in its Motion to Stay, the Government\nsimply rehashes the same arguments that the Court considered in detail and rejected in the\nMemorandum accompanying the Preliminary Injunction Order. (See generally ECF No. 125)\nThe Government does not provide any reason to revisit those conclusions; indeed, the Government\ndoes not even engage with the Court’s analysis in any meaningful way. For example, the\nGovernment contends that “Defendants demonstrated that Plaintiffs’ claimed ‘statutory right of\nnotice’ alone failed to support an ‘informational injury’ that suffices as an injury-in-fact for\nstanding.” (ECF No. 131-1 at 3.) The Government seems to ignore the lengthy discussion in the\nCourt’s Preliminary Injunction Memorandum on this exact issue, in which the Court explained\n\nthat it “would be unwilling to accept” a theory of standing based solely on a violation of a statutory\n\fCase 1:25-cv-00748-JKB Document134 Filed 04/04/25 Page4of5\n\nright, and that instead a plaintiff claiming an informational injury must show denial of information\nto which they were entitled plus cognizable downstream harms—a requirement that the Court\nfound the States had amply satisfied. (See ECF No. 125 at 18-25.) The Government’s other\narguments are all in a similar vein, repeating arguments that the Court has already considered (in\nmany cases, twice, at both the TRO and Preliminary Injunction stages), without even cursorily\npointing out where, specifically, it believes this Court erred in its analysis. Thus, for the reasons\nstated in both the TRO Memorandum and the Preliminary Injunction Memorandum, the Court\nconcludes that the Government has not identified an “admittedly difficult legal question” on which\nthe Court may have erred, Ict alone a strong likelihood of success.\n\nMost significantly, even assuming that the Government has identified an “admittedly\ndifficult legal question,” and assuming further that this showing would suffice to satisfy the first\nstay factor under Nken, the Court would stil] deny the Government’s request. The Government\nprotests that the Court’s order is “extraordinarily burdensome.” (ECF No. 131-1 at 5.) The Court\ndoes not doubt this, and indeed explicitly acknowledged as much in its Preliminary Injunction\nMemorandum, while nevertheless stating that “the Government cannot engage in far-reaching\nillegal activity and then complain that the remedy is too burdensome.” (ECF No. 125 at 68.)\nMoreover, while the Court continues to recognize the considerable public interests that favor the\nGovernment’s position, it also continues to hold that those interests are outweighed by the public\ninterest in complying with lawful RIF notice procedures and by the magnitude of the harms\nimposed on the States in the absence of immediate injunctive relief.\n\nAs the Court’s Memorandum makes clear, it has not taken the prospect of issuing a\npreliminary injunction against the Government lightly. Courts must respect the limits of their\n\nauthority and must be especially cautious when enjoining the activities of a coequal coordinate\n\fCase 1:25-cv-00748-JKB Document134 Filed 04/04/25 Page5of5\n\nbranch of government. But, in our federal system, other actors, such as these Plaintiff States, are\nentitled to seek redress in court—including, in extraordinary circumstances, by obtaining\npreliminary injunctive relief against the federal government. The Court took pains to ensure that\nthe injunction it crafted was no more burdensome to the Government than necessary to redress the\nirreparable harms faced by the Plaintiff States. But the care that the Court took in limiting the\nscope of relief should not be equated with any doubt in the Court’s mind about the necessity of the\nrelief it ordered. That relicf was necessary on April 1, and it remains so today.\n\nFor these reasons, and for those stated in the Court’s Preliminary Injunction Memorandum,\n\n(ECF No. 125), it is ORDERED that the Motion to Stay, (ECF No. 131), is DENIED.\n\nDated this 4-day of April, 2025at_ /fi22 A.M., ERT.\n\nBY THE COURT:\n\nJames K. Bredar\nUnited States District Judge\n\n",
                    "ocr_status": 1,
                    "date_upload": "2025-04-04T08:47:38.163629-07:00",
                    "document_number": "134",
                    "attachment_number": null,
                    "pacer_doc_id": "093014774590",
                    "is_available": true,
                    "is_free_on_pacer": true,
                    "is_sealed": null,
                    "document_type": 1,
                    "description": "Memorandum and Order",
                    "acms_document_guid": ""
                }
            ],
            "date_created": "2025-04-04T08:46:06.774652-07:00",
            "date_modified": "2025-04-14T07:10:30.142238-07:00",
            "date_filed": "2025-04-04",
            "time_filed": null,
            "entry_number": 134,
            "recap_sequence_number": "2025-04-04.002",
            "pacer_sequence_number": 582,
            "description": "MEMORANDUM AND ORDER denying 131 MOTION to Stay re 126 Order on Motion for Preliminary Injunction, Pending Appeal. Signed by Judge James K Bredar on 4/4/2025. (kb3s, Deputy Clerk) (Entered: 04/04/2025)",
            "tags": []
        },
        {
            "resource_uri": "https://www.courtlistener.com/api/rest/v4/docket-entries/421409313/",
            "id": 421409313,
            "docket": "https://www.courtlistener.com/api/rest/v4/dockets/69714275/",
            "recap_documents": [
                {
                    "resource_uri": "https://www.courtlistener.com/api/rest/v4/recap-documents/435408439/",
                    "id": 435408439,
                    "tags": [],
                    "absolute_url": "/docket/69714275/133/state-of-maryland-v-united-states-department-of-agriculture/",
                    "date_created": "2025-04-04T08:46:06.762036-07:00",
                    "date_modified": "2025-04-14T07:10:30.129184-07:00",
                    "sha1": "ca69ffb8a0d18b802c257162e51553387d1cddec",
                    "page_count": 8,
                    "file_size": 688939,
                    "filepath_local": "recap/gov.uscourts.mdd.578045/gov.uscourts.mdd.578045.133.0.pdf",
                    "filepath_ia": "https://archive.org/download/gov.uscourts.mdd.578045/gov.uscourts.mdd.578045.133.0.pdf",
                    "ia_upload_failure_count": null,
                    "thumbnail": "recap-thumbnails/gov.uscourts.mdd.578045/435408439.thumb.1068.png",
                    "thumbnail_status": 1,
                    "plain_text": "       Case 1:25-cv-00748-JKB            Document 133               Filed 04/04/25   Page 1 of 8\n\n\n\n                          THE UNITED STATES DISTRICT COURT\n                           FOR THE DISTRICT OF MARYLAND\n                                        *\nSTATE OF MARYLAND, et al.,\n                                                *\n                       Plaintiffs,\n                                                *\n               v.\n                                                            No. 1:25-cv-00748-JKB\n                                                *\n\nUNITED STATES DEPARTMENT OF                     *\nAGRICULTURE, et al.,\n                       Defendants.\n\n        *      *      *       *      *      *           *       *       *     *      *    *\n\n\n            PLAINTIFFS’ OPPOSITION TO DEFENDANTS’ MOTION TO STAY\n                   PRELIMINARY INJUNCTION PENDING APPEAL\n\n       The Court should deny Defendants’ motion to stay the Court’s preliminary injunction\n\norder. The Court determined that Defendants undertook reductions in force (RIFs) without\n\nfollowing procedures required by law, causing irreparable harm to the Plaintiff States, and that\n\ninjunctive relief was warranted to forestall harm to the Plaintiff States while this litigation\n\nproceeds. As the Court observed in granting a temporary restraining order (TRO), “[i]t is generally\n\nlogically inconsistent for a court to issue a TRO or preliminary injunction and then stay that order,\n\nas the findings on which those decisions are premised are almost perfect opposites.” ECF 43 at\n\n53. Defendants’ stay motion rehashes the same arguments they made in opposing Plaintiffs’\n\nmotion for a preliminary injunction. For the same reasons Plaintiffs previously articulated, see\n\nECF 78-1, these arguments fail. The Court rightly rejected them only days ago on the same record\n\nbefore the Court now. See ECF 125. Defendants have not carried their burden of showing that a\n\ndiscretionary stay is warranted.\n\n\n\n\n                                                    1\n\f        Case 1:25-cv-00748-JKB          Document 133        Filed 04/04/25      Page 2 of 8\n\n\n\n                                          ARGUMENT\n\n        A stay pending appeal is “an exercise of judicial discretion,” and not a “matter of right.”\n\nNken v. Holder, 556 U.S. 418, 433 (2009) (quoting Virginia R. Co. v. United States, 272 U.S. 658,\n\n672 (1926)). Indeed, “a stay is considered ‘extraordinary relief’ for which the moving party bears\n\na ‘heavy burden.’” Common Cause v. Rucho, 284 F. Supp. 3d 780, 783 (M.D.N.C. 2018). A party\n\nseeking a stay must demonstrate (1) “a strong showing that [it] is likely to succeed on the merits,”\n\n(2) irreparable injury absent a stay; (3) that issuance of a stay will not substantially injure other\n\nparties interested in the proceedings, and (4) that the public interest favors a stay. Nken, 556 U.S.\n\nat 433-35 (quoting Hilton v. Braunskill, 481 U.S. 770, 776 (1987)). The first two factors are most\n\nimportant, and it is not enough to show a “better than negligible” chance of success on the merits\n\nor a mere “possibility of irreparable injury.” Id. at 434. Defendants fail each prong, and their\n\nmotion should be denied.\n\n   I.      Defendants Are Not Likely to Succeed on the Merits.\n\n        In granting the preliminary injunction motion, the Court found that the Plaintiffs States are\n\nlikely to succeed on the merits. ECF 125 at 39-64. Defendants advance no new justiciability or\n\nmerits arguments and offer no new evidence that might undercut the Court’s conclusion.\n\n        Defendants have not established that the Court erred in concluding that “there is no\n\njusticiability defect that would divest it of jurisdiction over this action.” ECF 125 at 10. With\n\nrespect to standing, the Court reviewed in detail the record evidence establishing that Plaintiffs\n\nhave suffered informational injuries and follow-on downstream harms stemming from the\n\ninformational deficit. ECF 125 at 12-27. The Court also explained that Plaintiffs’ injuries are\n\ntraceable to Defendants and that Plaintiffs’ injuries would be redressed by an order of the Court\n\nbarring Defendants from conducting unlawful RIFs and restoring unlawfully terminated\n\n\n\n\n                                                 2\n\f         Case 1:25-cv-00748-JKB            Document 133    Filed 04/04/25     Page 3 of 8\n\n\n\nemployees to their positions. ECF 125 at 27-29. With respect to Defendants’ contention that\n\nCongress divested the Court of jurisdiction over Plaintiffs’ claims, the Court applied the\n\nframework set out in Thunder Basin Coal Co. v. Reich, 510 U.S. 200 (1994), and correctly rejected\n\nthose arguments. ECF 125 at 33-39.\n\n         Defendants likewise recycle their merits argument that their mass terminations of more\n\nthan 24,000 probationary employees over the course of a few weeks without individualized\n\nconsideration were not RIFs. The Court considered and rejected this argument too, explaining that\n\neven Defendants’ own briefing indicates that the terminations were RIFs. ECF 125 at 42-52.\n\nDefendants offer no reason why the Court should reverse these findings now.\n\n         The closest Defendants come to a new argument is their contention that a stay would be\n\nwarranted if the issues before the Court present “an admittedly difficult legal question.” ECF 131-\n\n1 at 3. But Defendants fail to square that standard with the requirement that they must also show\n\na “strong” likelihood of success on the merits. Nken, 556 U.S. at 434. In any event, Defendants\n\nhave not raised any “admittedly difficult legal questions,” let alone one that the Court did not\n\nresolve decisively in Plaintiffs’ favor.\n\n         Because Defendants’ arguments are duplicative of those raised in the preliminary\n\ninjunction briefing and that the Court has already rejected, Defendants have failed to make a\n\n“strong showing” that they are likely to prevail. Nken, 556 U.S. at 434.\n\n   II.      Defendants Have Not Shown That Equitable Factors Favor a Stay.\n\n         Similarly, Defendants have not shown an entitlement to relief under the remaining three\n\nstay factors. Defendants insist that the Court has “interfere[d] in the Federal government’s\n\nrelationship with its workforce” and that the preliminary remedy is overly burdensome. But\n\nDefendants ignore that, as the Court explained, “the Government cannot engage in far-reaching\n\n\n\n\n                                                  3\n\f       Case 1:25-cv-00748-JKB              Document 133    Filed 04/04/25      Page 4 of 8\n\n\n\nillegal activity and then complain that the remedy is too burdensome.” ECF 125 at 68. Further,\n\naccording to their March 17 status report, most Defendants have already rescinded the terminations\n\nof a majority of their probationary employees pursuant to the TRO. ECF No. 52. The preliminary\n\ninjunction merely requires those Defendants to continue maintaining these established\n\nemployment relationships during the pendency of the litigation, and with only a narrower subset\n\nof probationary employees at that. Defendants’ claimed injuries related to the preliminary\n\ninjunction are thus minimal. See League of Women Voters of N.C. v. North Carolina, 769 F.3d 224,\n\n248 (4th Cir. 2014) (finding burden on government to restore status quo was lessened because\n\nrelevant “systems have existed, do exist, and simply need to be resurrected,” and other measures\n\n“merely require[] the revival of previous practices”). Defendants likewise ignore the Court’s\n\nexplanation that, “in the absence of injunctive relief, the Government’s desired quick reduction in\n\ncosts will inevitably correspond to a surge in costs borne by the Plaintiff States in responding to\n\nthe unnoticed mass terminations.” ECF 125 at 68. As a result, Defendants fail to show that the\n\nequitable factors, including irreparable harm to Defendants, injury to other interested parties, and\n\nthe public interest warrant a stay here.\n\n\n\n\n                                                  4\n\f      Case 1:25-cv-00748-JKB          Document 133    Filed 04/04/25    Page 5 of 8\n\n\n\nApril 4, 2025                                Respectfully submitted,\n\n\n\n ANTHONY G. BROWN                            KEITH ELLISON\n Attorney General                            Attorney General\n State of Maryland                           State of Minnesota\n\n /s/ Virginia A. Williamson                  /s/ Liz Kramer\n James D. Handley, Bar No. 20299             Liz Kramer†\n Virginia A. Williamson, Bar. No. 31472      Solicitor General\n Assistant Attorneys General\n                                             445 Minnesota Street, Suite 1400\n 200 St. Paul Place                          St. Paul, Minnesota 55101-2131\n Baltimore, MD 21202                         Phone: 651-757-1059\n Phone: 410-576-6584                         Fax: 651-282-5832\n vwilliamson@oag.state.md.us                 liz.kramer@ag.state.mn.us\n\n\n\n BRIAN SCHWALB                               KRISTIN K. MAYES\n Attorney General                            Attorney General\n District of Columbia                        State of Arizona\n\n Emma Simson                                 /s/ Hayleigh S. Crawford\n Senior Counsel to the Attorney General      Hayleigh S. Crawford†\n                                             Deputy Solicitor General\n /s/ Ryan Wilson                             2005 North Central Avenue\n Ryan Wilson†                                Phoenix, Arizona 85004\n Senior Counsel                              Phone: (602) 542-3333\n                                             Hayleigh.Crawford@azag.gov\n Hannah Cole-Chu, Bar No. 20747              ACL@azag.gov\n Anne Deng†\n Pamela Disney**\n Tessa Gellerson, Bar No. 21271\n Charles Sinks, Bar No. 21185\n Cara Spencer, Bar No. 20171\n Assistant Attorneys General\n\n Office of the Attorney General for\n the District of Columbia\n 400 6th Street N.W., 10th Floor\n Washington, D.C. 20001\n (202) 230-2342\n Ryan.Wilson@dc.gov\n\n\n\n\n                                             5\n\fCase 1:25-cv-00748-JKB   Document 133   Filed 04/04/25   Page 6 of 8\n\f      Case 1:25-cv-00748-JKB         Document 133    Filed 04/04/25    Page 7 of 8\n\n\n\nKWAME RAOUL                                 ANDREA JOY CAMPBELL\nAttorney General                            Attorney General\nState of Illinois                           Commonwealth of Massachusetts\n\n/s/ Gretchen Helfrich                       /s/ Katherine Dirks\nGretchen Helfrich†                          Katherine Dirks†\nDeputy Chief                                Chief State Trial Counsel\nSpecial Litigation Bureau                   Office of the Attorney General\nOffice of the Illinois Attorney General     1 Ashburton Pl.\n115 South LaSalle Street, 35th Floor        Boston, MA 02108\nChicago, IL 60603                           617.963.2277\nTel. (312) 814-3000                         katherine.dirks@mass.gov\nGretchen.helfrich@ilag.gov\n\n\nDANA NESSEL                                 MATTHEW J. PLATKIN\nAttorney General                            Attorney General\nState of Michigan                           State of New Jersey\n\n/s/ Bryan Davis, Jr.                        /s/ Nathaniel Ilan Levy\nBryan Davis, Jr.†                           Nathaniel Ilan Levy, Bar No. 21840\nDebbie Taylor†                              Deputy Solicitor General\nAssistant Attorneys General                 25 Market Street\nDepartment of Attorney General              Trenton, NJ 08625\nLabor Division                              Phone: (862) 350-5800\n3030 W. Grand Blvd., Ste. 9-600             nathaniel.levy@njoag.gov\nDetroit, MI 48202\ndavisb47@michigan.gov\ntaylord8@michigan.gov\n(313) 456-2200\n\n\nRAÚL TORREZ                                 LETITIA JAMES\nAttorney General                            Attorney General\nState of New Mexico                         State of New York\n\n/s/ Anjana Samant                           By: /s/ Rabia Muqaddam\nAnjana Samant*                              Rabia Muqaddam†\nDeputy Counsel for Impact Litigation        Special Counsel for Federal Initiatives\nNew Mexico Department of Justice            New York Office of the Attorney General\nP.O. Drawer 1508                            28 Liberty St.\nSanta Fe, NM 87504-1508                     New York, NY 10005\n(505) 490-4060                              (929) 638-0447\nasamant@nmdoj.gov                           rabia.muqaddam@ag.ny.gov\n\nDAN RAYFIELD\n\n\n\n                                            7\n\fCase 1:25-cv-00748-JKB   Document 133   Filed 04/04/25   Page 8 of 8\n\f",
                    "ocr_status": 2,
                    "date_upload": "2025-04-04T08:59:12.278452-07:00",
                    "document_number": "133",
                    "attachment_number": null,
                    "pacer_doc_id": "093014774160",
                    "is_available": true,
                    "is_free_on_pacer": null,
                    "is_sealed": null,
                    "document_type": 1,
                    "description": "Response in Opposition to Motion",
                    "acms_document_guid": ""
                }
            ],
            "date_created": "2025-04-04T08:46:06.750619-07:00",
            "date_modified": "2025-04-14T07:10:30.120303-07:00",
            "date_filed": "2025-04-04",
            "time_filed": null,
            "entry_number": 133,
            "recap_sequence_number": "2025-04-04.001",
            "pacer_sequence_number": 579,
            "description": "RESPONSE in Opposition re 131 MOTION to Stay re 126 Order on Motion for Preliminary Injunction, Pending Appeal filed by Arizona, California, Colorado, Connecticut, Delaware, District Of Columbia, Hawaii, Illinois, Massachusetts, Minnesota, Nevada, New Jersey, New Mexico, New York, Oregon, People of the State of Michigan, Rhode Island, State of Maryland, Vermont, Wisconsin.(Williamson, Virginia) (Entered: 04/04/2025)",
            "tags": []
        }
    ]
}