[
    {
        "id": 422225124,
        "docket_id": 69714275,
        "date_filed": "2025-04-09",
        "date_modified": "2025-04-23T10:25:58.793492-07:00",
        "entry_number": 139,
        "description": "ORDER of USCA Granting the Governments motion for a stay of the preliminary injunction pending this appeal as to 46 Notice of Appeal, filed by United States Agency for International Development, United States Department of Housing and Urban Development, Charles Ezell, Howard Lutnick, United States Department of Treasury, Peter Hegseth, United States Department of Veterans Affairs, Federal Deposit Insurance Corporation, United States Department of Transportation, United States Department of Health & Human Services, Linda McMahon, Small Business Administration, Robert F. Kennedy, Jr., Consumer Financial Protection Bureau, Sean P Duffy, United States Department of Energy, Brooke Rollins, Scott Turner, Douglas A. Collins, Kelly Loefler, United States Department of Interior, Environmental Protection Agency, Scott Bessent, Douglas Burgum, Vincent Micone, Christopher Wright, Office of Personnel Management, General Services Administration, United States Department of Commerce, Lee Zeldin, Marco Rubio, United States Department of Homeland Security, National Archives and Records Administration, United States Department of Defense, Travis Hill, United States Department of Labor, United States Department of Agriculture, Kristi Noem, Stephen Ehikian, United States Department of Education, Russell Vought, 127 Notice of Interlocutory Appeal, filed by United States Agency for International Development, United States Department of Housing and Urban Development, Charles Ezell, Howard Lutnick, United States Department of Treasury, Peter Hegseth, United States Department of Veterans Affairs, Federal Deposit Insurance Corporation, United States Department of Transportation, United States Department of Health & Human Services, Linda McMahon, Small Business Administration, Robert F. Kennedy, Jr., Consumer Financial Protection Bureau, Sean P Duffy, United States Department of Energy, Brooke Rollins, Scott Turner, Douglas A. Collins, Kelly Loefler, Environmental Protection Agency, United States Department of Interior, Scott Bessent, Vincent Micone, Douglas Burgum, Christopher Wright, Office of Personnel Management, General Services Administration, United States Department of Commerce, Lee Zeldin, Marco Rubio, United States Department of Homeland Security, National Archives and Records Administration, United States Department of Defense, Travis Hill, United States Department of Labor, United States Department of Agriculture, Kristi Noem, Stephen Ehikian, United States Department of Education, Russell Vought. (slss, Deputy Clerk) (Entered: 04/11/2025)"
    },
    {
        "id": 422211990,
        "docket_id": 69714275,
        "date_filed": "2025-04-10",
        "date_modified": "2025-04-23T10:25:58.813418-07:00",
        "entry_number": 140,
        "description": "ORDER of USCA Denying the motion for and Administrative Stay as to 46 Notice of Appeal, filed by United States Agency for International Development, United States Department of Housing and Urban Development, Charles Ezell, Howard Lutnick, United States Department of Treasury, Peter Hegseth, United States Department of Veterans Affairs, Federal Deposit Insurance Corporation, United States Department of Transportation, United States Department of Health & Human Services, Linda McMahon, Small Business Administration, Robert F. Kennedy, Jr., Consumer Financial Protection Bureau, Sean P Duffy, United States Department of Energy, Brooke Rollins, Scott Turner, Douglas A. Collins, Kelly Loefler, United States Department of Interior, Environmental Protection Agency, Scott Bessent, Douglas Burgum, Vincent Micone, Christopher Wright, Office of Personnel Management, General Services Administration, United States Department of Commerce, Lee Zeldin, Marco Rubio, United States Department of Homeland Security, National Archives and Records Administration, United States Department of Defense, Travis Hill, United States Department of Labor, United States Department of Agriculture, Kristi Noem, Stephen Ehikian, United States Department of Education, Russell Vought, 127 Notice of Interlocutory Appeal, filed by United States Agency for International Development, United States Department of Housing and Urban Development, Charles Ezell, Howard Lutnick, United States Department of Treasury, Peter Hegseth, United States Department of Veterans Affairs, Federal Deposit Insurance Corporation, United States Department of Transportation, United States Department of Health & Human Services, Linda McMahon, Small Business Administration, Robert F. Kennedy, Jr., Consumer Financial Protection Bureau, Sean P Duffy, United States Department of Energy, Brooke Rollins, Scott Turner, Douglas A. Collins, Kelly Loefler, Environmental Protection Agency, United States Department of Interior, Scott Bessent, Vincent Micone, Douglas Burgum, Christopher Wright, Office of Personnel Management, General Services Administration, United States Department of Commerce, Lee Zeldin, Marco Rubio, United States Department of Homeland Security, National Archives and Records Administration, United States Department of Defense, Travis Hill, United States Department of Labor, United States Department of Agriculture, Kristi Noem, Stephen Ehikian, United States Department of Education, Russell Vought. (slss, Deputy Clerk) (Entered: 04/11/2025)"
    },
    {
        "id": 421852743,
        "docket_id": 69714275,
        "date_filed": "2025-04-09",
        "date_modified": "2025-04-23T10:25:58.774510-07:00",
        "entry_number": 138,
        "description": "(ELECTRONICALLY FILED IN ERROR)ORDER of USCA Granting the Governments motion for a stay of the preliminary injunction pending this appeal as to 46 Notice of Appeal, filed by United States Agency for International Development, United States Department of Housing and Urban Development, Charles Ezell, Howard Lutnick, United States Department of Treasury, Peter Hegseth, United States Department of Veterans Affairs, Federal Deposit Insurance Corporation, United States Department of Transportation, United States Department of Health & Human Services, Linda McMahon, Small Business Administration, Robert F. Kennedy, Jr., Consumer Financial Protection Bureau, Sean P Duffy, United States Department of Energy, Brooke Rollins, Scott Turner, Douglas A. Collins, Kelly Loefler, United States Department of Interior, Environmental Protection Agency, Scott Bessent, Douglas Burgum, Vincent Micone, Christopher Wright, Office of Personnel Management, General Services Administration, United States Department of Commerce, Lee Zeldin, Marco Rubio, United States Department of Homeland Security, National Archives and Records Administration, United States Department of Defense, Travis Hill, United States Department of Labor, United States Department of Agriculture, Kristi Noem, Stephen Ehikian, United States Department of Education, Russell Vought, 127 Notice of Interlocutory Appeal, filed by United States Agency for International Development, United States Department of Housing and Urban Development, Charles Ezell, Howard Lutnick, United States Department of Treasury, Peter Hegseth, United States Department of Veterans Affairs, Federal Deposit Insurance Corporation, United States Department of Transportation, United States Department of Health & Human Services, Linda McMahon, Small Business Administration, Robert F. Kennedy, Jr., Consumer Financial Protection Bureau, Sean P Duffy, United States Department of Energy, Brooke Rollins, Scott Turner, Douglas A. Collins, Kelly Loefler, Environmental Protection Agency, United States Department of Interior, Scott Bessent, Vincent Micone, Douglas Burgum, Christopher Wright, Office of Personnel Management, General Services Administration, United States Department of Commerce, Lee Zeldin, Marco Rubio, United States Department of Homeland Security, National Archives and Records Administration, United States Department of Defense, Travis Hill, United States Department of Labor, United States Department of Agriculture, Kristi Noem, Stephen Ehikian, United States Department of Education, Russell Vought. (slss, Deputy Clerk) Modified on 4/11/2025 (slss). (Entered: 04/09/2025)"
    },
    {
        "id": 421791366,
        "docket_id": 69714275,
        "date_filed": "2025-04-08",
        "date_modified": "2025-04-23T10:25:58.756333-07:00",
        "entry_number": 137,
        "description": "NOTICE by Scott Bessent, Douglas Burgum, Douglas A. Collins, Consumer Financial Protection Bureau, Sean P Duffy, Stephen Ehikian, Environmental Protection Agency, Charles Ezell, Federal Deposit Insurance Corporation, General Services Administration, Peter Hegseth, Travis Hill, Robert F. Kennedy, Jr, Kelly Loefler, Howard Lutnick, Linda McMahon, Vincent Micone, National Archives and Records Administration, Kristi Noem, Office of Personnel Management, Brooke Rollins, Marco Rubio, Marco Rubio, Small Business Administration, Scott Turner, United States Agency for International Development, United States Department of Agriculture, United States Department of Commerce, United States Department of Defense, United States Department of Education, United States Department of Energy, United States Department of Health & Human Services, United States Department of Homeland Security, United States Department of Housing and Urban Development, United States Department of Interior, United States Department of Labor, United States Department of Transportation, United States Department of Treasury, United States Department of Veterans Affairs, Russell Vought, Christopher Wright, Lee Zeldin re 136 Status Report,,,,, of Eratta re Enjoined Defendants' Compliance Status Report (Attachments: # 1 Errata Corrected Declaration of Jessica M. Parton)(Chasin, Steven) (Entered: 04/08/2025)"
    },
    {
        "id": 421739475,
        "docket_id": 69714275,
        "date_filed": "2025-04-08",
        "date_modified": "2025-04-23T10:25:58.737703-07:00",
        "entry_number": 136,
        "description": "STATUS REPORT Enjoined Defendants' Compliance Status Report by Scott Bessent, Douglas Burgum, Douglas A. Collins, Consumer Financial Protection Bureau, Sean P Duffy, Stephen Ehikian, Environmental Protection Agency, Charles Ezell, Federal Deposit Insurance Corporation, General Services Administration, Peter Hegseth, Travis Hill, Robert F. Kennedy, Jr, Kelly Loefler, Howard Lutnick, Linda McMahon, Vincent Micone, National Archives and Records Administration, Kristi Noem, Office of Personnel Management, Brooke Rollins, Marco Rubio, Marco Rubio, Small Business Administration, Scott Turner, United States Agency for International Development, United States Department of Agriculture, United States Department of Commerce, United States Department of Defense, United States Department of Education, United States Department of Energy, United States Department of Health & Human Services, United States Department of Homeland Security, United States Department of Housing and Urban Development, United States Department of Interior, United States Department of Labor, United States Department of Transportation, United States Department of Treasury, United States Department of Veterans Affairs, Russell Vought, Christopher Wright (Attachments: # 1 Exhibit 1)(Chasin, Steven) (Entered: 04/08/2025)"
    },
    {
        "id": 421717990,
        "docket_id": 69714275,
        "date_filed": "2025-03-27",
        "date_modified": "2025-04-23T10:25:58.318590-07:00",
        "entry_number": null,
        "description": "Check Received on 3/27/2025 from NEW MEXICO DEPARTMENT OF JUSTICE. Check Number: 29734356870. Amount: $100.00. (kb3s, Deputy Clerk)"
    },
    {
        "id": 421717989,
        "docket_id": 69714275,
        "date_filed": "2025-03-25",
        "date_modified": "2025-04-23T10:25:58.171868-07:00",
        "entry_number": null,
        "description": "Check Received on 3/25/2025 from DEPARTMENT OF JUSTICE FOR DELAWARE. Check Number: 1185. Amount: $100.00. (kb3s, Deputy Clerk)"
    },
    {
        "id": 421717988,
        "docket_id": 69714275,
        "date_filed": "2025-03-24",
        "date_modified": "2025-04-23T10:25:57.885128-07:00",
        "entry_number": null,
        "description": "Check Received on 3/24/2025 from NEVADA ATTORNEY GENERAL. Check Number: 1678. Amount: $100.00. (kb3s, Deputy Clerk)"
    },
    {
        "id": 421717987,
        "docket_id": 69714275,
        "date_filed": "2025-03-24",
        "date_modified": "2025-04-23T10:25:57.868709-07:00",
        "entry_number": null,
        "description": "Check Received on 3/24/2025 from STATE OF CALIFORNIA. Check Number: 529401. Amount: $100.00. (kb3s, Deputy Clerk)"
    },
    {
        "id": 421717986,
        "docket_id": 69714275,
        "date_filed": "2025-03-24",
        "date_modified": "2025-04-23T10:25:57.851402-07:00",
        "entry_number": null,
        "description": "Check Received on 3/24/2025 from STATE OF NEW JERSEY. Check Number: A0014915991. Amount: $100.00. (kb3s, Deputy Clerk)"
    },
    {
        "id": 421717985,
        "docket_id": 69714275,
        "date_filed": "2025-03-24",
        "date_modified": "2025-04-23T10:25:57.833900-07:00",
        "entry_number": null,
        "description": "Check Received on 3/24/2025 from OFFICE OF THE ATTORNEY GENERAL STATE OF ILLINOIS. Check Number: 3442. Amount: $100.00. (kb3s, Deputy Clerk)"
    },
    {
        "id": 421717984,
        "docket_id": 69714275,
        "date_filed": "2025-03-24",
        "date_modified": "2025-04-23T10:25:57.817451-07:00",
        "entry_number": null,
        "description": "Check Received on 3/24/2025 from THE COMMONWEALTH OF MASSACHUSETTS ATTORNEY GENERALS OFFICE. Check Number: 1233. Amount: $100.00. (kb3s, Deputy Clerk)"
    },
    {
        "id": 421717981,
        "docket_id": 69714275,
        "date_filed": "2025-03-20",
        "date_modified": "2025-04-23T10:25:57.340924-07:00",
        "entry_number": null,
        "description": "Check Received on 3/20/2025 from STATE OF MICHIGAN DEPARTMENT OF ATTORNEY GENERAL. Check Number: 510209094. Amount: $100. (bg3s, Deputy Clerk)"
    },
    {
        "id": 421717980,
        "docket_id": 69714275,
        "date_filed": "2025-03-20",
        "date_modified": "2025-04-23T10:25:57.324966-07:00",
        "entry_number": null,
        "description": "Check Received on 3/20/2025 from OFFICE OF THE ATTORNEY GENERAL CONNECTICUT. Check Number: 14098. Amount: $100. (bg3s, Deputy Clerk)"
    },
    {
        "id": 421717979,
        "docket_id": 69714275,
        "date_filed": "2025-03-19",
        "date_modified": "2025-04-23T10:25:57.291634-07:00",
        "entry_number": null,
        "description": "Check Received on 3/19/2025 from STATE OF HAWAII OFFICE OF ATTORNEY GENERAL. Check Number: 1362. Amount: $100.00. (hmls, Deputy Clerk)"
    },
    {
        "id": 421717978,
        "docket_id": 69714275,
        "date_filed": "2025-03-19",
        "date_modified": "2025-04-23T10:25:57.274625-07:00",
        "entry_number": null,
        "description": "Check Received on 3/19/2025 from STATE OF OREGON DEPARTMENT OF JUSTICE. Check Number: 122767. Amount: $100.00. (hmls, Deputy Clerk)"
    },
    {
        "id": 421717977,
        "docket_id": 69714275,
        "date_filed": "2025-03-19",
        "date_modified": "2025-04-23T10:25:57.258642-07:00",
        "entry_number": null,
        "description": "Check Received on 3/19/2025 from MINNESOTA OFFICE OF THE ATTORNEY GENERAL. Check Number: 5138. Amount: $100.00. (hmls, Deputy Clerk)"
    },
    {
        "id": 421688866,
        "docket_id": 69714275,
        "date_filed": "2025-04-07",
        "date_modified": "2025-04-23T10:25:58.719126-07:00",
        "entry_number": 135,
        "description": "RETURN DOCUMENT ORDER. Signed by Judge James K Bredar on 4/1/2025. (Attachments: # 1 Return Document)(kb3s, Deputy Clerk) (Entered: 04/07/2025)"
    },
    {
        "id": 421409314,
        "docket_id": 69714275,
        "date_filed": "2025-04-04",
        "date_modified": "2025-04-23T10:25:58.700396-07:00",
        "entry_number": 134,
        "description": "MEMORANDUM AND ORDER denying 131 MOTION to Stay re 126 Order on Motion for Preliminary Injunction, Pending Appeal. Signed by Judge James K Bredar on 4/4/2025. (kb3s, Deputy Clerk) (Entered: 04/04/2025)"
    },
    {
        "id": 421409313,
        "docket_id": 69714275,
        "date_filed": "2025-04-04",
        "date_modified": "2025-04-23T10:25:58.681153-07:00",
        "entry_number": 133,
        "description": "RESPONSE in Opposition re 131 MOTION to Stay re 126 Order on Motion for Preliminary Injunction, Pending Appeal filed by Arizona, California, Colorado, Connecticut, Delaware, District Of Columbia, Hawaii, Illinois, Massachusetts, Minnesota, Nevada, New Jersey, New Mexico, New York, Oregon, People of the State of Michigan, Rhode Island, State of Maryland, Vermont, Wisconsin.(Williamson, Virginia) (Entered: 04/04/2025)"
    },
    {
        "id": 421409312,
        "docket_id": 69714275,
        "date_filed": "2025-04-03",
        "date_modified": "2025-04-23T10:25:58.662998-07:00",
        "entry_number": 132,
        "description": "NOTICE of Appearance by Heidi Parry Stern on behalf of Nevada (Stern, Heidi) (Entered: 04/03/2025)"
    },
    {
        "id": 421409311,
        "docket_id": 69714275,
        "date_filed": "2025-04-03",
        "date_modified": "2025-04-23T10:25:58.643466-07:00",
        "entry_number": 131,
        "description": "MOTION to Stay re 126 Order on Motion for Preliminary Injunction, Pending Appeal by Scott Bessent, Douglas Burgum, Douglas A. Collins, Consumer Financial Protection Bureau, Sean P Duffy, Stephen Ehikian, Environmental Protection Agency, Charles Ezell, Federal Deposit Insurance Corporation, General Services Administration, Peter Hegseth, Travis Hill, Robert F. Kennedy, Jr, Kelly Loefler, Howard Lutnick, Linda McMahon, Vincent Micone, National Archives and Records Administration, Kristi Noem, Office of Personnel Management, Brooke Rollins, Marco Rubio, Marco Rubio, Small Business Administration, Scott Turner, United States Agency for International Development, United States Department of Agriculture, United States Department of Commerce, United States Department of Defense, United States Department of Education, United States Department of Energy, United States Department of Health & Human Services, United States Department of Homeland Security, United States Department of Housing and Urban Development, United States Department of Interior, United States Department of Labor, United States Department of Transportation, United States Department of Treasury, United States Department of Veterans Affairs, Russell Vought, Christopher Wright, Lee Zeldin (Attachments: # 1 Memorandum in Support, # 2 Text of Proposed Order)(Chasin, Steven) (Entered: 04/03/2025)"
    },
    {
        "id": 421342267,
        "docket_id": 69714275,
        "date_filed": "2025-04-03",
        "date_modified": "2025-04-23T10:25:58.624806-07:00",
        "entry_number": 130,
        "description": "ORDER of USCA Consolidating USCA Case No. 25-1248 and USCA Case No. 25-1338 as to 46 Notice of Appeal,,,,, filed by United States Agency for International Development, United States Department of Housing and Urban Development, Charles Ezell, Howard Lutnick, United States Department of Treasury, Peter Hegseth, United States Department of Veterans Affairs, Federal Deposit Insurance Corporation, United States Department of Transportation, United States Department of Health & Human Services, Linda McMahon, Small Business Administration, Robert F. Kennedy, Jr., Consumer Financial Protection Bureau, Sean P Duffy, United States Department of Energy, Brooke Rollins, Scott Turner, Douglas A. Collins, Kelly Loefler, United States Department of Interior, Environmental Protection Agency, Scott Bessent, Douglas Burgum, Vincent Micone, Christopher Wright, Office of Personnel Management, General Services Administration, United States Department of Commerce, Lee Zeldin, Marco Rubio, United States Department of Homeland Security, National Archives and Records Administration, United States Department of Defense, Travis Hill, United States Department of Labor, United States Department of Agriculture, Kristi Noem, Stephen Ehikian, United States Department of Education, Russell Vought, 127 Notice of Interlocutory Appeal,,,,, filed by United States Agency for International Development, United States Department of Housing and Urban Development, Charles Ezell, Howard Lutnick, United States Department of Treasury, Peter Hegseth, United States Department of Veterans Affairs, Federal Deposit Insurance Corporation, United States Department of Transportation, United States Department of Health & Human Services, Linda McMahon, Small Business Administration, Robert F. Kennedy, Jr., Consumer Financial Protection Bureau, Sean P Duffy, United States Department of Energy, Brooke Rollins, Scott Turner, Douglas A. Collins, Kelly Loefler, Environmental Protection Agency, United States Department of Interior, Scott Bessent, Vincent Micone, Douglas Burgum, Christopher Wright, Office of Personnel Management, General Services Administration, United States Department of Commerce, Lee Zeldin, Marco Rubio, United States Department of Homeland Security, National Archives and Records Administration, United States Department of Defense, Travis Hill, United States Department of Labor, United States Department of Agriculture, Kristi Noem, Stephen Ehikian, United States Department of Education, Russell Vought (av4s, Deputy Clerk) (Entered: 04/03/2025)"
    },
    {
        "id": 421304106,
        "docket_id": 69714275,
        "date_filed": "2025-04-03",
        "date_modified": "2025-04-23T10:25:58.605235-07:00",
        "entry_number": 129,
        "description": "USCA Case Number 25-1338 for 127 Notice of Interlocutory Appeal,,,,, filed by United States Agency for International Development, United States Department of Housing and Urban Development, Charles Ezell, Howard Lutnick, United States Department of Treasury, Peter Hegseth, United States Department of Veterans Affairs, Federal Deposit Insurance Corporation, United States Department of Transportation, United States Department of Health & Human Services, Linda McMahon, Small Business Administration, Robert F. Kennedy, Jr., Consumer Financial Protection Bureau, Sean P Duffy, United States Department of Energy, Brooke Rollins, Scott Turner, Douglas A. Collins, Kelly Loefler, United States Department of Interior, Environmental Protection Agency, Scott Bessent, Douglas Burgum, Vincent Micone, Christopher Wright, Office of Personnel Management, General Services Administration, United States Department of Commerce, Lee Zeldin, Marco Rubio, United States Department of Homeland Security, National Archives and Records Administration, United States Department of Defense, Travis Hill, United States Department of Labor, United States Department of Agriculture, Kristi Noem, Stephen Ehikian, United States Department of Education, Russell Vought. Case Manager - Jeffrey Neal (av4s, Deputy Clerk) (Entered: 04/03/2025)"
    },
    {
        "id": 421304105,
        "docket_id": 69714275,
        "date_filed": "2025-04-03",
        "date_modified": "2025-04-23T10:25:58.586335-07:00",
        "entry_number": 128,
        "description": "Transmission of Notice of Appeal and Docket Sheet to US Court of Appeals re 127 Notice of Interlocutory Appeal. IMPORTANT NOTICE: To access forms which you are required to file with the United States Court of Appeals for the Fourth Circuit please go to http://www.ca4.uscourts.gov and click on Forms & Notices. (av4s, Deputy Clerk) (Entered: 04/03/2025)"
    },
    {
        "id": 421304104,
        "docket_id": 69714275,
        "date_filed": "2025-04-02",
        "date_modified": "2025-04-23T10:25:58.564832-07:00",
        "entry_number": 127,
        "description": "NOTICE OF INTERLOCUTORY APPEAL as to 125 Memorandum Opinion, 126 Order on Motion for Preliminary Injunction, by Scott Bessent, Douglas Burgum, Douglas A. Collins, Consumer Financial Protection Bureau, Sean P Duffy, Stephen Ehikian, Environmental Protection Agency, Charles Ezell, Federal Deposit Insurance Corporation, General Services Administration, Peter Hegseth, Travis Hill, Robert F. Kennedy, Jr, Kelly Loefler, Howard Lutnick, Linda McMahon, Vincent Micone, National Archives and Records Administration, Kristi Noem, Office of Personnel Management, Brooke Rollins, Marco Rubio, Marco Rubio, Small Business Administration, Scott Turner, United States Agency for International Development, United States Department of Agriculture, United States Department of Commerce, United States Department of Defense, United States Department of Education, United States Department of Energy, United States Department of Health & Human Services, United States Department of Homeland Security, United States Department of Housing and Urban Development, United States Department of Interior, United States Department of Labor, United States Department of Transportation, United States Department of Treasury, United States Department of Veterans Affairs, Russell Vought, Christopher Wright, Lee Zeldin. (Chasin, Steven) (Entered: 04/02/2025)"
    },
    {
        "id": 421101831,
        "docket_id": 69714275,
        "date_filed": "2025-04-01",
        "date_modified": "2025-04-23T10:25:58.540622-07:00",
        "entry_number": 126,
        "description": "ORDER granting in part 78 Motion for Preliminary Injunction and Section 705 Stay; directing enjoined Defendants to file a status report on or before Tuesday, April 8, 2025 at 2:00 p.m.; vacating 44 and 115 as superseded by this Order. Signed by Judge James K Bredar on 4/1/2025. (jf3s, Deputy Clerk) (Entered: 04/01/2025)"
    },
    {
        "id": 421101819,
        "docket_id": 69714275,
        "date_filed": "2025-04-01",
        "date_modified": "2025-04-23T10:25:58.510850-07:00",
        "entry_number": 125,
        "description": "MEMORANDUM OPINION. Signed by Judge James K Bredar on 4/1/2025. (jf3s, Deputy Clerk) (Entered: 04/01/2025)"
    },
    {
        "id": 421054650,
        "docket_id": 69714275,
        "date_filed": "2025-04-01",
        "date_modified": "2025-04-23T10:25:58.491413-07:00",
        "entry_number": 124,
        "description": "PAPERLESS ORDER granting 123 Corrected Motion to Appear Pro Hac Vice on behalf of Heidi Parry Stern. Directing attorney Heidi Parry Stern to register for pro hac vice filing in the District of Maryland through PACER at https://pacer.uscourts.gov/ if attorney has not already done so. The Pro Hac Vice option must be selected when registering. Signed by Clerk on 4/1/2025. (mh4s, Deputy Clerk) (Entered: 04/01/2025)"
    },
    {
        "id": 421029271,
        "docket_id": 69714275,
        "date_filed": "2025-04-01",
        "date_modified": "2025-04-23T10:25:58.472173-07:00",
        "entry_number": 123,
        "description": "CORRECTED MOTION to Appear Pro Hac Vice for Heidi Parry Stern by Nevada. The fee has already been paid.(Handley, James) (Entered: 04/01/2025)"
    },
    {
        "id": 420937711,
        "docket_id": 69714275,
        "date_filed": "2025-03-31",
        "date_modified": "2025-04-23T10:25:58.449912-07:00",
        "entry_number": 122,
        "description": "PAPERLESS ORDER granting 118 Corrected Motion to Appear Pro Hac Vice on behalf of Christina L. Beatty-Walters. Directing attorney Christina L. Beatty-Walters to register for pro hac vice filing in the District of Maryland through PACER at https://pacer.uscourts.gov/ if attorney has not already done so. The Pro Hac Vice option must be selected when registering. Signed by Clerk on 3/31/2025. (mh4s, Deputy Clerk) (Entered: 03/31/2025)"
    },
    {
        "id": 420937710,
        "docket_id": 69714275,
        "date_filed": "2025-03-31",
        "date_modified": "2025-04-23T10:25:58.430918-07:00",
        "entry_number": null,
        "description": "Check Received on 3/31/2025 from Colorado, Office of the State Controller. Check Number: 8003828083. Amount: $100.00. (kb3s, Deputy Clerk)"
    },
    {
        "id": 420937709,
        "docket_id": 69714275,
        "date_filed": "2025-03-31",
        "date_modified": "2025-04-23T10:25:58.415691-07:00",
        "entry_number": 121,
        "description": "RETURNED DOCUMENT ORDER. Signed by Judge James K Bredar on 3/28/2025. (Attachments: # 1 Returned Item)(kb3s, Deputy Clerk) (Entered: 03/31/2025)"
    },
    {
        "id": 420736796,
        "docket_id": 69714275,
        "date_filed": "2025-03-28",
        "date_modified": "2025-04-23T10:25:58.393359-07:00",
        "entry_number": null,
        "description": "Check Received on 3/28/2025 from State of Wisconsin. Check Number: 1003255173. Amount: $100.00. (kb3s, Deputy Clerk)"
    },
    {
        "id": 420628649,
        "docket_id": 69714275,
        "date_filed": "2025-03-27",
        "date_modified": "2025-04-23T10:25:58.377073-07:00",
        "entry_number": 120,
        "description": "PAPERLESS ORDER granting 111 Corrected Motion to Appear Pro Hac Vice on behalf of Natalya A. Buckler. Directing attorney Natalya A. Buckler to register for pro hac vice filing in the District of Maryland through PACER at https://pacer.uscourts.gov/ if attorney has not already done so. The Pro Hac Vice option must be selected when registering. Signed by Clerk on 3/27/2025. (mh4s, Deputy Clerk) (Entered: 03/27/2025)"
    },
    {
        "id": 420628648,
        "docket_id": 69714275,
        "date_filed": "2025-03-27",
        "date_modified": "2025-04-23T10:25:58.357297-07:00",
        "entry_number": 119,
        "description": "NOTICE OF FILING OF OFFICIAL TRANSCRIPT of Proceedings held on 03/26/2025, before Judge Bredar. Court Reporter Nadine Bachmann, Telephone number 410-962-4753 nadine_bachmann@mdd.uscourts.gov. Total number of pages filed: 52. Transcript may be viewed at the court public terminal or purchased through the Court Reporter before the deadline for Release of Transcript Restriction. After that date it may be obtained from the Court Reporter or through PACER. Redaction Request due 4/17/2025. Redacted Transcript Deadline set for 4/28/2025. Release of Transcript Restriction set for 6/25/2025.(nb, Court Reporter) (Entered: 03/27/2025)"
    },
    {
        "id": 420628647,
        "docket_id": 69714275,
        "date_filed": "2025-03-27",
        "date_modified": "2025-04-23T10:25:58.338881-07:00",
        "entry_number": 118,
        "description": "CORRECTED MOTION to Appear Pro Hac Vice for Christina Beatty Walters by Oregon. The fee has already been paid.(Handley, James) (Entered: 03/27/2025)"
    },
    {
        "id": 420589048,
        "docket_id": 69714275,
        "date_filed": "2025-03-27",
        "date_modified": "2025-04-23T10:25:58.302868-07:00",
        "entry_number": null,
        "description": "Check Received on 3/27/2025 from STATE OF RHODE ISLAND OFFICE OF THE ATTORNEY GENERAL. Check Number: 0003251698. Amount: $100.00. (kb3s, Deputy Clerk)"
    },
    {
        "id": 420557593,
        "docket_id": 69714275,
        "date_filed": "2025-03-27",
        "date_modified": "2025-04-23T10:25:58.286293-07:00",
        "entry_number": 117,
        "description": "Memorandum re 78 MOTION for Preliminary Injunction and Section 705 Stay Defendants' Supplemental Briefing Pursuant to March 26,2025 Order filed by Scott Bessent, Douglas Burgum, Douglas A. Collins, Consumer Financial Protection Bureau, Sean P Duffy, Stephen Ehikian, Environmental Protection Agency, Charles Ezell, Federal Deposit Insurance Corporation, General Services Administration, Peter Hegseth, Travis Hill, Robert F. Kennedy, Jr, Kelly Loefler, Howard Lutnick, Linda McMahon, Vincent Micone, National Archives and Records Administration, Kristi Noem, Office of Personnel Management, Brooke Rollins, Marco Rubio, Marco Rubio, Small Business Administration, Scott Turner, United States Agency for International Development, United States Department of Agriculture, United States Department of Commerce, United States Department of Defense, United States Department of Education, United States Department of Energy, United States Department of Health & Human Services, United States Department of Homeland Security, United States Department of Housing and Urban Development, United States Department of Interior, United States Department of Labor, United States Department of Transportation, United States Department of Treasury, United States Department of Veterans Affairs, Russell Vought, Christopher Wright, Lee Zeldin. (Attachments: # 1 Transcript)(Chasin, Steven) (Entered: 03/27/2025)"
    },
    {
        "id": 420557592,
        "docket_id": 69714275,
        "date_filed": "2025-03-27",
        "date_modified": "2025-04-23T10:25:58.267438-07:00",
        "entry_number": 116,
        "description": "Memorandum re 78 MOTION for Preliminary Injunction and Section 705 Stay Second Supplemental Brief on Scope of Relief filed by Arizona, California, Colorado, Connecticut, Delaware, District Of Columbia, Hawaii, Illinois, Massachusetts, Minnesota, Nevada, New Jersey, New Mexico, New York, Oregon, People of the State of Michigan, Rhode Island, State of Maryland, Vermont, Wisconsin.(Williamson, Virginia) (Entered: 03/27/2025)"
    },
    {
        "id": 420484614,
        "docket_id": 69714275,
        "date_filed": "2025-03-26",
        "date_modified": "2025-04-23T10:25:58.249554-07:00",
        "entry_number": 115,
        "description": "(VACATED See 125 Superseding Order) MEMORANDUM AND ORDER granting 85 MOTION for Temporary Restraining Order Extension. Signed by Judge James K Bredar on 3/26/2025. (kb3s, Deputy Clerk) Modified on 4/1/2025 (jf3s). (Entered: 03/26/2025)"
    },
    {
        "id": 420484613,
        "docket_id": 69714275,
        "date_filed": "2025-03-26",
        "date_modified": "2025-04-23T10:25:58.231184-07:00",
        "entry_number": 114,
        "description": "ORDER Directing Parties to provide additional briefing on the following question by 10:00am on March 27, 2025. Signed by Judge James K Bredar on 3/26/2025. (kb3s, Deputy Clerk) (Entered: 03/26/2025)"
    },
    {
        "id": 420484612,
        "docket_id": 69714275,
        "date_filed": "2025-03-26",
        "date_modified": "2025-04-23T10:25:58.213254-07:00",
        "entry_number": 113,
        "description": "ORDER granting 80 Motion to Seal. Signed by Judge James K Bredar on 3/26/2025. (kb3s, Deputy Clerk) (c/e to Virginia Anne Williamson 3.26.25) (Entered: 03/26/2025)"
    },
    {
        "id": 420453874,
        "docket_id": 69714275,
        "date_filed": "2025-03-26",
        "date_modified": "2025-04-23T10:25:58.193326-07:00",
        "entry_number": 112,
        "description": "Preliminary Injunction Hearing held on 3/26/2025 before Judge James K Bredar.(Court Reporter: Nadine Bachmann) (dg4s, Deputy Clerk) (Entered: 03/26/2025)"
    },
    {
        "id": 420416338,
        "docket_id": 69714275,
        "date_filed": "2025-03-25",
        "date_modified": "2025-04-23T10:25:58.154141-07:00",
        "entry_number": null,
        "description": "Check Received on 3/25/2025 from GOVERNMENT OF THE DISTRICT OF COLUMBIA. Check Number: 007142397. Amount: $100.00. (kb3s, Deputy Clerk)"
    },
    {
        "id": 420391023,
        "docket_id": 69714275,
        "date_filed": "2025-03-25",
        "date_modified": "2025-04-23T10:25:58.137675-07:00",
        "entry_number": 111,
        "description": "CORRECTED MOTION to Appear Pro Hac Vice for Natalya A. Buckler by Rhode Island. The fee has already been paid.(Handley, James) (Entered: 03/25/2025)"
    },
    {
        "id": 420357812,
        "docket_id": 69714275,
        "date_filed": "2025-03-25",
        "date_modified": "2025-04-23T10:25:58.119745-07:00",
        "entry_number": 110,
        "description": "NOTICE of Appearance by Eric Hamilton on behalf of All Defendants (Hamilton, Eric) (Entered: 03/25/2025)"
    },
    {
        "id": 420357811,
        "docket_id": 69714275,
        "date_filed": "2025-03-25",
        "date_modified": "2025-04-23T10:25:58.099135-07:00",
        "entry_number": 109,
        "description": "PAPERLESS ORDER granting 99 Motion to Appear Pro Hac Vice on behalf of Anne Deng. Directing attorney Anne Deng to register for pro hac vice filing in the District of Maryland through PACER at https://pacer.uscourts.gov/ if attorney has not already done so. The Pro Hac Vice option must be selected when registering. Signed by Clerk on 3/25/2025. (mh4s, Deputy Clerk) (Entered: 03/25/2025)"
    },
    {
        "id": 420357810,
        "docket_id": 69714275,
        "date_filed": "2025-03-25",
        "date_modified": "2025-04-23T10:25:58.073162-07:00",
        "entry_number": 108,
        "description": "PAPERLESS ORDER granting 98 Motion to Appear Pro Hac Vice on behalf of Ryan C. Wilson. Directing attorney Ryan C. Wilson to register for pro hac vice filing in the District of Maryland through PACER at https://pacer.uscourts.gov/ if attorney has not already done so. The Pro Hac Vice option must be selected when registering. Signed by Clerk on 3/25/2025. (mh4s, Deputy Clerk) (Entered: 03/25/2025)"
    },
    {
        "id": 420337336,
        "docket_id": 69714275,
        "date_filed": "2025-03-25",
        "date_modified": "2025-04-23T10:25:58.037737-07:00",
        "entry_number": 107,
        "description": "QC NOTICE: 90 Motion to Appear Pro Hac Vice filed by Nevada needs to be modified. See attachment for details and corrective actions needed regarding the signature(s) on the motion. (mh4s, Deputy Clerk) (Entered: 03/25/2025)"
    },
    {
        "id": 420337334,
        "docket_id": 69714275,
        "date_filed": "2025-03-25",
        "date_modified": "2025-04-23T10:25:58.011962-07:00",
        "entry_number": 106,
        "description": "QC NOTICE: 89 Motion to Appear Pro Hac Vice filed by Rhode Island needs to be modified. See attachment for details and corrective actions needed regarding the signature(s) on the motion. (mh4s, Deputy Clerk) (Entered: 03/25/2025)"
    },
    {
        "id": 420335716,
        "docket_id": 69714275,
        "date_filed": "2025-03-25",
        "date_modified": "2025-04-23T10:25:57.989691-07:00",
        "entry_number": 105,
        "description": "QC NOTICE: 88 Motion to Appear Pro Hac Vice filed by Oregon needs to be modified. See attachment for details and corrective actions needed regarding the signature(s) on the motion. (mh4s, Deputy Clerk) (Entered: 03/25/2025)"
    },
    {
        "id": 420332110,
        "docket_id": 69714275,
        "date_filed": "2025-03-25",
        "date_modified": "2025-04-23T10:25:57.969239-07:00",
        "entry_number": 104,
        "description": "PAPERLESS ORDER granting 87 Motion to Appear Pro Hac Vice on behalf of Brian P. Keenan. Directing attorney Brian P. Keenan to register for pro hac vice filing in the District of Maryland through PACER at https://pacer.uscourts.gov/ if attorney has not already done so. The Pro Hac Vice option must be selected when registering. Signed by Clerk on 3/25/2025. (mh4s, Deputy Clerk) (Entered: 03/25/2025)"
    },
    {
        "id": 420327169,
        "docket_id": 69714275,
        "date_filed": "2025-03-25",
        "date_modified": "2025-04-23T10:25:57.947750-07:00",
        "entry_number": 103,
        "description": "STATUS REPORT Restrained Defendants Updated Compliance Status Report by Scott Bessent, Douglas Burgum, Douglas A. Collins, Consumer Financial Protection Bureau, Sean P Duffy, Stephen Ehikian, Environmental Protection Agency, Charles Ezell, Federal Deposit Insurance Corporation, General Services Administration, Peter Hegseth, Travis Hill, Robert F. Kennedy, Jr, Kelly Loefler, Howard Lutnick, Linda McMahon, Vincent Micone, National Archives and Records Administration, Kristi Noem, Office of Personnel Management, Brooke Rollins, Marco Rubio, Marco Rubio, Small Business Administration, Scott Turner, United States Agency for International Development, United States Department of Agriculture, United States Department of Commerce, United States Department of Defense, United States Department of Education, United States Department of Energy, United States Department of Health & Human Services, United States Department of Homeland Security, United States Department of Housing and Urban Development, United States Department of Interior, United States Department of Labor, United States Department of Transportation, United States Department of Treasury, United States Department of Veterans Affairs, Russell Vought, Christopher Wright, Lee Zeldin (Attachments: # 1 Exhibit 1)(Chasin, Steven) (Entered: 03/25/2025)"
    },
    {
        "id": 420229569,
        "docket_id": 69714275,
        "date_filed": "2025-03-24",
        "date_modified": "2025-04-23T10:25:57.928742-07:00",
        "entry_number": 102,
        "description": "Memorandum re 78 MOTION for Preliminary Injunction and Section 705 Stay Scope of Relief filed by Arizona, California, Colorado, Connecticut, Delaware, District Of Columbia, Hawaii, Illinois, Massachusetts, Minnesota, Nevada, New Jersey, New Mexico, New York, Oregon, People of the State of Michigan, Rhode Island, State of Maryland, Vermont, Wisconsin. (Attachments: # 1 Exhibit 1, # 2 Exhibit 2)(Williamson, Virginia) (Entered: 03/24/2025)"
    },
    {
        "id": 420229568,
        "docket_id": 69714275,
        "date_filed": "2025-03-24",
        "date_modified": "2025-04-23T10:25:57.905240-07:00",
        "entry_number": 101,
        "description": "RESPONSE in Opposition re 78 MOTION for Preliminary Injunction and Section 705 Stay filed by Scott Bessent, Douglas Burgum, Douglas A. Collins, Consumer Financial Protection Bureau, Sean P Duffy, Stephen Ehikian, Environmental Protection Agency, Charles Ezell, Federal Deposit Insurance Corporation, General Services Administration, Peter Hegseth, Travis Hill, Robert F. Kennedy, Jr, Kelly Loefler, Howard Lutnick, Linda McMahon, Vincent Micone, National Archives and Records Administration, Kristi Noem, Office of Personnel Management, Brooke Rollins, Marco Rubio, Marco Rubio, Small Business Administration, Scott Turner, United States Agency for International Development, United States Department of Agriculture, United States Department of Commerce, United States Department of Defense, United States Department of Education, United States Department of Energy, United States Department of Health & Human Services, United States Department of Homeland Security, United States Department of Housing and Urban Development, United States Department of Interior, United States Department of Labor, United States Department of Transportation, United States Department of Treasury, United States Department of Veterans Affairs, Russell Vought, Christopher Wright, Lee Zeldin.(Chasin, Steven) (Entered: 03/24/2025)"
    },
    {
        "id": 420229562,
        "docket_id": 69714275,
        "date_filed": "2025-03-24",
        "date_modified": "2025-04-23T10:25:57.801257-07:00",
        "entry_number": null,
        "description": "Check Received on 3/24/2025 from STATE OF NEW YORK OFFICE OF THE ATTORNEY GENERAL. Check Number: 15604. Amount: $100.00. (kb3s, Deputy Clerk)"
    },
    {
        "id": 420229561,
        "docket_id": 69714275,
        "date_filed": "2025-03-24",
        "date_modified": "2025-04-23T10:25:57.783489-07:00",
        "entry_number": 100,
        "description": "NOTICE of Appearance by Jonathan T Rose on behalf of Vermont (Rose, Jonathan) (Entered: 03/24/2025)"
    },
    {
        "id": 420229560,
        "docket_id": 69714275,
        "date_filed": "2025-03-24",
        "date_modified": "2025-04-23T10:25:57.765628-07:00",
        "entry_number": 99,
        "description": "MOTION to Appear Pro Hac Vice for Anne Deng (Filing fee $100, receipt number AMDDC-11860009.) by District Of Columbia(Handley, James) (Entered: 03/24/2025)"
    },
    {
        "id": 420229559,
        "docket_id": 69714275,
        "date_filed": "2025-03-24",
        "date_modified": "2025-04-23T10:25:57.747244-07:00",
        "entry_number": 98,
        "description": "MOTION to Appear Pro Hac Vice for Ryan C. Wilson (Filing fee $100, receipt number AMDDC-11859963.) by District Of Columbia(Handley, James) (Entered: 03/24/2025)"
    },
    {
        "id": 420083247,
        "docket_id": 69714275,
        "date_filed": "2025-03-21",
        "date_modified": "2025-04-23T10:25:57.728810-07:00",
        "entry_number": 97,
        "description": "ORDER setting a briefing schedule re 78 Motion for a Section 705 Stay and Preliminary Injunction. Signed by Judge James K Bredar on 3/21/2025. (jf3s, Deputy Clerk) (Entered: 03/21/2025)"
    },
    {
        "id": 420083246,
        "docket_id": 69714275,
        "date_filed": "2025-03-21",
        "date_modified": "2025-04-23T10:25:57.709158-07:00",
        "entry_number": 96,
        "description": "ORDER granting 95 Consent Motion to Extend Deadline to File Updated Compliance Status Report; Status report due by Tuesday, March 25, 2025 at 1:00 p.m. Signed by Judge James K Bredar on 3/21/2025. (jf3s, Deputy Clerk) (Entered: 03/21/2025)"
    },
    {
        "id": 420083245,
        "docket_id": 69714275,
        "date_filed": "2025-03-21",
        "date_modified": "2025-04-23T10:25:57.689004-07:00",
        "entry_number": 95,
        "description": "Consent MOTION for Extension of Time to File Updated Compliance Status Report by 24 Hours by Scott Bessent, Douglas Burgum, Douglas A. Collins, Consumer Financial Protection Bureau, Sean P Duffy, Stephen Ehikian, Environmental Protection Agency, Charles Ezell, Federal Deposit Insurance Corporation, General Services Administration, Peter Hegseth, Travis Hill, Robert F. Kennedy, Jr, Kelly Loefler, Howard Lutnick, Linda McMahon, Vincent Micone, National Archives and Records Administration, Kristi Noem, Office of Personnel Management, Brooke Rollins, Marco Rubio, Marco Rubio, Small Business Administration, Scott Turner, United States Agency for International Development, United States Department of Agriculture, United States Department of Commerce, United States Department of Defense, United States Department of Education, United States Department of Energy, United States Department of Health & Human Services, United States Department of Homeland Security, United States Department of Housing and Urban Development, United States Department of Interior, United States Department of Labor, United States Department of Transportation, United States Department of Treasury, United States Department of Veterans Affairs, Russell Vought, Christopher Wright, Lee Zeldin (Attachments: # 1 Text of Proposed Order)(Chasin, Steven) (Entered: 03/21/2025)"
    },
    {
        "id": 420083244,
        "docket_id": 69714275,
        "date_filed": "2025-03-21",
        "date_modified": "2025-04-23T10:25:57.669675-07:00",
        "entry_number": 94,
        "description": "NOTICE of Appearance by Steven Michael Chasin on behalf of All Defendants (Chasin, Steven) (Entered: 03/21/2025)"
    },
    {
        "id": 420083243,
        "docket_id": 69714275,
        "date_filed": "2025-03-21",
        "date_modified": "2025-04-23T10:25:57.650494-07:00",
        "entry_number": 93,
        "description": "ORDER of USCA Denying appellants' request for an administrative stay or a stay pending the resolution of the appeal as to 46 Notice of Appeal,filed by United States Agency for International Development, United States Department of Housing and Urban Development, Charles Ezell, Howard Lutnick, United States Department of Treasury, Peter Hegseth, United States Department of Veterans Affairs, Federal Deposit Insurance Corporation, United States Department of Transportation, United States Department of Health & Human Services, Linda McMahon, Small Business Administration, Robert F. Kennedy, Jr., Consumer Financial Protection Bureau, Sean P Duffy, United States Department of Energy, Brooke Rollins, Scott Turner, Douglas A. Collins, Kelly Loefler, United States Department of Interior, Environmental Protection Agency, Scott Bessent, Douglas Burgum, Vincent Micone, Christopher Wright, Office of Personnel Management, General Services Administration, United States Department of Commerce, Lee Zeldin, Marco Rubio, United States Department of Homeland Security, National Archives and Records Administration, United States Department of Defense, Travis Hill, United States Department of Labor, United States Department of Agriculture, Kristi Noem, Stephen Ehikian, United States Department of Education and Russell Vought. (slss, Deputy Clerk) (Entered: 03/21/2025)"
    },
    {
        "id": 420083242,
        "docket_id": 69714275,
        "date_filed": "2025-03-21",
        "date_modified": "2025-04-23T10:25:57.630545-07:00",
        "entry_number": 92,
        "description": "NOTICE of Appearance by Elizabeth C Kramer on behalf of Minnesota (Kramer, Elizabeth) (Entered: 03/21/2025)"
    },
    {
        "id": 420083241,
        "docket_id": 69714275,
        "date_filed": "2025-03-21",
        "date_modified": "2025-04-23T10:25:57.611174-07:00",
        "entry_number": 91,
        "description": "Check Received on 3/21/2025 from STATE OF VERMONT ATTORNEY GENERAL. Check Number: 268. Amount: $100.00. (bw5s, Deputy Clerk) (Entered: 03/21/2025)"
    },
    {
        "id": 420047806,
        "docket_id": 69714275,
        "date_filed": "2025-03-21",
        "date_modified": "2025-04-23T10:25:57.592585-07:00",
        "entry_number": 90,
        "description": "MOTION to Appear Pro Hac Vice for Heidi Parry Stern (Filing fee $100, receipt number AMDDC-11857420.) by Nevada(Handley, James) (Entered: 03/21/2025)"
    },
    {
        "id": 420047805,
        "docket_id": 69714275,
        "date_filed": "2025-03-21",
        "date_modified": "2025-04-23T10:25:57.573653-07:00",
        "entry_number": 89,
        "description": "MOTION to Appear Pro Hac Vice for Natalya A. Buckler (Filing fee $100, receipt number AMDDC-11857367.) by Rhode Island(Handley, James) (Entered: 03/21/2025)"
    },
    {
        "id": 420047804,
        "docket_id": 69714275,
        "date_filed": "2025-03-21",
        "date_modified": "2025-04-23T10:25:57.554521-07:00",
        "entry_number": 88,
        "description": "MOTION to Appear Pro Hac Vice for Christina Beatty Walters (Filing fee $100, receipt number AMDDC-11857296.) by Oregon(Handley, James) (Entered: 03/21/2025)"
    },
    {
        "id": 420047803,
        "docket_id": 69714275,
        "date_filed": "2025-03-21",
        "date_modified": "2025-04-23T10:25:57.535625-07:00",
        "entry_number": 87,
        "description": "MOTION to Appear Pro Hac Vice for Brian P Keenan (Filing fee $100, receipt number AMDDC-11857228.) by Wisconsin(Handley, James) (Entered: 03/21/2025)"
    },
    {
        "id": 420047802,
        "docket_id": 69714275,
        "date_filed": "2025-03-21",
        "date_modified": "2025-04-23T10:25:57.515872-07:00",
        "entry_number": 86,
        "description": "NOTICE of Appearance by Miranda Lea Maison on behalf of California (Maison, Miranda) (Entered: 03/21/2025)"
    },
    {
        "id": 420047801,
        "docket_id": 69714275,
        "date_filed": "2025-03-21",
        "date_modified": "2025-04-23T10:25:57.497332-07:00",
        "entry_number": 85,
        "description": "MOTION for Temporary Restraining Order Extension by Arizona, California, Colorado, Connecticut, Delaware, District Of Columbia, Hawaii, Illinois, Massachusetts, Minnesota, Nevada, New Jersey, New Mexico, New York, Oregon, People of the State of Michigan, Rhode Island, State of Maryland, Vermont, Wisconsin (Attachments: # 1 Text of Proposed Order)(Williamson, Virginia) (Entered: 03/21/2025)"
    },
    {
        "id": 420047800,
        "docket_id": 69714275,
        "date_filed": "2025-03-21",
        "date_modified": "2025-04-23T10:25:57.478477-07:00",
        "entry_number": 84,
        "description": "NOTICE by Arizona, California, Colorado, Connecticut, Delaware, District Of Columbia, Hawaii, Illinois, Massachusetts, Minnesota, Nevada, New Jersey, New Mexico, New York, Oregon, People of the State of Michigan, Rhode Island, State of Maryland, Vermont, Wisconsin re 78 MOTION for Preliminary Injunction and Section 705 Stay Agreed-Upon Briefing Schedule (Williamson, Virginia) (Entered: 03/21/2025)"
    },
    {
        "id": 420017601,
        "docket_id": 69714275,
        "date_filed": "2025-03-21",
        "date_modified": "2025-04-23T10:25:57.459695-07:00",
        "entry_number": 83,
        "description": "NOTICE of Appearance by Satoshi Yanai on behalf of California (Yanai, Satoshi) (Entered: 03/21/2025)"
    },
    {
        "id": 420014733,
        "docket_id": 69714275,
        "date_filed": "2025-03-21",
        "date_modified": "2025-04-23T10:25:57.438855-07:00",
        "entry_number": 82,
        "description": "NOTICE of Appearance by Hayleigh S. Crawford on behalf of Arizona (Crawford, Hayleigh) (Entered: 03/21/2025)"
    },
    {
        "id": 420014732,
        "docket_id": 69714275,
        "date_filed": "2025-03-21",
        "date_modified": "2025-04-23T10:25:57.420430-07:00",
        "entry_number": 81,
        "description": "NOTICE of Appearance by Demian Camacho on behalf of California (Camacho, Demian) (Entered: 03/21/2025)"
    },
    {
        "id": 420014731,
        "docket_id": 69714275,
        "date_filed": "2025-03-20",
        "date_modified": "2025-04-23T10:25:57.401239-07:00",
        "entry_number": 80,
        "description": "MOTION to Seal Unredacted Exhibits to Motion for Preliminary Injunction and Section 705 Stay by Arizona, California, Colorado, Connecticut, Delaware, District Of Columbia, Hawaii, Illinois, Massachusetts, Minnesota, Nevada, New Jersey, New Mexico, New York, Oregon, People of the State of Michigan, Rhode Island, State of Maryland, Vermont, Wisconsin (Attachments: # 1 Text of Proposed Order)(Williamson, Virginia) (Entered: 03/20/2025)"
    },
    {
        "id": 420014730,
        "docket_id": 69714275,
        "date_filed": "2025-03-20",
        "date_modified": "2025-04-23T10:25:57.379161-07:00",
        "entry_number": 79,
        "description": "-SEALED - NOTICE of Filing Under Seal Unredacted Exhibits to Motion for Preliminary Injunction and Section 705 Stay by Arizona, California, Colorado, Connecticut, Delaware, District Of Columbia, Hawaii, Illinois, Massachusetts, Minnesota, Nevada, New Jersey, New Mexico, New York, Oregon, People of the State of Michigan, Rhode Island, State of Maryland, Vermont, Wisconsin (Attachments: # 1 Exhibit B, # 2 Exhibit H, # 3 Exhibit I, # 4 Exhibit J, # 5 Exhibit K, # 6 Exhibit L, # 7 Exhibit P, # 8 Exhibit Q)(Williamson, Virginia) (Entered: 03/20/2025)"
    },
    {
        "id": 420014729,
        "docket_id": 69714275,
        "date_filed": "2025-03-20",
        "date_modified": "2025-04-23T10:25:57.360340-07:00",
        "entry_number": 78,
        "description": "MOTION for Preliminary Injunction and Section 705 Stay by Arizona, California, Colorado, Connecticut, Delaware, District Of Columbia, Hawaii, Illinois, Massachusetts, Minnesota, Nevada, New Jersey, New Mexico, New York, Oregon, People of the State of Michigan, Rhode Island, State of Maryland, Vermont, Wisconsin (Attachments: # 1 Memorandum in Support, # 2 Text of Proposed Order, # 3 Exhibit Index, # 4 Exhibit A, # 5 Exhibit B, # 6 Exhibit C, # 7 Exhibit D, # 8 Exhibit E, # 9 Exhibit F, # 10 Exhibit G, # 11 Exhibit H, # 12 Exhibit I, # 13 Exhibit J, # 14 Exhibit K, # 15 Exhibit L, # 16 Exhibit M, # 17 Exhibit N, # 18 Exhibit O, # 19 Exhibit P, # 20 Exhibit Q)(Williamson, Virginia) (Entered: 03/20/2025)"
    },
    {
        "id": 420014726,
        "docket_id": 69714275,
        "date_filed": "2025-03-20",
        "date_modified": "2025-04-23T10:25:57.308169-07:00",
        "entry_number": null,
        "description": "Check Received on 3/20/2025 from OFFICE OF THE ARIZONA ATTORNEY GENERAL. Check Number: 359. Amount: $100. (bg3s, Deputy Clerk)"
    },
    {
        "id": 419889819,
        "docket_id": 69714275,
        "date_filed": "2025-03-19",
        "date_modified": "2025-04-23T10:25:57.240762-07:00",
        "entry_number": null,
        "description": "Check Received on 3/19/2025 from STATE TREASURER OF MARYLAND. Check Number: 012817. Amount: $100.00. (hmls, Deputy Clerk)"
    },
    {
        "id": 419889818,
        "docket_id": 69714275,
        "date_filed": "2025-03-19",
        "date_modified": "2025-04-23T10:25:57.223866-07:00",
        "entry_number": 77,
        "description": "NOTICE of Appearance by Sarah W Rice on behalf of Rhode Island (Rice, Sarah) (Entered: 03/19/2025)"
    },
    {
        "id": 419646979,
        "docket_id": 69714275,
        "date_filed": "2025-03-18",
        "date_modified": "2025-04-23T10:25:57.205897-07:00",
        "entry_number": 76,
        "description": "NOTICE of Appearance by Gretchen E Helfrich on behalf of Illinois (Helfrich, Gretchen) (Entered: 03/18/2025)"
    },
    {
        "id": 419646978,
        "docket_id": 69714275,
        "date_filed": "2025-03-18",
        "date_modified": "2025-04-23T10:25:57.187645-07:00",
        "entry_number": 75,
        "description": "NOTICE of Appearance by Rabia Muqaddam on behalf of New York (Muqaddam, Rabia) (Entered: 03/18/2025)"
    },
    {
        "id": 419615974,
        "docket_id": 69714275,
        "date_filed": "2025-03-18",
        "date_modified": "2025-04-23T10:25:57.169566-07:00",
        "entry_number": 74,
        "description": "NOTICE of Appearance by David Moskowitz on behalf of Colorado (Moskowitz, David) (Entered: 03/18/2025)"
    },
    {
        "id": 419615973,
        "docket_id": 69714275,
        "date_filed": "2025-03-18",
        "date_modified": "2025-04-23T10:25:57.148776-07:00",
        "entry_number": 72,
        "description": "ORDER re 52 Status Report filed by United States Agency for International Development, United States Department of Housing and Urban Development, Charles Ezell, Howard Lutnick, United States Department of Treasury, Peter Hegseth, United States Department of Veterans Affairs, Federal Deposit Insurance Corporation, United States Department of Transportation, United States Department of Health & Human Services, Linda McMahon, Small Business Administration, Robert F. Kennedy, Jr., Consumer Financial Protection Bureau, Sean P Duffy, United States Department of Energy, Brooke Rollins, Scott Turner, Douglas A. Collins, Kelly Loefler, United States Department of Interior, Environmental Protection Agency, Scott Bessent, Douglas Burgum, Vincent Micone, Christopher Wright, Office of Personnel Management, General Services Administration, United States Department of Commerce, Lee Zeldin, Marco Rubio, United States Department of Homeland Security, National Archives and Records Administration, United States Department of Defense, Travis Hill, United States Department of Labor, United States Department of Agriculture, Kristi Noem, Stephen Ehikian, United States Department of Education, Russell Vought; updated Status Report due 3/24/2025, at 1:00 p.m.; Plaintiffs are reminded of their obligation to post a bond forthwith. Signed by Judge James K Bredar on 3/18/2025. (kns, Deputy Clerk) (Entered: 03/18/2025)"
    },
    {
        "id": 419615972,
        "docket_id": 69714275,
        "date_filed": "2025-03-17",
        "date_modified": "2025-04-23T10:25:56.775428-07:00",
        "entry_number": 73,
        "description": "USCA Case Number 25-1248 for 46 Notice of Appeal, filed by United States Agency for International Development, United States Department of Housing and Urban Development, Charles Ezell, Howard Lutnick, United States Department of Treasury, Peter Hegseth, United States Department of Veterans Affairs, Federal Deposit Insurance Corporation, United States Department of Transportation, United States Department of Health & Human Services, Linda McMahon, Small Business Administration, Robert F. Kennedy, Jr., Consumer Financial Protection Bureau, Sean P Duffy, United States Department of Energy, Brooke Rollins, Scott Turner, Douglas A. Collins, Kelly Loefler, United States Department of Interior, Environmental Protection Agency, Scott Bessent, Douglas Burgum, Vincent Micone, Christopher Wright, Office of Personnel Management, General Services Administration, United States Department of Commerce, Lee Zeldin, Marco Rubio, United States Department of Homeland Security, National Archives and Records Administration, United States Department of Defense, Travis Hill, United States Department of Labor, United States Department of Agriculture, Kristi Noem, Stephen Ehikian, United States Department of Education, Russell Vought. Case Manager - Jeffrey Neal (slss, Deputy Clerk) (Entered: 03/18/2025)"
    },
    {
        "id": 419593341,
        "docket_id": 69714275,
        "date_filed": "2025-03-18",
        "date_modified": "2025-04-23T10:25:57.129184-07:00",
        "entry_number": 71,
        "description": "PAPERLESS ORDER granting 47 Motion to Appear Pro Hac Vice on behalf of Katherine Dirks. Directing attorney Katherine Dirks to register for pro hac vice filing in the District of Maryland through PACER at https://pacer.uscourts.gov/ if attorney has not already done so. The Pro Hac Vice option must be selected when registering. Signed by Clerk on 3/18/2025. (mh4s, Deputy Clerk) (Entered: 03/18/2025)"
    },
    {
        "id": 419593340,
        "docket_id": 69714275,
        "date_filed": "2025-03-18",
        "date_modified": "2025-04-23T10:25:57.109200-07:00",
        "entry_number": 70,
        "description": "PAPERLESS ORDER granting 45 Motion to Appear Pro Hac Vice on behalf of Jonathan Rose. Directing attorney Jonathan Rose to register for pro hac vice filing in the District of Maryland through PACER at https://pacer.uscourts.gov/ if attorney has not already done so. The Pro Hac Vice option must be selected when registering. Signed by Clerk on 3/18/2025. (mh4s, Deputy Clerk) (Entered: 03/18/2025)"
    },
    {
        "id": 419593339,
        "docket_id": 69714275,
        "date_filed": "2025-03-18",
        "date_modified": "2025-04-23T10:25:57.089803-07:00",
        "entry_number": 69,
        "description": "PAPERLESS ORDER granting 41 Motion to Appear Pro Hac Vice on behalf of Debbie K. Taylor. Directing attorney Debbie K. Taylor to register for pro hac vice filing in the District of Maryland through PACER at https://pacer.uscourts.gov/ if attorney has not already done so. The Pro Hac Vice option must be selected when registering. Signed by Clerk on 3/18/2025. (mh4s, Deputy Clerk) (Entered: 03/18/2025)"
    },
    {
        "id": 419593338,
        "docket_id": 69714275,
        "date_filed": "2025-03-18",
        "date_modified": "2025-04-23T10:25:57.069850-07:00",
        "entry_number": 68,
        "description": "PAPERLESS ORDER granting 40 Motion to Appear Pro Hac Vice on behalf of Bryan W. Davis, Jr. Directing attorney Bryan W. Davis, Jr to register for pro hac vice filing in the District of Maryland through PACER at https://pacer.uscourts.gov/ if attorney has not already done so. The Pro Hac Vice option must be selected when registering. Signed by Clerk on 3/18/2025. (mh4s, Deputy Clerk) (Entered: 03/18/2025)"
    },
    {
        "id": 419593337,
        "docket_id": 69714275,
        "date_filed": "2025-03-18",
        "date_modified": "2025-04-23T10:25:57.050855-07:00",
        "entry_number": 67,
        "description": "QC NOTICE: 39 Motion to Appear Pro Hac Vice filed by New Mexico needs to be modified. See attachment for details and corrective actions needed regarding missing or incomplete information. (mh4s, Deputy Clerk) (Entered: 03/18/2025)"
    },
    {
        "id": 419593336,
        "docket_id": 69714275,
        "date_filed": "2025-03-18",
        "date_modified": "2025-04-23T10:25:57.030652-07:00",
        "entry_number": 66,
        "description": "PAPERLESS ORDER granting 38 Motion to Appear Pro Hac Vice on behalf of Rabia Muqaddam. Directing attorney Rabia Muqaddam to register for pro hac vice filing in the District of Maryland through PACER at https://pacer.uscourts.gov/ if attorney has not already done so. The Pro Hac Vice option must be selected when registering. Signed by Clerk on 3/18/2025. (mh4s, Deputy Clerk) (Entered: 03/18/2025)"
    },
    {
        "id": 419593335,
        "docket_id": 69714275,
        "date_filed": "2025-03-18",
        "date_modified": "2025-04-23T10:25:57.011871-07:00",
        "entry_number": 65,
        "description": "PAPERLESS ORDER granting 37 Motion to Appear Pro Hac Vice on behalf of Demian Camacho. Directing attorney Demian Camacho to register for pro hac vice filing in the District of Maryland through PACER at https://pacer.uscourts.gov/ if attorney has not already done so. The Pro Hac Vice option must be selected when registering. Signed by Clerk on 3/18/2025. (mh4s, Deputy Clerk) (Entered: 03/18/2025)"
    },
    {
        "id": 419593334,
        "docket_id": 69714275,
        "date_filed": "2025-03-18",
        "date_modified": "2025-04-23T10:25:56.992262-07:00",
        "entry_number": 64,
        "description": "PAPERLESS ORDER granting 36 Motion to Appear Pro Hac Vice on behalf of Miranda Maison. Directing attorney Miranda Maison to register for pro hac vice filing in the District of Maryland through PACER at https://pacer.uscourts.gov/ if attorney has not already done so. The Pro Hac Vice option must be selected when registering. Signed by Clerk on 3/18/2025. (mh4s, Deputy Clerk) (Entered: 03/18/2025)"
    },
    {
        "id": 419593333,
        "docket_id": 69714275,
        "date_filed": "2025-03-18",
        "date_modified": "2025-04-23T10:25:56.970997-07:00",
        "entry_number": 63,
        "description": "PAPERLESS ORDER granting 35 Motion to Appear Pro Hac Vice on behalf of Satoshi Yanai. Directing attorney Satoshi Yanai to register for pro hac vice filing in the District of Maryland through PACER at https://pacer.uscourts.gov/ if attorney has not already done so. The Pro Hac Vice option must be selected when registering. Signed by Clerk on 3/18/2025. (mh4s, Deputy Clerk) (Entered: 03/18/2025)"
    },
    {
        "id": 419593332,
        "docket_id": 69714275,
        "date_filed": "2025-03-18",
        "date_modified": "2025-04-23T10:25:56.950566-07:00",
        "entry_number": 62,
        "description": "PAPERLESS ORDER granting 34 Motion to Appear Pro Hac Vice on behalf of Kaliko'onalani D. Fernandes. Directing attorney Kaliko'onalani D. Fernandes to register for pro hac vice filing in the District of Maryland through PACER at https://pacer.uscourts.gov/ if attorney has not already done so. The Pro Hac Vice option must be selected when registering. Signed by Clerk on 3/18/2025. (mh4s, Deputy Clerk) (Entered: 03/18/2025)"
    },
    {
        "id": 419586649,
        "docket_id": 69714275,
        "date_filed": "2025-03-18",
        "date_modified": "2025-04-23T10:25:56.930374-07:00",
        "entry_number": 61,
        "description": "PAPERLESS ORDER granting 32 Motion to Appear Pro Hac Vice on behalf of David D. Day. Directing attorney David D. Day to register for pro hac vice filing in the District of Maryland through PACER at https://pacer.uscourts.gov/ if attorney has not already done so. The Pro Hac Vice option must be selected when registering. Signed by Clerk on 3/18/2025. (mh4s, Deputy Clerk) (Entered: 03/18/2025)"
    },
    {
        "id": 419586648,
        "docket_id": 69714275,
        "date_filed": "2025-03-18",
        "date_modified": "2025-04-23T10:25:56.911053-07:00",
        "entry_number": 60,
        "description": "PAPERLESS ORDER granting 31 Motion to Appear Pro Hac Vice on behalf of Gretchen Helfrich. Directing attorney Gretchen Helfrich to register for pro hac vice filing in the District of Maryland through PACER at https://pacer.uscourts.gov/ if attorney has not already done so. The Pro Hac Vice option must be selected when registering. Signed by Clerk on 3/18/2025. (mh4s, Deputy Clerk) (Entered: 03/18/2025)"
    },
    {
        "id": 419586647,
        "docket_id": 69714275,
        "date_filed": "2025-03-18",
        "date_modified": "2025-04-23T10:25:56.891382-07:00",
        "entry_number": 59,
        "description": "PAPERLESS ORDER granting 30 Motion to Appear Pro Hac Vice on behalf of Elizabeth Kramer. Directing attorney Elizabeth Kramer to register for pro hac vice filing in the District of Maryland through PACER at https://pacer.uscourts.gov/ if attorney has not already done so. The Pro Hac Vice option must be selected when registering. Signed by Clerk on 3/18/2025. (mh4s, Deputy Clerk) (Entered: 03/18/2025)"
    },
    {
        "id": 419586646,
        "docket_id": 69714275,
        "date_filed": "2025-03-18",
        "date_modified": "2025-04-23T10:25:56.873466-07:00",
        "entry_number": 58,
        "description": "NOTICE of Appearance by Hannah Wynne Cole-Chu on behalf of District Of Columbia (Cole-Chu, Hannah) (Entered: 03/18/2025)"
    },
    {
        "id": 419586645,
        "docket_id": 69714275,
        "date_filed": "2025-03-18",
        "date_modified": "2025-04-23T10:25:56.854502-07:00",
        "entry_number": 57,
        "description": "PAPERLESS ORDER granting 29 Motion to Appear Pro Hac Vice on behalf of Michael Kenneth Skold. Directing attorney Michael Kenneth Skold to register for pro hac vice filing in the District of Maryland through PACER at https://pacer.uscourts.gov/ if attorney has not already done so. The Pro Hac Vice option must be selected when registering. Signed by Clerk on 3/18/2025. (mh4s, Deputy Clerk) (Entered: 03/18/2025)"
    },
    {
        "id": 419586644,
        "docket_id": 69714275,
        "date_filed": "2025-03-18",
        "date_modified": "2025-04-23T10:25:56.835554-07:00",
        "entry_number": 56,
        "description": "PAPERLESS ORDER granting 27 Motion to Appear Pro Hac Vice on behalf of David Moskowitz. Directing attorney David Moskowitz to register for pro hac vice filing in the District of Maryland through PACER at https://pacer.uscourts.gov/ if attorney has not already done so. The Pro Hac Vice option must be selected when registering. Signed by Clerk on 3/18/2025. (mh4s, Deputy Clerk) (Entered: 03/18/2025)"
    },
    {
        "id": 419583220,
        "docket_id": 69714275,
        "date_filed": "2025-03-18",
        "date_modified": "2025-04-23T10:25:56.814704-07:00",
        "entry_number": 55,
        "description": "PAPERLESS ORDER granting 26 Motion to Appear Pro Hac Vice on behalf of Hayleigh S. Crawford. Directing attorney Hayleigh S. Crawford to register for pro hac vice filing in the District of Maryland through PACER at https://pacer.uscourts.gov/ if attorney has not already done so. The Pro Hac Vice option must be selected when registering. Signed by Clerk on 3/18/2025. (mh4s, Deputy Clerk) (Entered: 03/18/2025)"
    },
    {
        "id": 419581859,
        "docket_id": 69714275,
        "date_filed": "2025-03-18",
        "date_modified": "2025-04-23T10:25:56.796246-07:00",
        "entry_number": 54,
        "description": "ORDER granting 53 Consent MOTION for Extension of Time of 43-Minutes to File Compliance Report. Signed by Judge James K Bredar on 3/18/2025. (ybs, Deputy Clerk) (Entered: 03/18/2025)"
    },
    {
        "id": 419559428,
        "docket_id": 69714275,
        "date_filed": "2025-03-17",
        "date_modified": "2025-04-23T10:25:56.755875-07:00",
        "entry_number": 53,
        "description": "Consent MOTION for Extension of Time of 43-Minutes to File Compliance Report by Scott Bessent, Douglas Burgum, Douglas A. Collins, Consumer Financial Protection Bureau, Sean P Duffy, Stephen Ehikian, Environmental Protection Agency, Charles Ezell, Federal Deposit Insurance Corporation, General Services Administration, Peter Hegseth, Travis Hill, Robert F. Kennedy, Jr, Kelly Loefler, Howard Lutnick, Linda McMahon, Vincent Micone, National Archives and Records Administration, Kristi Noem, Office of Personnel Management, Brooke Rollins, Marco Rubio, Marco Rubio, Small Business Administration, Scott Turner, United States Agency for International Development, United States Department of Agriculture, United States Department of Commerce, United States Department of Defense, United States Department of Education, United States Department of Energy, United States Department of Health & Human Services, United States Department of Homeland Security, United States Department of Housing and Urban Development, United States Department of Interior, United States Department of Labor, United States Department of Transportation, United States Department of Treasury, United States Department of Veterans Affairs, Russell Vought, Christopher Wright, Lee Zeldin (Attachments: # 1 Text of Proposed Order)(Thomas, Beatrice) (Entered: 03/17/2025)"
    },
    {
        "id": 419552043,
        "docket_id": 69714275,
        "date_filed": "2025-03-17",
        "date_modified": "2025-04-23T10:25:56.732784-07:00",
        "entry_number": 52,
        "description": "STATUS REPORT by Scott Bessent, Douglas Burgum, Douglas A. Collins, Consumer Financial Protection Bureau, Sean P Duffy, Stephen Ehikian, Environmental Protection Agency, Charles Ezell, Federal Deposit Insurance Corporation, General Services Administration, Peter Hegseth, Travis Hill, Robert F. Kennedy, Jr, Kelly Loefler, Howard Lutnick, Linda McMahon, Vincent Micone, National Archives and Records Administration, Kristi Noem, Office of Personnel Management, Brooke Rollins, Marco Rubio, Marco Rubio, Small Business Administration, Scott Turner, United States Agency for International Development, United States Department of Agriculture, United States Department of Commerce, United States Department of Defense, United States Department of Education, United States Department of Energy, United States Department of Health & Human Services, United States Department of Homeland Security, United States Department of Housing and Urban Development, United States Department of Interior, United States Department of Labor, United States Department of Transportation, United States Department of Treasury, United States Department of Veterans Affairs, Russell Vought, Christopher Wright, Lee Zeldin (Attachments: # 1 Exhibit 1, # 2 Exhibit 1 (con't))(Thomas, Beatrice) (Entered: 03/17/2025)"
    },
    {
        "id": 419490552,
        "docket_id": 69714275,
        "date_filed": "2025-03-17",
        "date_modified": "2025-04-23T10:25:56.712773-07:00",
        "entry_number": 51,
        "description": "Transmission of Notice of Appeal and Docket Sheet to US Court of Appeals re 46 Notice of Appeal. IMPORTANT NOTICE: To access forms which you are required to file with the United States Court of Appeals for the Fourth Circuit please go to http://www.ca4.uscourts.gov and click on Forms & Notices.(slss, Deputy Clerk) (Additional attachment(s) added on 3/17/2025: # 1 Corrected Transmittal) (slss). (Entered: 03/17/2025)"
    },
    {
        "id": 419441760,
        "docket_id": 69714275,
        "date_filed": "2025-03-17",
        "date_modified": "2025-04-23T10:25:56.694175-07:00",
        "entry_number": 50,
        "description": "ORDER Granting 49 Motion for Extension of Time. Signed by Judge James K Bredar on 3/17/2025. (bas, Deputy Clerk) (Entered: 03/17/2025)"
    },
    {
        "id": 419419672,
        "docket_id": 69714275,
        "date_filed": "2025-03-16",
        "date_modified": "2025-04-23T10:25:56.674087-07:00",
        "entry_number": 49,
        "description": "Consent MOTION for Extension of Time of Deadline to File Status Report from 1 P.M. EDT to 7 P.M. EDT, Monday, March 17, 2025 by Scott Bessent, Douglas Burgum, Douglas A. Collins, Consumer Financial Protection Bureau, Sean P Duffy, Stephen Ehikian, Environmental Protection Agency, Charles Ezell, Federal Deposit Insurance Corporation, General Services Administration, Peter Hegseth, Travis Hill, Robert F. Kennedy, Jr, Kelly Loefler, Howard Lutnick, Linda McMahon, Vincent Micone, National Archives and Records Administration, Kristi Noem, Office of Personnel Management, Brooke Rollins, Marco Rubio, Marco Rubio, Small Business Administration, Scott Turner, United States Agency for International Development, United States Department of Agriculture, United States Department of Commerce, United States Department of Defense, United States Department of Education, United States Department of Energy, United States Department of Health & Human Services, United States Department of Homeland Security, United States Department of Housing and Urban Development, United States Department of Interior, United States Department of Labor, United States Department of Transportation, United States Department of Treasury, United States Department of Veterans Affairs, Russell Vought, Christopher Wright, Lee Zeldin (Attachments: # 1 Text of Proposed Order)(Thomas, Beatrice) (Entered: 03/16/2025)"
    },
    {
        "id": 419417300,
        "docket_id": 69714275,
        "date_filed": "2025-03-16",
        "date_modified": "2025-04-23T10:25:56.655529-07:00",
        "entry_number": 48,
        "description": "NOTICE OF FILING OF OFFICIAL TRANSCRIPT of Proceedings held on 03/12/2025, before Judge James K. Bredar. Court Reporter Kassandra L. McPherson, Telephone number (410) 962-4544; Kassandra_McPherson@mdd.uscourts.gov. Total number of pages filed: 49. Transcript may be viewed at the court public terminal or purchased through the Court Reporter before the deadline for Release of Transcript Restriction. After that date it may be obtained from the Court Reporter or through PACER. Redaction Request due 4/7/2025. Redacted Transcript Deadline set for 4/16/2025. Release of Transcript Restriction set for 6/16/2025.(km10, Court Reporter) (Entered: 03/16/2025)"
    },
    {
        "id": 419350179,
        "docket_id": 69714275,
        "date_filed": "2025-03-14",
        "date_modified": "2025-04-23T10:25:56.637155-07:00",
        "entry_number": 47,
        "description": "MOTION to Appear Pro Hac Vice for Katherine Dirks (Filing fee $100, receipt number AMDDC-11844327.) by Massachusetts(Handley, James) (Entered: 03/14/2025)"
    },
    {
        "id": 419346674,
        "docket_id": 69714275,
        "date_filed": "2025-03-14",
        "date_modified": "2025-04-23T10:25:56.612023-07:00",
        "entry_number": 46,
        "description": "NOTICE OF APPEAL as to 43 Memorandum Opinion, 44 Temporary Restraining Order, by Scott Bessent, Douglas Burgum, Douglas A. Collins, Consumer Financial Protection Bureau, Sean P Duffy, Stephen Ehikian, Environmental Protection Agency, Charles Ezell, Federal Deposit Insurance Corporation, General Services Administration, Peter Hegseth, Travis Hill, Robert F. Kennedy, Jr, Kelly Loefler, Howard Lutnick, Linda McMahon, Vincent Micone, National Archives and Records Administration, Kristi Noem, Office of Personnel Management, Brooke Rollins, Marco Rubio, Marco Rubio, Small Business Administration, Scott Turner, United States Agency for International Development, United States Department of Agriculture, United States Department of Commerce, United States Department of Defense, United States Department of Education, United States Department of Energy, United States Department of Health & Human Services, United States Department of Homeland Security, United States Department of Housing and Urban Development, United States Department of Interior, United States Department of Labor, United States Department of Transportation, United States Department of Treasury, United States Department of Veterans Affairs, Russell Vought, Christopher Wright, Lee Zeldin. (Thomas, Beatrice) (Entered: 03/14/2025)"
    },
    {
        "id": 419285523,
        "docket_id": 69714275,
        "date_filed": "2025-03-14",
        "date_modified": "2025-04-23T10:25:56.591577-07:00",
        "entry_number": 45,
        "description": "MOTION to Appear Pro Hac Vice for Jonathan Rose (Filing fee $100, receipt number AMDDC-11842599.) by Vermont(Handley, James) (Entered: 03/14/2025)"
    },
    {
        "id": 419243888,
        "docket_id": 69714275,
        "date_filed": "2025-03-13",
        "date_modified": "2025-04-23T10:25:56.572989-07:00",
        "entry_number": 44,
        "description": "(VACATED See 125 Superseding Order) TEMPORARY RESTRAINING ORDER; Status Report due 3/17/2025, at 1:00 p.m.; any motion for extension of this Order is due 3/21/2025, at 4:00 p.m.; any hearing on a motion for Preliminary Injunction will occur on 3/26/2025, at 9:30 a.m.; each Plaintiff shall post a bond forthwith; unless otherwise ordered, this Order shall expire on 3/27/2025, at 8:00 p.m. Signed by Judge James K Bredar on 3/13/2025. (kns, Deputy Clerk) Modified on 4/1/2025 (jf3s). (Entered: 03/13/2025)"
    },
    {
        "id": 419243887,
        "docket_id": 69714275,
        "date_filed": "2025-03-13",
        "date_modified": "2025-04-23T10:25:56.546198-07:00",
        "entry_number": 43,
        "description": "MEMORANDUM. Signed by Judge James K Bredar on 3/13/2025. (kns, Deputy Clerk) (Entered: 03/13/2025)"
    },
    {
        "id": 419236749,
        "docket_id": 69714275,
        "date_filed": "2025-03-13",
        "date_modified": "2025-04-23T10:25:56.527138-07:00",
        "entry_number": 42,
        "description": "NOTICE of Appearance by Cara Jo Spencer on behalf of District Of Columbia (Spencer, Cara) (Entered: 03/13/2025)"
    },
    {
        "id": 419215183,
        "docket_id": 69714275,
        "date_filed": "2025-03-13",
        "date_modified": "2025-04-23T10:25:56.508845-07:00",
        "entry_number": 41,
        "description": "MOTION to Appear Pro Hac Vice for Debbie Taylor (Filing fee $100, receipt number AMDDC-11841464.) by People of the State of Michigan(Handley, James) (Entered: 03/13/2025)"
    },
    {
        "id": 419215182,
        "docket_id": 69714275,
        "date_filed": "2025-03-13",
        "date_modified": "2025-04-23T10:25:56.484979-07:00",
        "entry_number": 40,
        "description": "MOTION to Appear Pro Hac Vice for Bryan Davis Jr. (Filing fee $100, receipt number AMDDC-11841386.) by People of the State of Michigan(Handley, James) (Entered: 03/13/2025)"
    },
    {
        "id": 419207624,
        "docket_id": 69714275,
        "date_filed": "2025-03-13",
        "date_modified": "2025-04-23T10:25:56.465839-07:00",
        "entry_number": 39,
        "description": "MOTION to Appear Pro Hac Vice for Anjana Samant (Filing fee $100, receipt number AMDDC-11841330.) by New Mexico(Handley, James) (Entered: 03/13/2025)"
    },
    {
        "id": 419203556,
        "docket_id": 69714275,
        "date_filed": "2025-03-13",
        "date_modified": "2025-04-23T10:25:56.447702-07:00",
        "entry_number": 38,
        "description": "MOTION to Appear Pro Hac Vice for Rabia Muqaddam (Filing fee $100, receipt number AMDDC-11841254.) by New York(Handley, James) (Entered: 03/13/2025)"
    },
    {
        "id": 419053893,
        "docket_id": 69714275,
        "date_filed": "2025-03-12",
        "date_modified": "2025-04-23T10:25:56.429260-07:00",
        "entry_number": 37,
        "description": "MOTION to Appear Pro Hac Vice for Demian Camacho (Filing fee $100, receipt number AMDDC-11838185.) by California(Handley, James) (Entered: 03/12/2025)"
    },
    {
        "id": 419053892,
        "docket_id": 69714275,
        "date_filed": "2025-03-12",
        "date_modified": "2025-04-23T10:25:56.410153-07:00",
        "entry_number": 36,
        "description": "MOTION to Appear Pro Hac Vice for Miranda Maison (Filing fee $100, receipt number AMDDC-11838170.) by California(Handley, James) (Entered: 03/12/2025)"
    },
    {
        "id": 419053891,
        "docket_id": 69714275,
        "date_filed": "2025-03-12",
        "date_modified": "2025-04-23T10:25:56.391739-07:00",
        "entry_number": 35,
        "description": "MOTION to Appear Pro Hac Vice for Satoshi Yanai (Filing fee $100, receipt number AMDDC-11838125.) by California(Handley, James) (Entered: 03/12/2025)"
    },
    {
        "id": 419052733,
        "docket_id": 69714275,
        "date_filed": "2025-03-12",
        "date_modified": "2025-04-23T10:25:56.370050-07:00",
        "entry_number": 34,
        "description": "MOTION to Appear Pro Hac Vice for Kaliko'onalani D. Fernandes (Filing fee $100, receipt number AMDDC-11838043.) by Hawaii(Handley, James) (Entered: 03/12/2025)"
    },
    {
        "id": 419052732,
        "docket_id": 69714275,
        "date_filed": "2025-03-12",
        "date_modified": "2025-04-23T10:25:56.350742-07:00",
        "entry_number": 33,
        "description": "REDACTED DOCUMENT by Arizona, California, Colorado, Connecticut, Delaware, District Of Columbia, Hawaii, Illinois, Massachusetts, Minnesota, Nevada, New Jersey, New Mexico, New York, Oregon, People of the State of Michigan, Rhode Island, State of Maryland, Vermont, Wisconsin (Attachments: # 1 Exhibit M, # 2 Exhibit N, # 3 Exhibit O, # 4 Exhibit P, # 5 Exhibit Q, # 6 Exhibit R, # 7 Exhibit S, # 8 Exhibit T, # 9 Exhibit U, # 10 Exhibit V, # 11 Exhibit W, # 12 Exhibit X, # 13 Exhibit Y, # 14 Exhibit Z, # 15 Exhibit AA, # 16 Exhibit BB, # 17 Exhibit CC, # 18 Exhibit DD, # 19 Exhibit EE)(Williamson, Virginia) (Entered: 03/12/2025)"
    },
    {
        "id": 419052731,
        "docket_id": 69714275,
        "date_filed": "2025-03-12",
        "date_modified": "2025-04-23T10:25:56.331808-07:00",
        "entry_number": 32,
        "description": "MOTION to Appear Pro Hac Vice for David Day (Filing fee $100, receipt number AMDDC-11838013.) by Hawaii(Handley, James) (Entered: 03/12/2025)"
    },
    {
        "id": 419051628,
        "docket_id": 69714275,
        "date_filed": "2025-03-12",
        "date_modified": "2025-04-23T10:25:56.311823-07:00",
        "entry_number": 31,
        "description": "MOTION to Appear Pro Hac Vice for Gretchen Helfrich (Filing fee $100, receipt number AMDDC-11837480.) by Illinois(Handley, James) (Entered: 03/12/2025)"
    },
    {
        "id": 419051627,
        "docket_id": 69714275,
        "date_filed": "2025-03-12",
        "date_modified": "2025-04-23T10:25:56.293076-07:00",
        "entry_number": 30,
        "description": "MOTION to Appear Pro Hac Vice for Elizabeth Kramer (Filing fee $100, receipt number AMDDC-11836908.) by Minnesota(Handley, James) (Entered: 03/12/2025)"
    },
    {
        "id": 419051626,
        "docket_id": 69714275,
        "date_filed": "2025-03-12",
        "date_modified": "2025-04-23T10:25:56.274394-07:00",
        "entry_number": 29,
        "description": "MOTION to Appear Pro Hac Vice for Michael Kenneth Skold (Filing fee $100, receipt number AMDDC-11836520.) by Connecticut(Handley, James) (Entered: 03/12/2025)"
    },
    {
        "id": 419051625,
        "docket_id": 69714275,
        "date_filed": "2025-03-12",
        "date_modified": "2025-04-23T10:25:56.256134-07:00",
        "entry_number": 28,
        "description": "Motion Hearing held on 3/12/2025 re 4 MOTION for Temporary Restraining Order filed by Massachusetts, New Jersey, Minnesota, New Mexico, Arizona, Oregon, Nevada, People of the State of Michigan, Wisconsin, Hawaii, District Of Columbia, Vermont, California, Delaware, New York, Connecticut, Illinois, Rhode Island, Colorado, State of Maryland before Judge James K Bredar. (Russell Carrick - Courtroom 1A)(Court Reporter: Kassandra McPherson) (rc2s, Deputy Clerk) (Entered: 03/12/2025)"
    },
    {
        "id": 419019579,
        "docket_id": 69714275,
        "date_filed": "2025-03-12",
        "date_modified": "2025-04-23T10:25:56.236540-07:00",
        "entry_number": 27,
        "description": "MOTION to Appear Pro Hac Vice for David Moskowitz (Filing fee $100, receipt number AMDDC-11836125.) by Colorado(Handley, James) (Entered: 03/12/2025)"
    },
    {
        "id": 419010281,
        "docket_id": 69714275,
        "date_filed": "2025-03-12",
        "date_modified": "2025-04-23T10:25:56.216397-07:00",
        "entry_number": 26,
        "description": "MOTION to Appear Pro Hac Vice for Hayleigh S. Crawford (Filing fee $100, receipt number AMDDC-11835949.) by Arizona(Handley, James) (Entered: 03/12/2025)"
    },
    {
        "id": 419007197,
        "docket_id": 69714275,
        "date_filed": "2025-03-12",
        "date_modified": "2025-04-23T10:25:56.197610-07:00",
        "entry_number": 25,
        "description": "MOTION to Appear Pro Hac Vice for Shankar Duraiswamy as counsel for New Jersey (Filing fee $100, receipt number AMDDC-11835874.) by New Jersey(Levy, Nathaniel) (Entered: 03/12/2025)"
    },
    {
        "id": 418997851,
        "docket_id": 69714275,
        "date_filed": "2025-03-11",
        "date_modified": "2025-04-23T10:25:56.179322-07:00",
        "entry_number": 24,
        "description": "NOTICE of Appearance by Nathaniel Ilan Levy on behalf of New Jersey (Levy, Nathaniel) (Entered: 03/11/2025)"
    },
    {
        "id": 418970264,
        "docket_id": 69714275,
        "date_filed": "2025-03-11",
        "date_modified": "2025-04-23T10:25:56.160040-07:00",
        "entry_number": 23,
        "description": "NOTICE of Appearance by Tessa Gellerson on behalf of District Of Columbia (Gellerson, Tessa) (Entered: 03/11/2025)"
    },
    {
        "id": 418970259,
        "docket_id": 69714275,
        "date_filed": "2025-03-11",
        "date_modified": "2025-04-23T10:25:56.141630-07:00",
        "entry_number": 22,
        "description": "NOTICE of Appearance by Charles Andrew Sinks on behalf of District Of Columbia (Sinks, Charles) (Entered: 03/11/2025)"
    },
    {
        "id": 418888771,
        "docket_id": 69714275,
        "date_filed": "2025-03-11",
        "date_modified": "2025-04-23T10:25:56.122642-07:00",
        "entry_number": 21,
        "description": "NOTICE of Appearance by Virginia Anne Williamson on behalf of State of Maryland (Williamson, Virginia) (Entered: 03/11/2025)"
    },
    {
        "id": 418804519,
        "docket_id": 69714275,
        "date_filed": "2025-03-10",
        "date_modified": "2025-04-23T10:25:56.096373-07:00",
        "entry_number": 20,
        "description": "RESPONSE in Opposition re 4 MOTION for Temporary Restraining Order filed by Scott Bessent, Douglas Burgum, Douglas A. Collins, Consumer Financial Protection Bureau, Sean P Duffy, Stephen Ehikian, Environmental Protection Agency, Charles Ezell, Federal Deposit Insurance Corporation, General Services Administration, Peter Hegseth, Travis Hill, Robert F. Kennedy, Jr, Kelly Loefler, Howard Lutnick, Linda McMahon, Vincent Micone, National Archives and Records Administration, Kristi Noem, Office of Personnel Management, Brooke Rollins, Marco Rubio, Marco Rubio, Small Business Administration, Scott Turner, United States Agency for International Development, United States Department of Agriculture, United States Department of Commerce, United States Department of Defense, United States Department of Education, United States Department of Energy, United States Department of Health & Human Services, United States Department of Homeland Security, United States Department of Housing and Urban Development, United States Department of Interior, United States Department of Labor, United States Department of Transportation, United States Department of Treasury, United States Department of Veterans Affairs, Russell Vought, Christopher Wright, Lee Zeldin. (Attachments: # 1 Exhibit)(Thomas, Beatrice) (Entered: 03/10/2025)"
    },
    {
        "id": 418804518,
        "docket_id": 69714275,
        "date_filed": "2025-03-10",
        "date_modified": "2025-04-23T10:25:56.075354-07:00",
        "entry_number": 19,
        "description": "NOTICE by Arizona, California, Colorado, Connecticut, Delaware, District Of Columbia, Hawaii, Illinois, Massachusetts, Minnesota, Nevada, New Jersey, New Mexico, New York, Oregon, People of the State of Michigan, Rhode Island, State of Maryland, Vermont, Wisconsin re 4 MOTION for Temporary Restraining Order Supplemental Briefing in Response to the Court's Order of March 7, 2025 (Handley, James) (Entered: 03/10/2025)"
    },
    {
        "id": 418804517,
        "docket_id": 69714275,
        "date_filed": "2025-03-10",
        "date_modified": "2025-04-23T10:25:56.055790-07:00",
        "entry_number": 18,
        "description": "NOTICE by Arizona, California, Colorado, Connecticut, Delaware, District Of Columbia, Hawaii, Illinois, Massachusetts, Minnesota, Nevada, New Jersey, New Mexico, New York, Oregon, People of the State of Michigan, Rhode Island, State of Maryland, Vermont, Wisconsin Concerning Plaintiffs' Participation in Hearing (Handley, James) (Entered: 03/10/2025)"
    },
    {
        "id": 418667612,
        "docket_id": 69714275,
        "date_filed": "2025-03-07",
        "date_modified": "2025-04-23T10:25:56.035134-07:00",
        "entry_number": 17,
        "description": "ORDER directing that the caption of this case shall be \"STATE OF MARYLAND, et al., Plaintiffs v. UNITED STATES DEPARTMENT OF AGRICULTURE, et al., Defendants\"; that a hearing on the Motion for Temporary Restraining Order is set in for March 12, 2025, at 9:30 a.m. in the J. Frederick Motz Ceremonial Courtroom; that the parties may file briefs on or before March 10, 2025, at 2:00 p.m. and that the parties shall advise the Court of any intention to present evidence at the hearing on or before March 10, 2025, at 2:00 p.m. Signed by Judge James K Bredar on 3/7/2025. (kns, Deputy Clerk) (Entered: 03/07/2025)"
    },
    {
        "id": 418667610,
        "docket_id": 69714275,
        "date_filed": "2025-03-07",
        "date_modified": "2025-04-23T10:25:56.015730-07:00",
        "entry_number": 16,
        "description": "Status Conference held on 3/7/2025 before Judge James K Bredar.(Court Reporter: Trish Mitchell - Courtroom 5A) (kmts, Deputy Clerk) (Entered: 03/07/2025)"
    },
    {
        "id": 418667609,
        "docket_id": 69714275,
        "date_filed": "2025-03-07",
        "date_modified": "2025-04-23T10:25:55.994235-07:00",
        "entry_number": 15,
        "description": "ORDER regarding electronic devices in future proceedings. Signed by Judge James K Bredar on 3/7/2025. (kns, Deputy Clerk) (Entered: 03/07/2025)"
    },
    {
        "id": 418654624,
        "docket_id": 69714275,
        "date_filed": "2025-03-07",
        "date_modified": "2025-04-23T10:25:55.971923-07:00",
        "entry_number": 14,
        "description": "Summons Issued 60 days as to Scott Bessent, Douglas Burgum, Douglas A. Collins, Consumer Financial Protection Bureau, Sean P Duffy, Stephen Ehikian, Environmental Protection Agency, Charles Ezell, Federal Deposit Insurance Corporation, General Services Administration, Peter Hegseth, Travis Hill, Robert F. Kennedy, Jr, Kelly Loefler, Howard Lutnick, Linda McMahon, Vincent Micone, National Archives and Records Administration, Kristi Noem, Office of Personnel Management, Brooke Rollins, Marco Rubio, Marco Rubio, Small Business Administration, Scott Turner, United States Agency for International Development, United States Department of Agriculture, United States Department of Commerce, United States Department of Defense, United States Department of Education, United States Department of Energy, United States Department of Health & Human Services, United States Department of Homeland Security, United States Department of Housing and Urban Development, United States Department of Interior, United States Department of Labor, United States Department of Transportation, United States Department of Treasury, United States Department of Veterans Affairs, Russell Vought, Christopher Wright, Lee Zeldin, U.S. Attorney and U.S. Attorney General (ols, Deputy Clerk) (Entered: 03/07/2025)"
    },
    {
        "id": 418636816,
        "docket_id": 69714275,
        "date_filed": "2025-03-07",
        "date_modified": "2025-04-23T10:25:55.950974-07:00",
        "entry_number": 13,
        "description": "NOTICE of Appearance by Beatrice C. Thomas on behalf of All Defendants (Thomas, Beatrice) (Entered: 03/07/2025)"
    },
    {
        "id": 418636814,
        "docket_id": 69714275,
        "date_filed": "2025-03-07",
        "date_modified": "2025-04-23T10:25:55.931339-07:00",
        "entry_number": 12,
        "description": "ORDER Re: Scheduling Conference Call. Signed by Judge James K Bredar on 3/7/2025. (kb3s, Deputy Clerk) (Entered: 03/07/2025)"
    },
    {
        "id": 418636813,
        "docket_id": 69714275,
        "date_filed": "2025-03-07",
        "date_modified": "2025-04-23T10:25:55.911254-07:00",
        "entry_number": 11,
        "description": "NOTICE by Scott Bessent, Douglas Burgum, Douglas A. Collins, Consumer Financial Protection Bureau, Stephen Ehikian, Environmental Protection Agency, Charles Ezell, Federal Deposit Insurance Corporation, General Services Administration, Peter Hegseth, Travis Hill, Robert F. Kennedy, Jr, Kelly Loefler, Howard Lutnick, Linda McMahon, Vincent Micone, National Archives and Records Administration, Kristi Noem, Office of Personnel Management, Brooke Rollins, Marco Rubio, Marco Rubio, Small Business Administration, Scott Turner, United States Agency for International Development, United States Department of Agriculture, United States Department of Commerce, United States Department of Defense, United States Department of Education, United States Department of Energy, United States Department of Health & Human Services, United States Department of Homeland Security, United States Department of Housing and Urban Development, United States Department of Interior, United States Department of Labor, United States Department of Transportation, United States Department of Treasury, United States Department of Veterans Affairs, Russell Vought, Christopher Wright, Lee Zeldin (Corcoran, Tom) (Entered: 03/07/2025)"
    },
    {
        "id": 418636812,
        "docket_id": 69714275,
        "date_filed": "2025-03-07",
        "date_modified": "2025-04-23T10:25:55.891976-07:00",
        "entry_number": 10,
        "description": "MARGINAL ORDER granting 6 MOTION to Seal Exhibits M-EE to Motion for Temporary Restraining Order. Signed by Judge James K Bredar on 3/7/2025. (kb3s, Deputy Clerk) (Entered: 03/07/2025)"
    },
    {
        "id": 418636811,
        "docket_id": 69714275,
        "date_filed": "2025-03-07",
        "date_modified": "2025-04-23T10:25:55.872836-07:00",
        "entry_number": 9,
        "description": "ORDER Directing the U.S. Attorney for the District of Maryland to file a notice with the Court indicating whether they are aware of this lawsuit and specifically have received notice of the Plaintiff's request that the Court enter a Temporary Restraining Order. Signed by Judge James K Bredar on 3/7/2025. (kb3s, Deputy Clerk) (Entered: 03/07/2025)"
    },
    {
        "id": 418636809,
        "docket_id": 69714275,
        "date_filed": "2025-03-07",
        "date_modified": "2025-04-23T10:25:55.854359-07:00",
        "entry_number": 8,
        "description": "NOTICE by Arizona, California, Colorado, Connecticut, Delaware, District Of Columbia, Hawaii, Illinois, Maryland, Massachusetts, Minnesota, Nevada, New Jersey, New Mexico, New York, Oregon, People of the State of Michigan, Rhode Island, Vermont, Wisconsin re 1 Complaint,,,,,,, Summons to The Attorney General of the United States (Handley, James) (Entered: 03/07/2025)"
    },
    {
        "id": 418636808,
        "docket_id": 69714275,
        "date_filed": "2025-03-07",
        "date_modified": "2025-04-23T10:25:55.835705-07:00",
        "entry_number": 7,
        "description": "NOTICE by Arizona, California, Colorado, Connecticut, Delaware, District Of Columbia, Hawaii, Illinois, Maryland, Massachusetts, Minnesota, Nevada, New Jersey, New Mexico, New York, Oregon, People of the State of Michigan, Rhode Island, Vermont, Wisconsin re 1 Complaint,,,,,,, Proposed Summons to US Attorney for District of Maryland (Handley, James) (Entered: 03/07/2025)"
    },
    {
        "id": 418622285,
        "docket_id": 69714275,
        "date_filed": "2025-03-07",
        "date_modified": "2025-04-23T10:25:55.816120-07:00",
        "entry_number": 6,
        "description": "MOTION to Seal Exhibits M-EE to Motion for Temporary Restraining Order by Arizona, California, Colorado, Connecticut, Delaware, District Of Columbia, Hawaii, Illinois, Maryland, Massachusetts, Minnesota, Nevada, New Jersey, New Mexico, New York, Oregon, People of the State of Michigan, Rhode Island, Vermont, Wisconsin (Attachments: # 1 Text of Proposed Order)(Handley, James) (Entered: 03/07/2025)"
    },
    {
        "id": 418622284,
        "docket_id": 69714275,
        "date_filed": "2025-03-07",
        "date_modified": "2025-04-23T10:25:55.798046-07:00",
        "entry_number": 5,
        "description": "-SEALED - NOTICE of Filing Under Seal Exhibits M-EE to Motion for Temporary Restraining Order by Arizona, California, Colorado, Connecticut, Delaware, District Of Columbia, Hawaii, Illinois, Maryland, Massachusetts, Minnesota, Nevada, New Jersey, New Mexico, New York, Oregon, People of the State of Michigan, Rhode Island, Vermont, Wisconsin re 4 MOTION for Temporary Restraining Order (Attachments: # 1 Exhibit, # 2 Exhibit, # 3 Exhibit, # 4 Exhibit, # 5 Exhibit, # 6 Exhibit, # 7 Exhibit, # 8 Exhibit, # 9 Exhibit, # 10 Exhibit, # 11 Exhibit, # 12 Exhibit, # 13 Exhibit, # 14 Exhibit, # 15 Exhibit, # 16 Exhibit, # 17 Exhibit, # 18 Exhibit, # 19 Exhibit)(Handley, James) (Entered: 03/07/2025)"
    },
    {
        "id": 418622283,
        "docket_id": 69714275,
        "date_filed": "2025-03-07",
        "date_modified": "2025-04-23T10:25:55.774820-07:00",
        "entry_number": 4,
        "description": "MOTION for Temporary Restraining Order by Arizona, California, Colorado, Connecticut, Delaware, District Of Columbia, Hawaii, Illinois, Maryland, Massachusetts, Minnesota, Nevada, New Jersey, New Mexico, New York, Oregon, People of the State of Michigan, Rhode Island, Vermont, Wisconsin (Attachments: # 1 Memorandum in Support, # 2 Text of Proposed Order, # 3 Attachment Certification of Notice, # 4 Attachment Exhibit Index, # 5 Exhibit, # 6 Exhibit, # 7 Exhibit, # 8 Exhibit, # 9 Exhibit, # 10 Exhibit, # 11 Exhibit, # 12 Exhibit, # 13 Exhibit, # 14 Exhibit, # 15 Exhibit, # 16 Exhibit, # 17 Exhibit, # 18 Exhibit, # 19 Exhibit, # 20 Exhibit, # 21 Exhibit, # 22 Exhibit, # 23 Exhibit, # 24 Exhibit, # 25 Exhibit, # 26 Exhibit, # 27 Exhibit, # 28 Exhibit, # 29 Exhibit, # 30 Exhibit, # 31 Exhibit, # 32 Exhibit, # 33 Exhibit, # 34 Exhibit, # 35 Exhibit, # 36 Exhibit, # 37 Exhibit, # 38 Exhibit, # 39 Exhibit)(Handley, James) (Entered: 03/07/2025)"
    },
    {
        "id": 418585496,
        "docket_id": 69714275,
        "date_filed": "2025-03-07",
        "date_modified": "2025-04-23T10:25:55.749462-07:00",
        "entry_number": 3,
        "description": "QC NOTICE regarding: 1 Complaint filed by Massachusetts, New Jersey, Minnesota, New Mexico, Arizona, Oregon, Nevada, People of the State of Michigan, Wisconsin, Hawaii, District Of Columbia, Maryland, Vermont, California, Delaware, New York, Connecticut, Illinois, Rhode Island, Colorado. **The following attachments or exhibits are missing - proposed summonses for the United States Attorney General and the United States Attorney for the District of Maryland. To correct this problem, file proposed summonses using the event Notice (Other) and link proposed summonses to 1 Complaint. (kns, Deputy Clerk) (Entered: 03/07/2025)"
    },
    {
        "id": 418585495,
        "docket_id": 69714275,
        "date_filed": "2025-03-07",
        "date_modified": "2025-04-23T10:25:55.722114-07:00",
        "entry_number": 2,
        "description": "QC NOTICE regarding: 1 Complaint filed by Massachusetts, New Jersey, Minnesota, New Mexico, Arizona, Oregon, Nevada, People of the State of Michigan, Wisconsin, Hawaii, District Of Columbia, Maryland, Vermont, California, Delaware, New York, Connecticut, Illinois, Rhode Island, Colorado was filed incorrectly. **Not all pdf documents were flattened prior to filing. All pdfs uploaded to CM/ECF MUST BE FLATTENED for all future filings. Failure to comply may result in rejected filings and delays in case processing. Please ensure all future documents are flattened prior to uploading to CM/ECF using the following steps: Select File --> Print --> Adobe PDF or Microsoft Print to PDF. **This filing has been corrected by court staff and no further corrective action is required. (kns, Deputy Clerk) (Entered: 03/07/2025)"
    },
    {
        "id": 418575396,
        "docket_id": 69714275,
        "date_filed": "2025-03-07",
        "date_modified": "2025-04-23T10:25:55.560736-07:00",
        "entry_number": null,
        "description": "Case Reassigned to Judge James K Bredar. Judge Adam B Abelson no longer assigned to the case. (kns, Deputy Clerk)"
    },
    {
        "id": 418572346,
        "docket_id": 69714275,
        "date_filed": "2025-03-06",
        "date_modified": "2025-04-23T10:25:55.520205-07:00",
        "entry_number": 1,
        "description": "COMPLAINT against All Defendants ( Filing fee $ 405 receipt number AMDDC-11826453.), filed by Connecticut, Oregon, Minnesota, Maryland, Rhode Island, New York, Wisconsin, New Jersey, Illinois, Massachusetts, Nevada, Colorado, District Of Columbia, Hawaii, People of the State of Michigan, New Mexico, Delaware, Arizona, Vermont, California. (Attachments: # 1 Civil Cover Sheet - not flattened, # 2 Summons - not flattened, # 3 Summons - not flattened, # 4 Summons - not flattened, # 5 Summons - not flattened, # 6 Summons - not flattened, # 7 Summons - not flattened, # 8 Summons - not flattened, # 9 Summons - not flattened, # 10 Summons - not flattened, # 11 Summons - not flattened, # 12 Summons - not flattened, # 13 Summons - not flattened, # 14 Summons - not flattened, # 15 Summons - not flattened, # 16 Summons - not flattened, # 17 Summons - not flattened, # 18 Summons - not flattened, # 19 Summons - not flattened, # 20 Summons - not flattened, # 21 Summons - not flattened, # 22 Summons - not flattened, # 23 Summons - not flattened, # 24 Summons - not flattened, # 25 Summons - not flattened, # 26 Summons - not flattened, # 27 Summons - not flattened, # 28 Summons - not flattened, # 29 Summons - not flattened, # 30 Summons - not flattened, # 31 Summons - not flattened, # 32 Summons, - not flattened # 33 Summons - not flattened, # 34 Summons - not flattened, # 35 Summons - not flattened, # 36 Summons - not flattened, # 37 Summons - not flattened, # 38 Summons - not flattened, # 39 Summons - not flattened, # 40 Summons - not flattened, # 41 Summons - not flattened, # 42 Summons - not flattened, # 43 Summons - not flattened)(Handley, James) Modified on 3/7/2025 (kns). (Additional attachment(s) added on 3/7/2025: # 44 Civil Cover Sheet - flattened, # 45 Proposed Summonses - flattened) (kns). (Entered: 03/06/2025)"
    }
]